[
    {
        "full_article": "The government and the Opposition crossed swords in Parliament during a discussion on Operation Sindoor this week. There was unanimity in praising India’s armed forces, but there was little common ground beyond that. Operation Sindoor was India’s military response to the terrorist attack in Pahalgam, on April 22, 2025, which claimed 26 lives. The elimination of three terrorists behind the attack, just before the parliamentary debate, helped the government’s case. It told Parliament that these terrorists were Lashkar-e-Taiba members from Pakistan. The Narendra Modi government’s strident approach seeks to change the behaviour of Pakistan and reassure its domestic audience. The success of this approach is debatable and the Opposition sought to put the government on the spot on both counts. A demonstrated willingness to use force against Pakistan in the event of a terrorism incident is a definitive turn in India’s strategy, and the Bharatiya Janata Party (BJP) takes pride in that. But there is no evidence yet that it is working though there has been chest thumping around it by the ruling party. The discussion in Parliament barely addressed the implications of this approach, which is being touted as the new normal. The Opposition and the government agreed on the need to punish Pakistan, and also disagreed on who would do it better.The government claimed success in meeting its objectives of launching a military operation and denied that it had acted under pressure in ending the war. Leader of Opposition in the Lok Sabha Rahul Gandhi demanded a pointed response to repeated claims by U.S. President Donald Trump that he mediated the ceasefire but the Prime Minister evaded a direct response on it. The government contradicts itself when it says that the operation was a success, and that it is continuing. It is also exasperating to hear a party that is now in its eleventh year of uninterrupted power, blame people who passed away decades ago for any challenge that India faces now. There was little self-reflection regarding the lapses that led to the terrorism incident, and whether and how the government plans to address them. The government had sent joint teams including several MPs from the Opposition abroad to garner support for India in the aftermath of the operation, but that sign of statesmanship was a short-lived aberration, as it turns out. The world is changing rapidly and India’s capacity to navigate those changes will be largely determined by its own character. Questioning the patriotism of political opponents is an easy route to take to evade tough questions, but the BJP must realise that such an approach has diminishing returns.\r Published - August 02, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Parliament proceedings\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Narendra Modi\n                    \n                            /                      \n                        \n                        national government\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "​House of wars: On Parliament, Operation Sindoor discussion",
        "headline_2": "Attacking political rivals cannot be a way to evade responsibility",
        "link": "https://www.thehindu.com/opinion/editorial/house-of-wars-on-parliament-operation-sindoor-discussion/article69883301.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "Prime Minister Narendra Modi’s visit to the Maldives last week, after an invitation by Maldives President Mohamed Muizzu to be a special guest for the country’s 60th Independence Day, signalled the full return of relations to the closeness they held during the previous Ibrahim Solih government. Although the two leaders had not gotten off to the best start in 2023, after Mr. Muizzu’s surprise win, backed by an “India Out” campaign — this was followed by a “Boycott Maldives” social media campaign in India — they have been on the mend for the past year. During Mr. Muizzu’s 2024 state visit to India, India had announced measures including lines of credit and a currency swap arrangement to support the Maldives during its economic troubles. Mr. Muizzu reflected gratitude when he described India’s role in the Maldives as “pivotal” and Mr. Modi reciprocated the warmth. India announced a line of credit worth $565 million (₹4,850 crore) and reduced the annual debt burden for Maldives on previous Indian lines of credit by 40%. There was also the launch of India-Maldives Free Trade Agreement negotiations, which will be a significant driver of future engagement. There was the signing too of MoUs for cooperation in fisheries, meteorological sciences, digital solutions and pharma, as well as a digital and rupee-rufiyaa national currency payments agreement. Over the past six decades, India has cultivated a strong security partnership with the Maldives, including trilateral national security consultations with Sri Lanka, and it is significant that after Mr. Modi’s visit, Mr. Muizzu welcomed Sri Lankan President Anura Kumara Dissanayake for a state visit.The Maldives visit was also a reaffirmation of the importance of India’s “Neighbourhood First” policy, at a time when Indian foreign policy is facing headwinds linked to the U.S.’s trade tariffs and the conflicts in Ukraine and Gaza. The conflict with Pakistan after the Pahalgam attacks, and tensions with Bangladesh have engaged the government’s attention. New Delhi has also been preoccupied with reaching out to different countries, following Operation Sindoor, but did not send delegations to neighbouring countries. It is heartening that New Delhi is preparing to welcome Nepal Prime Minister K.P. Sharma Oli, who has not been invited to India since he took office a year ago. A commemorative stamp by the Maldives for its national day celebrations showed traditional Indian and Maldives boats, which Mr. Modi described as a reflection of India and the Maldives being not just neighbours “but also fellow voyagers on a shared journey”. In a time of global economic turmoil, a closer engagement with the neighbours — one that shores up their economic needs and supports their plans for development where possible — is essential.\r Published - August 02, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Maldives\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        economic policy\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        foreign aid\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        Nepal\n                    \n                            /                      \n                        \n                        India",
        "headline_1": "​Deep ties: On India-Maldives ties",
        "headline_2": "India needs to engage its neighbours more closely",
        "link": "https://www.thehindu.com/opinion/editorial/deep-ties-on-india-maldives-ties/article69883415.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "Trump’s dead economy jibe says a lot about him\nWorld’s most powerful man telling the biggest countries by population and landmass to “take their dead economies down together” deserves “bigly covfefe” – Trump-speak for big coverage. Why say such a silly thing – Trump was being a churl. How an economy dies is a riddle, though. If it’s dead, who takes it down? An economy isn’t dead while its last two humans are in touch. One swaps a tea bag for biscuits with the other, and you have a trade. The ECG of economics registers a beat. India has over 1.4bn humans, raising the possibility of some 980-million-billion unique barter trades. Hardly a “dead” economy. \nAnd if India is a dead economy, why is Trump itching to sell soy, maize and butter to it? A dead economy doesn’t produce, or export, so unless you are hallucinating, how do you have a negative balance of trade with it? Why bother to negotiate with it for four months, and then slap 25% tariff in exasperation? If “deadness” is about slow growth, India’s actually the fastest growing major economy. Besides, an economy with slow or no GDP growth is no more dead than a full-grown tree. Just look at Japan. But with Trump, “dead” can also be a tribute. Like he told steelworker Scott Sauritch in 2018: “Your father Herman is looking down…proud of you.” When Scott said his father was alive, Trump said, “Well then, he’s even more proud of you.”\n\n",
        "headline_1": "Deadly stuff",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/deadly-stuff/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "Infinite growth won’t end poverty, better distribution will \nA motorcar is made of steel, aluminium, copper, glass, rubber, and numerous other things. All of these are finite resources. Steel is also needed for buildings and machinery. Glass for bottles and watch dials. Aluminium for pressure cookers and soda cans. When finite resources have competing uses, it’s a miracle that the production of cars, etc, keeps increasing year after year, and the world becomes a wealthier place with it. It wasn’t always so, though. \nTwo centuries ago, economists were a grim lot, and Robert Malthus was more pessimistic than most. He worried that there wasn’t enough land on Earth to feed the increasing population, which was nudging 1bn then. But we’re 8bn-plus now, and growing, without exhausting Earth’s carrying capacity. In fact, we’ve become so used to the idea of growth that a 6.5% increase in GDP seems lacklustre, 5% dismal. \nIn his new book, The Invention of Infinite Growth: How Economists Came to Believe a Dangerous Delusion, Christopher F Jones, associate professor of history at Arizona State University, examines how growth became a modern “ideal”, and its impact on the planet. \nGDP may be an abstruse idea for most, but it’s become the default measure of growth – up is good, down bad, and the faster it rises the better. Some say it’s the most powerful number in the world. But as Jones points out, GDP is a relatively recent concept, developed in 1934, and applied only after WW2. The real big change that came with it was that growth – through its proxy GDP – came to be seen as key to jobs, peace and prosperity. Hence, for the first time in history, it became govt’s responsibility. Using different policy tools, govts were expected to make national economies run faster. Those that couldn’t were booted out in democracies.\nThe idea of infinite growth, however, didn’t form for almost 20 years after. It happened in the 1960s when US and USSR were pursuing growth intensely during the Cold War, and oil production in West Asia doubled in a decade, even as the known oil reserves trebled. These developments gave rise to irrational exuberance among economists and policymakers. In 1992, when he was World Bank’s chief economist, Larry Summers declared: “There are no limits to the carrying capacity of the Earth.”\nBut ask scientists if infinite growth is possible, and they’ll say no. They’re also deeply concerned about the ecological impacts of unbridled growth. So, why are economists divorced from observed reality? Jones says it’s because they trust technology to overcome natural limits, and don’t concern themselves with the natural world. As long as the “delusion” of infinite growth shapes policy, clearing forests for highways and mines will be seen as “progress”. But Jones says it’s time economists started taking the environment – and its limits – seriously. The “false confidence” about “managing” the consequences of climate change and biodiversity loss should be abandoned.\nIt’s known that economic growth and well-being don’t increase in tandem beyond the mid-income level. Billionaires are not happier than millionaires – at least not because of their wealth. Since infinite growth is not sustainable, govts should now focus on income distribution rather than maximisation, Jones says. Growth can’t be an end anymore – it has to be targeted at those who need it most, and away from those who don’t.\n\n",
        "headline_1": "Growth’s losing steam, govts must steer better",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/growths-losing-steam-govts-must-steer-better/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "Police, prosecution & court exemplary on Revanna\nFormer JDS parliamentarian Prajwal Revanna’s conviction in less than a year in one of four cases of sexual abuse and rape, is a rare and welcome glimpse of how JUSTICE should work. Prajwal, former PM Deve Gowda’s grandson, is accused of multiple rapes and recording his own crimes. Explicit videos surfaced in pen drives ahead of LS polls last year, including clips, photos, and screenshots. Troublingly, all the victims could be identified by locals who saw those videos. Police estimated about 100 women had been abused – house-help, staff, party and govt workers. Family clout ensured silence. Prajwal’s first reaction was exactly how powerful, entitled abusers respond: allege political conspiracy, bully media, get gag orders and go scarce. Obnoxiously, Prajwal’s parents even kidnapped a victim. Prajwal chose Germany to lie low, no doubt assured the triad of privilege – politicians, police and lower judicial staff – would ‘take care’ of the matter using bribery, coercion, threats and intimidation. But public uproar, political opponents and multiple victims kept up the pressure.\nThe point where the case took a road less travelled by political elite is when Deve Gowda drew a red line, and in a long letter on X told Prajwal “to return immediately…and subject himself to the legal process. He should not test my patience.” Gowda’s sanction certainly played a part in ensuring no political interference in the probe. Investigation was by the book, no evidence was botched up, prosecution was on point. The swift trial and conviction simply go to show that minus political protection and privilege, and with police given a free hand, victims, especially of sexual assault, may get a stab at justice. Despite public outrage, it took Supreme Court’s intervention to file an FIR against Brij Bhushan. That case is cold. And the message is chilling.\n\n",
        "headline_1": "Shape of justice",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/shape-of-justice/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "Whether it be the political world of empires/powers (super/regional) or the world of Corporate dominance (Domestic / MNCs), the words soft power and hard power resonate with both these structures.    \nMost of the political empires have followed the route of hard power – capture the land, exploit the land for its minerals, push your culture/beliefs/language on the people you have defeated, a strong police force to keep them in control, and generally work to destroy the unique identity of those who are defeated.  Empires in the past, political powers in the last 150 – 200 years have largely followed this Rule Book.  \nIn the case of corporates (MNCs), it is the acquisition of businesses, sacking of acquired employees, ruthless cost cutting, pushing through of Corporate Reporting and Organization structures, and the establishment of a management structure whose members may be from other lands and not from the land being managed.\n  A uniform across the World Human Resource and Authorities Granting policy, which may conflict with the culture of that country, but which, for the sake of effective governance and business efficiency/uniformity, will be imposed.\nMost successful political powers and empires, and in recent times large MNC Corporates have used hard power to get their way, forgetting about soft power.  A superpower like the US, which for decades managed a combination of hard and soft power, is now mainly shifting in the direction of Hard Power.  \nFor several decades since the 1950s, the end of World War II and the start of a new World Order with countries coming out of colonial rule and emerging as independent nations, up to the 1960s, the soft power of the USA worked.  The best human resources of many nations made their way to the USA for education,a better quality of life, recognition of individual competence and merits, lower levels of corruption, etc.  \nThe American Universities, the Entertainment Industry (Hollywood), corporates on the cutting edge of technology (armaments manufacture, IT Industry), and the free political discourse that was possible were major soft power magnets that attracted people from other countries.  However, in this rush of people wanting to enter the country and political compromises for electoral gains, the undeserving and unwanted also came i,n and then there is the pushback.  \nPolitical pushback and the use of hard power will diminish the impact of soft power, and the USA will not be the magnet for competence that it once was. In India, we are aware that a large part of our best students from IITs, medical colleges,and  IT knowledgeable made their way to the USA for better education and a better life. \n We may now see the Hard Power overwhelming the soft power, and high-technology USA companies may find themselves short of competent and capable Human Resources to run and propel their industry, and maintain the technology and competence edge.\nIndia is an example of the other end of the spectrum.  Between nations, we have never attempted to use hard power. Over a thousand years, India has not attempted to capture the land of others, though we have lost land over the last 2 centuries – Burma, Pakistan, Bangladesh. \n Our behaviour has been one of Soft power efficacy – our temples are found in Southeast Asia, Thailand has a form of greeting very similar to our ‘Namaste’.  Indian films and Indian music have popularity across large parts of Asia.\nHard power has the advantage of maintaining discipline, having clear structures for actions to be taken, ‘red lines’ clearly stating what you should not cross, and generally making for easier and better governance.  Hard Power is more Intellect Related, Soft Power is more Emotion Related.  We hear conversations about where one would like to live as a preferred residence destination.  \nSimilarly, where it comes to employment with corporates or dealing with them on a Business-to-Business model, the employee or the supplier would always prefer the company with better soft power strength than a company with pure hard power strength (the main factor being Domination). \n Even at the cost of lower Pay, many employees prefer corporates where they are not made to work like donkeys carrying a load, where the corporate is willing to be flexible in work routines, where the employee has scope for Training, self-development, and skills upgradation.  The supplier would like guidance on product/service improvement.  They would want the corporate to work with them.\nIt is observed that in the long run, soft power will win over hard power when it comes to corporate existence.  This develops a culture of belonging.  A corporate driven only by hard power, demanding output and work performance with no time for employee or Client/customer / Supplier preferences, will start dropping in the Rankings stage.  Hard power to manage during difficult times is required, but there is a way to use it.  \nCorporate soft power is what allows employees to feel themselves as part of a Corporate Family and they will willingly highlight their perceptions of where matters are getting out of hand.  A dominant hard power corporate will never see the iceberg in front of them or the tsunami that is developing, needing the making of strategic changes to place themselves in an altered business environment.  In most cases, they are so blinded by past success that they refuse to alter the way they conduct business (no ability to read altered under surface currents).\nThe best way of determining corporate hard power is the way employees are treated.  Is the corporate constantly opening businesses (without a detailed study) and shutting businesses, moving away from geographies without a proper study?  Employees are asked to leave and consequently, the corporate is losing a valuable resource, which is corporate memory and operational skills.  \nThere is a lot of corporate history in the minds of employees who have worked for over 5 years.  When you lose them by asking for their separation, you lose a part of corporate existence and competence.\nLet us remember that Hard Power, whether political or business, requires huge financial funding.  Keeping extended matters ‘under control’ is costly.  Soft Power does not require financial funding to the same extent.  Empires and corporates have collapsed because the financing of Hard Power began to dry up.  \nStudy the History of countries and corporates.  Ambition and pushback/opposition to ambition have destroyed and collapsed Empires and Corporates.  Cash surplus corporates and countries become indebted, running up huge Debt due to the misuse of Hard power choices.  The USA is a classic example for countries.\nSoft Power without the Edge of Hard Power does not achieve much.  Hard Power by itself (with minimal soft power) can lead to collapse when not\nManaged effectively.  Many times, Hard power retreats, not the case with Soft power. Soft power stays and cannot be erased.\n\n",
        "headline_1": "Soft power and hard power-certain core issues!",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/spreading-light/soft-power-and-hard-power-certain-core-issues/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 02, 2025 00:00:00  \nAt a time when global trade tensions are running high and tariffs are being used as tools of economic pressure, Bangladesh's achievement in securing a lower duty from the United States is both remarkable and beneficial. The reduction of the reciprocal tariff to 20 per cent from the previously announced 37 per cent not only protects Bangladesh's key export sectors from sudden disruption but also strengthens its foothold in the American market. Secured after months of rigorous negotiations, this outcome positions the country favourably alongside other key competitors like Vietnam and Sri Lanka which also face the same 20 per cent rate, while larger economies like India and China will grapple with higher tariffs of 25 per cent or more. The result demonstrates both the diplomatic finesse and clear understanding of global trade dynamics by Bangladesh's negotiating team led by commerce adviser Sk Bashir Uddin. Chief adviser Prof Muhammad Yunus aptly described this as a \"landmark trade deal\" and a \"decisive diplomatic victory\" which preserves and advances the country's comparative advantage in an increasingly complex global trade environment. \nFrom an economic standpoint, the reduced tariff acts as an important protection for Bangladesh's export-driven growth model. In particular, the ready-made garment sector which forms the backbone of the country's exports and accounts for a significant share of its shipments to the US stands to take many positives. At the very least, this effectively restores Bangladesh's export position in the $8.0 billion US market to what it was before the tariffs. The Business and Tariff Management Association (BTMA) has also noted that this outcome levels the playing field, if not tilts it slightly in Bangladesh's favour, compared to many other exporting countries. While competitors like Cambodia and Pakistan negotiated a marginally lower 19 per cent tariff, Bangladesh's larger production capacity, well-established supply chains and economies of scale in the ready-made garment sector more than compensate for this slight difference.\nThe diplomatic success in securing a reduction of the US tariff notwithstanding, the outcome raises important questions about what Bangladesh may have had to offer in return. Media reports suggest the concession was partly achieved through commitments to purchase 25 Boeing aircraft and other American commodities such as wheat and cotton aimed at narrowing the trade imbalance. However, the wisdom of investing heavily in Boeing jets is questionable, especially given Biman Bangladesh Airlines' longstanding reputation for poor service and operational inefficiencies. The airline reportedly experiences an average 23 per cent vacancy rate on international routes. Rather than expanding a struggling civilian fleet, Bangladesh might have prioritised more strategic defence acquisitions such as advanced fighter jets for the Bangladesh Air Force, the aging fleet of which faces safety and operational risks. Notably, Vietnam has reportedly procured F-16s through similar trade negotiations, a move that shows how defence procurement can simultaneously help address trade deficits while enhancing sovereign capabilities.\nFurthermore, to make the most of this achievement and the opportunities from the lower tariff, the government must address the challenges facing other export-oriented industries that continue to hold back growth. For instance, the leather and footwear sector remains constrained by the absence of a fully functional Central Effluent Treatment Plant (CETP) in the Savar Tannery Industrial Complex. This sector has the potential to become a major source of foreign exchange, provided compliance and environmental concerns are resolved. Policymakers must undertake the necessary reforms to ensure Bangladesh does not miss the opportunity to diversify its export basket, thus paving the way for sustained economic growth in the years ahead.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A trade triumph for Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-trade-triumph-for-bangladesh-1754064089",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       August 02, 2025 00:00:00  \n\nFarmers in this country could not be more discriminated against. Growers of major crops appear to be only more so. This year potato farmers have produced a record high of 13 million tonnes of potato---4.0 million tonnes in excess of the country's demand. Only 70,000 tonnes have so far been exported. The price never picked up, although at the start of the new harvest even in the country's growing north, the price of potato was Tk 70-80 a kilo. From then on the price has steadily slumped. Now farmers are counting losses between Tk 10-12 a kilogram of potato because production costs varied between Tk14-17 and with the addition of cold storage rent, the total cost for preservation of a kilogram of potato comes to about Tk25. But at the moment, the going price at cold storage gate is Tk 12-13 a kilogram.\n\n\nThis has raised the ominous spectre of farmers' unwillingness to take release of a huge quantity of potato from cold storages. Taking out the stock from cold storages and then bearing the costs of transportation will further increase the margin of loss. Similar things happened years ago when potatoes were left to rot or used as cattle feed. Frustration of potato growers this year may surpass the extent of that time. Fearing the reaction from potato farmers, the Bangladesh Cold Storage Association (BCSA) has sent a letter to the ministry of commerce (MoC) urging it to fix at least Tk25 a kilogram at the cold storage gate. The association has, moreover, suggested an alternative way of pragmatic disposal of potato. With the rice given to 5.5 million vulnerable families in the country at Tk 15 a kilogram, 10 kilogram of potato can as well be given to those families at a subsidised rate.\nIts benefit will be manifold. First, the vulnerable people will get potatoes at a cheaper rate and will have their nutritious supplement all the same. Again, potato growers will at least be spared the outrageous losses they are now incurring. Apart from this immediate measure, the MoC should look for market abroad in order to export as much potato as possible. There are still three more months when this crop, a staple in some parts on this planet, will pass a lean season before the new harvest can be expected in November. If the opportunity can be exploited, the domestic potato glut can be overcome to a large extent. \nStrangely, government intervention is fast and furious if any such appeal comes from the corporate world or the monopolistic trading houses. For example the Bangladesh Rice Industries Association (BRIA), a group of top auto rice millers, sent a letter to the MoC pleading for rescinding the directive issued by the Directorate of National Consumers' Rights Protection (DNCRP) on the sale of rice under fictitious names---in fact given the name of 'miniket' and 'jeerashail'. This is a kind of ultra-polished rice made from BRRI Dhan 28 and 29. In fact, BRRI Dhan 29 has lower yield and it is mostly the BRRI Dhan 28 that is used for the purpose. In no time, the MoC obliged. But in case of the appeal to save potato farmers, no prompt action is visible even though the plight of these growers has long been highlighted by the media and agriculture experts. The apprehension is not misplaced that farmers will lose interest in cultivation of potato and next year, the price of the item may hit rooftop as it did last year. \nIn case of rice, the BRIA has used the intimidation tactics threatening not to purchase 5.0 million tonnes of paddy from farmers to be processed as the finer variety of rice. If it is not purchased, farmers will count losses as that amount of rice will rot in the process. Wonder of wonders, the BRIA has at no point made it clear that it does not polish BRRI Dhan 28 to give it the name 'miniket\". The DNCRP acted on an ethical and legal issue in order to prevent auto rice millers from resorting to the malpractice with the staple and abuse of the legal provision. By cutting it to size, the MoC has dealt a heavy blow to the institutional status such government agencies should have. \nThe problem here is the government attitude. If the earlier regime's constraints owed to graft and commission money, this government's week-kneed responses to issues of vital importance have mostly gone against the voiceless, farmers, workers and the marginalised finding themselves increasingly at the receiving end. Now the question is, will the farmers whose cause the BRIA has advanced as an excuse for allowing them to continue marketing 'miniket' and 'jeerashail' receive any benefit from the move? They are hardly likely to. The difference between the price of BRRI Dhan 28 and that of so-called 'miniket' or 'jeerashail' is no less than Tk20, if not more. \nHad there been a pro-farmer and pro-people government, it would never have given in to the irrational and illegal demand from the corporate world. A government has to be smart to outdo machinations of the business syndicates. If it procured enough paddy and rice and had built sufficient warehouses and cold storages for rice and potatoes, the excess production would not be a cause for concern but an asset for the national economy.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "In the absence of a pro-farmer policy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/in-the-absence-of-a-pro-farmer-policy-1754064187",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       August 02, 2025 00:00:00  \n\nAs the anniversary of the July mass uprising continues, it is also time to examine the achievements and disappointment of this historical event critically. The task is challenging and also problematic due to the complex nature of the mass uprising and subsequent developments in the country over the past year. There is no doubt that the most visible and successful achievement of the student-led movement is the downfall of the authoritarian regime of Sheikh Hasina on August 5 last year. It was the day when Bangladesh re-emerged as a country boldly asserting its sovereignty and independence. The sovereign status of the country was systematically undermined during the authoritarian regime. \nNevertheless, the fall of the brutal regime is not the end of the story, as the mass uprising has widened the expectations of the people. The downfall of Hasina is also a point of a new beginning to rebuild the country in a balanced and sustainable way, thereby curbing socio-economic disparity. It opens the door to restoring the freedom of speech and reversing the course of hate and intolerance. The bloody and forceful departure of the tyrant also presents an opportunity to reshape democratic institutions for the greater interests of the nation. All these are big tasks and not possible to complete within a short period. Instead the same will require persistent efforts.\nImmediately after Hasian's ouster and escape to seek refuge in India, the nation dipped into a chaotic disorder for the time being. With the killing of at least 1,400 people and injury to several thousand others by the tyrant's forces and goons in 36 days of the mass uprising, some amount of disorder was not unexpected. It is also true that some undesirable things happened at that time, undermining the spirit of the mass uprising. \nIt is also well known that a large number of people were intimidated over the 15 years of the tyrant by law-enforcing agencies, along with leaders and activists of the ruling party, Bangladesh Awami League (BAL), to be exact, for differences in their political positions. Many of the tortured did not waste the opportunity to take revenge. Therefore, several BAL leaders and activities came under attack. Top leaders of the party, however, escaped, and many fled to India. They are now staying there thanks to the generosity of the Modi-led Indian government in return for serving the Indian interests for more than a decade. \nSome expected that things would be normalised automatically or that there would be little chaos. It was a misconceived notion, as the country's political transition did not occur through normal democratic means. More than a month-long movement, that witnessed venting of a decade-long legitimate anger and disappointment, led to the bloody mass uprising and compelled the tyrannical regime to fall. \nThen the Yunus-led interim government took charge shouldering two immediate tasks: restoring law and order and fixing economic mismanagement. Despite several efforts, law and order are still a matter of grave concern in the country. Economic management has, however, improved modestly, and more progress is expected. It is, however, disappointing that some critical areas like education, health and transport are still carrying the legacy of the tyrant regime due to lack of effective intervention from the interim government. Instead of taking proper measures do some urgent rectifications, the over-ambitious move of comprehensive reforms will take time. The country is yet to regain normalcy by adjusting with the changeover. \nSo, the ultimate success of the July uprising will depend on addressing the socio-economic disparity in an effective and sustainable manner and also on the smooth transition to a democratic process. The road is long with a number of barriers and there is no easy or short-cut to move ahead. It is thus necessary to continue the fight. \nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Unfinished tasks of July uprising",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/unfinished-tasks-of-july-uprising-1754064240",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 02, 2025 00:00:00  \n\nIn today's fast-paced digital world, leadership is not just about years of experience anymore. It is about data. The old gut-feeling way of deciding things is slowly fading. With management information systems, leaders can now see what is going on: real-time numbers, clear trends, and fewer surprises.\nMIS helps track performance, shows how customers act, and keeps operations in check. Decisions feel less like guesses and more like steps forward. MIS makes a real difference in healthcare, finance, and logistics, leading to better use of resources, better service, and better results.\nHowever, it is not just about having the tools but about thinking differently. Leaders need to read the data, understand what it means, and mix it with real-world judgment. MIS will not replace leadership. It makes it stronger, sharper, and ready for what is next.\nSafwaanul Haque\nStudent\nBachelor of Business Administration\nNorth South University\nsafwaanul.haque@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "MIS and the new age of leadership",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mis-and-the-new-age-of-leadership-1754064260",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-08-2025"
    }
]