[
    {
        "full_article": "What United States President Donald Trumpdid to global trade on April 2, 2025 in Washington closely mirrors a disruptive precedent set by President Richard Nixon in 1971. On August 15, Nixon stunned the world by announcing the “temporary suspension” of the U.S. dollar’s convertibility into gold. This effectively dismantled the Bretton Woods framework that was worked out quite unilaterally in 1944, which led to the setting up of the World Bank and the International Monetary Fund, and provided an anchor for global currency stability — an avenue to address balance of payments crises, and to finance the reconstruction efforts of former colonial powers. Though announced as a temporary move, it became permanent and upended the global financial system, as nations reckoned with a new era of financial market volatility. Similarly, Mr. Trump’s reciprocal tariffs have instantly ushered in global economic uncertainty, the full extent of which will be felt in the months and the years ahead. By unilaterally altering trade relationships, he has disrupted the very system of interconnected global commerce that the U.S. helped build in the post-war era.The international reaction has been one of shock and concern. The U.S. is the world’s largest importer of manufactured goods, accounting for about 13% of global imports in 2023. The new tariffs will reroute supply chains and force countries to diversify their export strategies. In the immediate term, the cost of imports will rise for American consumers, leading to reduced demand. The ripple effects will be global, causing production slowdowns as exporters scramble to find alternative markets. Economies such as China, Japan, India and the European Union are likely to experience a temporary decline in economic growth. Yet, unlike in the Nixon era, the U.S. today holds a diminished position in global trade. In the 1970s, it was the world’s dominant trader, with an estimated 13%-15% share of global trade. China’s presence was negligible at the time, accounting for less than 1%. Today, China commands the largest share of global trade, at around 14%, while the U.S. has slipped to roughly 10%. The international community also accepted the dollar’s supremacy in the 1970s because of America’s overwhelming economic and technological dominance. Now, although the dollar remains the preferred reserve currency, the centre of economic gravity has shifted. The world’s leading exporters of advanced technologies are now China and other Asian powers, including South Korea, Japan, and Taiwan. Thus, Mr. Trump’s turn to protectionism — an attempt to regain American economic dominance — may well hasten the country’s retreat from its hegemonic position. Published - April 05, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        currency values\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        Taiwan",
        "headline_1": "American retreat: On Trump’s turn to protectionism",
        "headline_2": "The U.S. risks ceding its position as a global economic powerhouse",
        "link": "https://www.thehindu.com/opinion/editorial/american-retreat-on-trumps-turn-to-protectionism/article69413177.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "The issue of defections in Legislative Assemblies has become a vexed one in public life in recent years. Ruling parties — the Bharatiya Janata Party in particular — have adopted an unabashed approach to augment their legislative support by encouraging defections. A commonly used modus operandi — used egregiously in Manipur in the late 2010s and later in Maharashtra — involves the Speaker, invariably from the ruling party, sitting on disqualification petitions from Opposition parties against legislators who have defected. Some defectors have even been sworn in as Ministers, pending adjudication on their party-switching by the Speaker. Many States have seen the unedifying sight of mass defections to the ruling party just after elections, making a mockery of the democratic exercise. The latest is the situation in Telangana where the petitions filed by the Bharat Rashtra Samiti (BRS) in March-April 2024, to disqualify 10 of its legislators who defected to the Congress, were notified by the Speaker only in January this year. The Supreme Court, hearing a petition by the BRS seeking timely action by the Speaker, has rightly observed that it was not “powerless” if a Speaker chose to remain indecisive. Justice B.R. Gavai’s observation that the courts cannot tell a Speaker how to decide, but that they could ask the Speaker to decide within a reasonable period, is a rational one.A five-judge Constitution Bench, in May 2023, had reposed its faith in the Speaker’s “propriety and impartiality” to decide on defections, but “within a reasonable period”. Flowing from this judgment, the Court had, in October 2023, fixed a deadline for the Maharashtra Speaker to decide defection pleas from the Opposition after the undue delay by him in hearing them. Yet, the issue is persistent. This is inevitable as Speakers are invariably elected from ruling parties and rarely act in a non-partisan manner, despite the expectation that they will do so. In 2020, the Court had asked Parliament to amend the Constitution to strip Legislative Assembly Speakers of their exclusive power to decide upon whether legislators should be disqualified or not under the Tenth Schedule which frames the anti-defection law. It had also asked for an independent tribunal, instead of the Speaker, to be appointed for the task. No such action has been taken by Parliament since then and the problem of defections going unaddressed by Speakers within a reasonable time frame persists. If the Court forces the hand of the Speaker in Telangana, it might be one more blow for decisive action. But the scourge of defections and how it is dealt with will remain as long as voters do not punish those who indulge in such practices. Published - April 05, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Manipur\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Bharat Rashtra Samithi\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        parliament\n                    \n                            /                      \n                        \n                        Telangana",
        "headline_1": "​Taken to task: On the Supreme Court and defections",
        "headline_2": "The Supreme Court is right in pushing Speakers to act decisively on defections",
        "link": "https://www.thehindu.com/opinion/editorial/taken-to-task-on-the-supreme-court-and-defections/article69413196.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "Low-cost labour is India’s best weapon in trade war\nTrump fired the first shot, and now the battle is joined. China on Friday imposed an additional 34% tariff on US goods – matching Trump’s impost from Wednesday. The effective rates, taking into account tit-for-tat tariffs from Feb and March, are much higher. It looks like the world’s biggest buyer and biggest seller – together accounting for over 40% of global GDP – are unwilling to do business with each other. Which is not a good omen for the rest – India included – who are links in the global supply chain turning around these two cogs.\nIndia, which got off relatively lightly with a 26% Trump tariff on Wednesday, was looking at $8-10bn in lost export earnings over six months. But China’s strong retaliation has increased uncertainty to a different level. Right now, investors are in panic. On Tuesday, investment bank Goldman Sachs had raised the probability of a US recession to 35%. By Friday, its bigger rival JP Morgan Chase was predicting a 60% chance of a global recession this year.\nFor India, a global recession – if it occurs – couldn’t strike at a worse time. The last one in 2008-09 came after five years of strong growth. This time, we are in the midst of a slowdown. So, govt must act fast. Trump wants a counterweight to China. AI and semiconductors aren’t our forte, but we have abundant cheap labour. However, our industrial estates are tiny compared with the competition. To become a manufacturing hub, we need to offer scale across the country, not just in a handful of industrialised states. While trade with US has grown steadily, we now need to diversify. That means striking deals with other nations and blocs. China, despite all reservations, is a manufacturing superpower, and the recent thaw in relations should be nurtured by India.\n\n",
        "headline_1": "The factory factor",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-factory-factor/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "Anti-Waqf bill demos campaign fodder for oppn & BJP \nAs Waqf amendments were challenged in Supreme Court on Friday, ongoing protests raised the heat on the bill in several cities. Every party will find masala for a new campaign in multi-city demonstrations. Mayawati, for one, is hoping to re-tap into Muslim votes that were once hers but have since moved to Akhilesh’s SP. Why, one might wonder, did megastar neta Vijay in Tamil Nadu, join forces with “Muslim brothers” in massive demos in Chennai and Coimbatore? Answer: Tamil Nadu may have just a 5% Muslim population, but it has the fourth largest number of Waqf properties, and its assembly polls are just a year away. Assam (34%), Bengal (27%), Kerala (26%) all hold elections next year and have the largest Muslim electorates. UP (20% Muslim population) votes in 2027. What better way to re-assert “pro-democracy” credentials than fight the Waqf battle? It is the fight on the streets that promises electoral dividends.\nWith Bihar polls by Nov, these protests will likely continue right through – regional opposition MGB (RJD-Cong-Left) may even find a solid raison d’être. Bihar’s 17% Muslim population can decide winners on at least 70 of Bihar’s 243 seats. Protests help BJP too. On earlier occasions, it has managed to consolidate an anti-Muslim vote, riding out such protests. But there are rumblings within key ally JDU – seniors are reportedly threatening to quit. Not just RJD-Cong, Prashant Kishor’s Jan Suraaj too is waiting. Games have begun.\n\n",
        "headline_1": "Politics & protests",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/politics-protests/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "Likes and dislikes are shaped by the culture you live in\nJackfruit has an honourable place in Indian cuisine, but to Babur it was “unbelievably ugly and bad tasting. It looks exactly like sheep intestines turned inside out,” he wrote in his diary. English travellers in the Mughal era didn’t take to Indian music. They found it grating, screeching. While there’s no accounting for taste, the book The Geography of Taste by Dominic McIver Lopes, Samantha Matherne, Mohan Matthen and Bence Nanay makes a bid to explain why. \nTake Elephanta, for example. The sculpture – Maheshmurti Shiva especially – is awesome. But Captain William Symson, who saw it in the early 1700s, recorded “abundance of monstrous figurines, representing the several gods of those gentiles…” What explains this perceptual dissonance? In the book, University of Toronto professor Matthen says European Christians of that age, who had no experience of Hindu iconography, drew “wildly mistaken conclusions” about Indian art. Once they interpreted “multi-limbed” deities as “monsters”, there was no room left for the nobler feelings an Indian visitor would have felt looking at the self-same figures.  \nWould a crash course about Indian deities and art have altered Symson’s experience of Elephanta? Not significantly, because we enjoy and appreciate art “through a complex emotional response”. So, Symson would still be an “outsider”. Although armed with knowledge, he would be lacking in faith, and so the art – frozen in stone – wouldn’t touch him the way it would a ‘native’. “In place of these indigenous reactions, the travellers substituted their visceral aversion to polytheism and the naturalistic depictions of superhuman deities,” says Matthen.\nFood ought to be a less layered experience, but isn’t. The smell of cheese, unless familiarised in childhood, can be hard to relish. Rasmalai is inoffensive, but as Matthen says, a Westerner who has never tasted it before might like it only as “an agreeable confection”. An aficionado, on the other hand, will compare it with past servings and score it for “the balance of flavourings (like saffron and cardamom) that create it”. \nSo, art of any kind – dress, sculpture, music, food, etc – is most attractive when “it is engaged with in a particular manner”. And your having a “taste” for something greatly depends on attaining that “manner”. There are other determinants of taste, of course. First among these is your innate nature. If you don’t like heavy metal, no amount of listening to it will make you a fan. Next comes community. Europeans wear black to funerals, “for no reason other than that they believe that members of their community think that this is appropriate,” says Matthen. That’s why attending a funeral in a batik dress would be considered “distasteful”. And then there are differences of geography that the prejudices of ancient travellers and conquerors like Babur illustrate.\nBut should we avoid things just because we don’t have a “taste” for them? Matherne, professor of philosophy at Harvard University, makes a case for being aesthetically open-minded even if it “does not result in aesthetic experiences of enjoyment”. You may not “get” Elephanta, opera, the Maori haka dance, etc, but the sense of wonder such experiences raise opens us to “aesthetic value that outstrips our personal and local horizons”.\n\n",
        "headline_1": "Cheese to Taylor Swift, it’s an acquired taste",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/cheese-to-taylor-swift-its-an-acquired-taste/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "By Narayani Ganesh\nA lot is discussed and debated about death and dying, and how most of us are so fearful of the end. Will it be painful? Will the end be sudden and peaceful or violent? Will I linger on, ailing in hospital, with life support? Would I have completed my duties and responsibilities? What happens to my near and dear ones once I leave for good? This fear has spawned an entire industry that peddles anti-ageing and longevity products and practices, some that cost nothing and others that are brutally expensive. So what gives? Does prolonging life with lifestyle changes mean that we no longer live in fear?\nIn reality, most of us are as fearful of living as we are of death. What if I live long years, turning feeble and disabled, and what if I become completely depen dent on others for my sustenance and daily tasks? What if I live long but the quality of my life is simply the pits? This kind of phobia for living, is called apeirophobia, “characterised by an intense fear of existence, often linked to existential dread about eternal life… connected to anxiety disorders.”\nWhen you agonise over the meaning and purpose of life and the nature of reality, you are in existential angst. Living a long life does not hold any charm, for you live in constant fear of life. You die a thousand deaths every day. Those who live in fear of death, their phobia is called thanatophobia – you may suffer panic attacks, wondering how and when you may die, what could happen after you die, what lies beyond death and so on.\nIn both phobias, the underlying dominant factor is the constant anxiety over the uncertainty of both prolonged living and the mystery or uncertainty of what happens after death. Both life and death may involve pain and suffering – less for some, more for others.\nMany today are obsessed with longevity; to prolong one’s lifespan.\nExperts say it would be more practical to aim for good health rather than long life that may entail reduced mobility, and more illness. Those with apeirophobia wonder if they will become a burden on their children.\nThere are instances in Hindu legend, of people either doing tapas, penance, to obtain the boon of immortality or of those who are described as chiranjivis, the immortals, who remain alive till the end of Kali Yuga. The eight immortals are Hanuman, Ashwathama, Parashurama, Mahabali, Vyasa, Vibhishana, Kripa and Markandeya.\nIn Greek mythology, Goddess Selena, who fell in love at first sight with Endymion, a beautiful shepherd, asked Zeus to grant him the boon of immortality. Zeus granted her wish but let Endymion remain sleeping, beautiful as ever, with a smile on his lips. Mahavatar Babaji, the Kriya Yoga guru, is said to be alive for the past 5,000 years. Physical sightings of Babaji have been reported over the years, by seekers who meditate in the Himalayas.\nA shloka chanted with all eight names of the Chiranjivis, is believed to bestow one with long life, free of sickness, to live to a hundred years at least. The search for the elixir of life has been ongoing for thousands of years. But, to be immortal is a gift or curse? The jury is still out on that score.\nganeshnarayani@yahoo.com\n\n",
        "headline_1": "Death and immortality, both evoke fear",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/death-and-immortality-both-evoke-fear/",
        "news_paper_name": "The Times of India",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Imperative for WFP to tide over funding crisis",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/imperative-for-wfp-to-tide-over-funding-crisis-1743768068",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "Vehicles move on a road amid thick smog in Dhaka on December 11, 2024. The capital city's air quality has worsened beyond recuperation  —Agency Photo ",
        "headline_1": "How Dhaka lost its clean air",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-dhaka-lost-its-clean-air-1743768148",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Politics does not spare even a tomb",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/politics-does-not-spare-even-a-tomb-1743768195",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Mugging: a terrifying reality of society",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mugging-a-terrifying-reality-of-society-1743768214",
        "news_paper_name": "The Financial Express",
        "publish_date": "05-04-2025"
    }
]