[
    {
        "full_article": "The disastrous performance of the Mahagatbandhan, led by the Rashtriya Janata Dal (RJD), in the Bihar Assembly elections, has been followed by claims attributing this to a purported collusion between the Bharatiya Janata Party (BJP) and the Election Commission of India (ECI). The RJD won 25 seats, the Congress six, the CPI (Marxist-Leninist) (Liberation) two, and the CPI (Marxist) just one. Allegations of vote theft revolve around pre-existing concerns about the ECI’s perceived bias towards the BJP, and around the more contestable claim of manipulating electoral rolls during the Special Intensive Revision (SIR). The exercise raised concerns that it was moving the responsibility of proving one’s eligibility to vote to the people instead of strengthening the state and the ECI to continue upholding it. Concerns of this nature are relevant, including for the ongoing second phase of SIR. But prevailing explanations of the National Democratic Alliance’s win are also not incredible, converging on high women’s turnout, focused welfare and cash transfers, a recalibrated coalition of OBC and EBC groups, and organisational capacity. In fact, the ECI’s decision to not restrain the Nitish Kumar government from transferring cash to beneficiaries of a State women’s scheme, by accepting it as “ongoing”, contradicts a bar the ECI set during the 2023 Rajasthan Assembly polls for Ashok Gehlot’s Congress government. Thus, the allegations against the ECI are partly due to its concerning conduct.However, there is no verifiable evidence that the pattern of deletions by SIR across booths aligns with the voting preferences of one coalition’s supporters. There is also no method to match each deleted entry with a credible, pre-existing record of partisan preference. In the constituencies that the Mahagatbandhan covered in its ‘Voter Adhikar Yatra’, which framed deletions as part of a concerted attempt to dispossess specific groups of their franchise, it performed as poorly as in the rest of Bihar. This failure may be because the Mahagatbandhan neither consolidated public sentiment following the Yatra nor linked livelihood issues with the SIR’s inclusivity. It also lacked credible answers to the NDA campaign that electing Tejashwi Yadav as Chief Minister would lead to ‘jungle raj’, a reference to the RJD’s previous terms. The election was also fought on the question of who should be Chief Minister — Mr. Kumar or Mr. Yadav — and the polarisation on this question evidently favoured the former. Opposition parties, particularly the Congress, should assess their failures in Bihar in a way that does not undermine an already fragile public confidence in the ECI. Blaming the ECI to avoid introspection can be self-defeating for the Congress, to the extent that more of that is possible. Published - November 18, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Communist Party of India -Marxist\n                    \n                            /                      \n                        \n                        Communist Party of India-Marxist Leninist Liberation\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        National Democratic Alliance\n                    \n                            /                      \n                        \n                        Rajasthan Assembly Elections 2023\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "Tunnel vision: On the Bihar election result and the Congress’s stance",
        "headline_2": "The Congress seems to be blaming the ECI to avoid introspection",
        "link": "https://www.thehindu.com/opinion/editorial/tunnel-vision-on-the-bihar-election-result-the-congresss-stance/article70290868.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "The 27th amendment to Pakistan’s Constitution, passed on November 13, formalises what has long been an open secret — that the military establishment pulls the strings behind a facade of democracy. Gen. Asim Munir, the army chief, has been steadily consolidating power, and the Shehbaz Sharif coalition government operates with his blessings. In May, after a brief conflict with India, the government elevated Gen. Munir to the rank of Field Marshal — the second five-star General after Ayub Khan. The amendment goes further, restructuring the military command and the judiciary. It rewrites Article 243 of Pakistan’s Constitution, introducing a post — Chief of Defence Forces, who will exercise authority over the Army, Navy and Air Force; the army chief will also serve as the Chief of Defence Forces. It also creates the post of Commander of the National Strategic Command, to oversee nuclear and strategic assets. The commander will be appointed by the Prime Minister on the Army chief’s recommendation. Most strikingly, the amendment offers life-long immunity from criminal proceedings to any officer elevated to a five-star rank — currently, Gen. Munir — as well as the President. Five-star officers will remain in uniform for life and can be removed only through an impeachment-like process under Article 47.In effect, Gen. Munir will be the new centralised power centre in the establishment. The amendment also strips the Supreme Court of its authority to interpret the Constitution, establishing a new constitutional court whose judges will be appointed by the government. Several senior judges have resigned in protest. Democracy has hardly been Pakistan’s strong point. Yet, civil society and segments of the political class have, at critical moments, resisted powerful generals, reclaiming limited democratic space. Today, however, the ruling elite seem more willing than ever to play second fiddle to the generals. The only mainstream politician challenging Gen. Munir is Imran Khan, in prison for more than two years. With a weakened government and an opposition leadership behind bars, Gen. Munir is expanding his authority with the full comfort of constitutional protection. But the story of the rise of Pakistan’s military strongmen typically ends with their eventual downfall. His power grab comes at a time when the country is fighting an insurgency in the tribal areas. Relations with India and Afghanistan are at a low. Imran Khan’s PTI continues to challenge the ‘hybrid’ civil-military rule from the streets. And the economy is in chronic distress. Gen. Munir’s response to these challenges was to stage an indirect coup using supine politicians. It could backfire sooner rather than later. Published - November 18, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Pakistan\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025",
        "headline_1": "Power grab: On Pakistan’s General Asim Munir",
        "headline_2": "General Munir’s indirect coup in Pakistan could backfire on him",
        "link": "https://www.thehindu.com/opinion/editorial/power-grab-on-pakistans-general-asim-munir/article70290895.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "Help’s on the line but it’s unhelpful\n‘Emails have been hacked all over the world. You need to change your passwords asap!’ read the lad’s frantic message on WhatsApp. I had just about managed to memorise the password for my email after almost half a dozen years, so I told him that. ‘Now tell me the passwords for all your social media accounts – Facebook, LinkedIn, Instagram…’ Whaaaat?? They all have passwords too?\nI haven’t a clue as to what they are and now I’m expected to change them, that too when I wasn’t the one who had set them up in the first place. Sensing my utter helplessness the lad offered to do it online from his location. ‘I’ll keep you on call and you follow the steps.’ How is that ever going to work? The only steps I can follow are from the cooking channel on YouTube.\n‘You have to learn sometime. Better now than later,’ he muttered and said he’d call that evening to help me change my passwords. Boy, I sure as hell wasn’t looking forward to that call. He also gave me some homework. I had to try and remember where I had saved all these passwords. I didn’t know where to start, but he told me to try birthdays, anniversary dates for a start, the important days in my life.\nBirthdays and anniversaries are too predictable. I’m sure I wouldn’t be so foolish. Or would I? I took a deep breath and messaged the lass, asking if she knew any of my passwords. Her reply was instant. ‘Why? What happened? What have you done? Has your account been hacked?’ I was most offended. Why do the children always think I may have done something? Granted, I may have pressed wrong buttons on my laptop on occasions and inadvertently deleted some important mails, but not on purpose. Never ever on purpose.\nWhat were the important places and dates in my life? Should I try holidays? I love Sundays and I love books but the wretched password always has to be one uppercase, one lowercase, some numbers. In between all these permutations and combinations, the phone rang. Completely forgetting that I wasn’t supposed to pick up unlisted numbers I answered it.\nThe voice on the other end was brusque, ‘I have the passwords to all your social media handles including your email ID. You need to listen to me carefully.’ I could have hugged him. ‘Really? You have all my passwords? Wonderful! Hang on, let me get paper and pen and I’ll note them down.’ Click. He had hung up. I tried calling him back but he didn’t answer. I tried one more time. No response. I wonder why. Silly man.\n\n",
        "headline_1": "Password pickle",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/password-pickle/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "Judgment on Hasina is legally dodgy. And Dhaka is now a major security concern for New Delhi\nShe may not appreciate the irony – the court Sheikh Hasina set up in 2010 sentenced her yesterday to death, judges falling in step with the current Dhaka regime. Bangladesh’s International Crimes Tribunal (ICT) was instituted to try Pakistani war criminals and their Bengali collaborators for the genocide carried out during Bangladesh’s 1971 liberation struggle. Trying war criminals was a big demand of Bangladeshi civil society that sought justice for the 3 million killed and 250,000 women raped during 1971. The Hasina govt had responded to this, set up the ICT, and sentenced several Jamaat war criminals to death.  \nTherefore, to try Hasina for the loss of lives during the student-led protest in Bangladesh last year through ICT is legally questionable. The trial appears to be an exercise in revenge. Those who prosecuted Hasina clearly have an axe to grind. They are also going after secular intellectuals like Shariar Kabir, who remains incommunicado in detention. Also, Hasina and her then home minister have been charged with superior command responsibility and the deaths of 12 student protesters. But the main witness in the case is Bangladesh’s former inspector general of police who is in custody and became state approver. \nThere is, therefore, much doubt about the whole legal process carried out under the watch of anti-Hasina forces. Dhaka has said it will again seek Hasina’s extradition from New Delhi. But the possibility of that happening appears remote. Not only is Hasina not guaranteed a fair trial in Bangladesh, forces dangerously hostile to India, secular Bangladeshis and Bangladeshi Hindus have gained ground in that country. Add to this, threats issued by elements of the interim Bangladeshi regime against security of India’s Northeast, and growing collaboration between Bangladeshi and Pakistani security agencies. There is a serious threat of ISI-backed anti-India groups reconstituting in Bangladesh – something Hasina had prevented.     \nPlus, Hasina’s party, Awami League, has been suspended by the current Dhaka dispensation. That means Bangladeshi elections slated for next Feb won’t be representative. Mujibur Rahman’s secular Bangladesh looks perilously close to sliding into Islamic fundamentalism, and Hasina is the obvious target. Unsurprisingly, the current Dhaka regime is indifferent to India’s security concerns. It’s prepared to take economic hits just so that it can be nasty to New Delhi. All of this makes Bangladesh India’s dangerous eastern flank. Pakistan is already a constant security threat and the addition of Bangladesh makes the job of security agencies all that tougher. \n\n",
        "headline_1": "Revenge Trial",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/revenge-trial/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "All studies show vehicle emissions are strongly tied to mileage, not age. When will law take note?\nNowhere in the democratic world, barring India, are owners forced to scrap old vehicles. Berlin or London, you can drive your car as long as it passes regular fitness tests, which are strict. But in Delhi, your petrol vehicle is legally dead the day it turns 15 – diesels die at age 10. This is the state trying to protect citizens from themselves – from the emissions of their vehicles. Well-intentioned, but without scientific basis.\nNow a Delhi Technological University (DTU) study questions the assumed correlation between vehicle age and emissions. It says mileage – kilometres run – affects emissions more: “Mileage is equally important and, in many cases, more reflective of how a vehicle behaves on the road.” Why? Because ignition systems, catalytic converters and combustion efficiency degrade with use.\nGlobal energy and infra consultancy Ricardo had earlier shown that even Euro 3 cars, made during 2000-04, had good emissions till a mileage of 100,000km. This year, Polish researchers showed emissions from cars driven 86,000-160,000km were significantly higher than those for low-mileage cars. The takeaway from all rigorous research is that mileage matters more than age.\nGiven that Delhi govt has challenged the vehicle age-based scrappage policy in SC, these points deserve attention. Indiscriminate – without regard to actual condition – scrapping of vehicles has a huge environmental cost, because making new cars consumes materials and energy. You may recycle the steel and aluminium, but the plastics – dashboards, door panels, etc – can only be ‘downcycled’. The electronics – old chips, music systems, etc – are sheer waste, and so are the tyres, batteries, engine fluids.\nAbove all, mandatory scrapping is an impost on owners. What the state didn’t give, it mustn’t take away without a compelling reason, which, judging by the evidence, doesn’t exist. \n\n",
        "headline_1": "Smoking Gun",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/smoking-gun/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "By Farida Khanam\nDelhi faced a heartbreaking tragedy when a car explosion near the Red Fort metro station claimed several innocent lives and left many others injured.\nThose who misuse religion for political or personal gain act in complete opposition to the true spirit of Islam, a faith rooted in peace, compassion, and coexistence.\nEvery act of terror, every explosion, tears at the moral and spiritual fabric that holds communities together. It sets neighbour against neighbour, faith against faith, and citizen against citizen.\n\nIslam stands for peace in word and essence. The Quran affirms this through God’s own attributes, one of which is As-Salam, meaning Peace. This divine attribute makes it clear that God is the source and embodiment of peace and security. Those who follow His guidance are therefore expected to become instruments of peace, ensuring that people feel safe, not threatened, in their presence.\nIn Islam, there is no place for those who disrupt the peace of society. History provides a powerful example from the time of the Prophet Muhammad. After the Treaty of Hudaybiyyah – an agreement that brought stability between the Muslims and their opponents – a Muslim committed an act that could have reignited conflict. The Prophet refused to support him or allow him refuge in Medina, stating that such a person was a kindler of war, and the Prophet wished that someone should restrain him from doing that, Musnad Ahmad, Hadith No. 18928.\nAnother vital point is that every family should examine the atmosphere in their home. A home should be a cradle of peace, not a nursery for bitterness and negativity. When parents speak the language of hate, their words take root in young, impressionable minds, shaping children into resentful and distrustful adults. In such conditions, the danger of radicalisation grows significantly. The fault, then, lies not with the misled young but with homes that failed to nurture a positive environment. Peace in the world can only begin with peace at home.\nMaulana Wahiduddin said that when you choose peace, you chooseGod’s path. When you choose violence, you walk awayfrom Him. His words are a reminder that divine approval is earned not through hatred and revenge, but through restraint, forgiveness, and compassion. Peace is not simply the absence of conflict; it is a deliberate pursuit of understanding and wellwishing for fellow human beings.\nRevenge may seem to strike outward, but its deepest wound is always within the avenger. It corrodes the mind, turning it into a factory of bitterness and resentment. Consumed by vengeance, a person loses the ability to act constructively and, in the end, destroys themselves.\nEnduring peace and progress – whether in Kashmir or anywhere else – can never arise from confrontation. They can flourish only when people choose understanding over anger, cooperation over hostility, and peace over revenge. In doing so, they not only elevate their community but also reflect the true essence of Islam – the faith of peace and compassion.\nThe Red Fort blast is a stark reminder of how fragile peace becomes when hatred takes root. Yet this wound need not harden into a permanent scar. If we face tragedy with wisdom and resilience, peace can once again become our shared destiny.\nThe writer is chairperson, Centre for Peace and Spirituality International\n\n",
        "headline_1": "A tragic day in Delhi and call for peace",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/a-tragic-day-in-delhi-and-call-for-peace/",
        "news_paper_name": "The Times of India",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 18, 2025 00:00:00  \nThe multiple indicator cluster survey (MICS) carried out by the Bangladesh Bureau of statistics (BBS) has presented an alarming picture of child labour and various negative aspects related to it. As high as 9.2 per cent children in the age bracket of 5-17 are compelled to perform tasks requiring physical labour. This is an increase of 2.4 percentage points in child labour from 2019's 6.8 per cent. The worsening child labour picture -- including their exposure to hazardous works -- in the country over the past six years should sound the alarm bell ringing. Rise in child labour is no isolated spectre because its correlation with other development indicators is strong. Child health, education, water and sanitation and several other human development indicators are closely tied to this issue. Child labour here is a consequence of deterioration of all such human development indicators. \nIn plain terms, increase in child labour means more families have become poorer and more vulnerable to the extent where school dropouts have risen in number, malnutrition has worsened, child marriage gone up and population growth gaining further to negate achievements on the economic and development fronts. While the country failed to arrest inflation and misdirected social safety network programme fell short of the intended objective, donors' assistance also dropped significantly. The combined impact imperilled the lives and livelihoods of the poor and marginal segments of society. Unemployment and drop in purchasing power pushed more people below the poverty line as corroborated by several other studies. That is an indication of the yawning social divide with a select group called oligarchs making the most of the archaic management of national wealth. The result is wasting of children on account of severe malnutrition. \nImmediately after the pandemic, shrinkage of funds from donors and inadequate mobilisation of domestic funds were responsible for many of the programmes for the poor including those for the Rohingya. But one of the less noticed one is the family planning programme. Family planning services at the level of vulnerable population had to be curtailed leading to undesirable pregnancies and their attendant ills such as a lack of care for mothers and the newborn. Increased wasting from 9.8 per cent in 2019 to 12.9 per cent is indeed a cause for serious concern. A combination of all these factors has given rise to a vicious cycle of higher birth rate among the poor, malnutrition and wasting or stunted growth, illiteracy or early dropouts and unemployment or low-paid wage.\nThese problems have been further exacerb ated by exposure to lead, a harmful metal. In fact, both children and adults fall victim to exposure to metals like lead, chromium and cadmium---in urban setting through air pollution and in rural areas through soil and water contamination. However, children irrespective of their social standing are more vulnerable to these metals. When underage children have to work in lathe factories, they suffer the worst. Child labour is, therefore, linked to factors that contribute to development parameters. After 54 years of independence, the existence of this kind of outrageous disparity in society is undesirable. It also poses a threat to social integration, economic prosperity and inclusive development.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Child labour and development parameter",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/child-labour-and-development-parameter-1763390175",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       November 18, 2025 00:00:00  \nBangladesh, one of the world's most climate-exposed nations, has recently got a sobering reminder how vulnerable its own governance systems remains in the face of an unfolding planetary emergency. The latest findings of the Transparency International Bangladesh (TIB) reveal that more than half of the Bangladesh Climate Change Trust (BCCT) Fund-set up specifically to help communities withstand the rising seas, intensifying cyclones and creeping salinity-has been lost to corruption, political favouritism and sheer administrative decay. \nIt is a scandal of extraordinary scale, and one that risks undermining both domestic resilience and international confidence at a time when Bangladesh can least afford it.\nBetween 2010 and 2024, the BCCT approved 891 projects with a combined allocation of USD 458.5 million, or roughly Tk 38.96 billion. TIB's investigation found that irregularities consumed USD 248.4 million-Tk 21.10 billion-during the same period. The culprits form a depressingly familiar cast: politically connected power brokers, members of the fund's own governing board and sections of implementing agencies tasked with delivering projects to some of the poorest and most climate-exposed communities on Earth.\nThe timing of this disclosure could hardly be worse. In Brazil, climate activists and negotiators are pressing wealthy nations to increase funding for vulnerable countries such as Bangladesh. Scientists warn that rising global temperatures could render parts of the country uninhabitable within decades. And yet, just as Bangladesh seeks to make the case for fairer climate finance flows, it is forced to reckon with a scandal that weakens its moral authority and raises uncomfortable questions about whether future climate funds-however meagre or delayed-will be spent as intended.\nThe irony is painful. Bangladesh receives a fraction of the money it needs to confront the scale of climate devastation. Experts estimate that the country requires more than USD 12 billion annually to protect communities from floods, cyclones, droughts and salinity intrusion. But from 2003 to 2024, it secured only USD 1.2 billion from international and national climate finance mechanisms. Against such a backdrop, losing Tk 2.0 billion or more to corruption is not merely irresponsible; it is cruel. The loss is borne not by bureaucracies but by families living on eroding riverbanks, farmers battling saline soils, and women walking miles for clean water. It is measured in shattered livelihoods rather than spreadsheets.\nThe BCCT was created with domestic resources at a time when the global climate finance architecture repeatedly failed to deliver. It was, in essence, a declaration of agency: a recognition that Bangladesh could not wait for international generosity to materialise. That such a fund has now become a playground for political patronage is not only a national embarrassment but also a betrayal of its founding purpose. This is public money, collected from citizens who have every right to expect that the state will protect them from climate threats-not funnel resources into pet projects or private pockets.\nWhat TIB describes is not administrative sloppiness but systemic rot. Projects were routinely approved without robust feasibility studies or environmental assessments. Monitoring was perfunctory; audits, where they existed, were weak. Selection of projects often appeared driven by partisan interests rather than scientific need. In some cases, projects were approved for areas with low climate vulnerability while high-risk regions remained neglected. If this were any other sector, the waste would be dismaying. In the climate sector, it is catastrophic.\nThe Climate Change Trust Act of 2010, once heralded as a pioneering framework in South Asia, has clearly not kept pace with the governance challenges that followed. Over time, the checks and balances intended to safeguard the fund have eroded. Oversight has weakened. Transparency has declined. The fund became, in effect, vulnerable to exactly the kind of political capture that climate finance experts have long warned about. Reform is no longer a recommendation; it is an urgent necessity.\nTIB's nine-point proposal offers a roadmap that policymakers would be wise to take seriously. At the heart of its recommendations is the need to amend the Climate Change Trust Act and create an independent oversight institution with real authority to scrutinise allocation, implementation and auditing. Full public disclosure of project information-from approval to completion-should be mandatory. Procurement processes must be modernised, digitised and transparent. Most importantly, those implicated in corruption should face prosecution, not quiet transfers or administrative pardons.\nBangladesh cannot afford to treat climate finance theft as a minor administrative lapse. It is, in every sense, a crime against the public interest-one that places vulnerable communities directly in harm's way. Corruption erodes the state's ability to respond to cyclones. It weakens embankments that protect millions. It deprives farmers of adaptive technologies that could save their crops. And, not least, it tarnishes the country's image at a time when global solidarity is already fragile.\nYet while the domestic failures are grave, they should not obscure a parallel truth: Bangladesh has been systematically short-changed by the global north. Wealthier nations have failed for years to meet their climate finance commitments. Pledges are slow, inconsistent and often tied to bureaucratic conditions that delay disbursement. In international negotiations, vulnerable countries routinely find themselves fighting uphill battles against shifting goalposts and unfulfilled promises.\nBut what the TIB revelations demonstrate is that domestic governance matters just as much as international justice. Corruption at home does not absolve the global north of its obligations. But nor does global injustice excuse internal mismanagement. For Bangladesh to argue persuasively on the world stage for increased adaptation financing, it must demonstrate that it has robust mechanisms to use such funds effectively.\nThe moral stakes are immense. Climate change is not a distant or abstract threat for Bangladesh; it is an ongoing emergency. Every year, families lose their homes to rising waters. River erosion displaces entire communities. Salinity destroys farmland. Cyclones intensify, leaving long trails of devastation. In such a context, climate money is not merely developmental-it is existential. Misusing it is not mismanagement; it is sabotage.\nBangladesh now faces a choice. It can continue with business as usual, allowing climate funds to be captured by vested interests and leaving vulnerable communities exposed. Or it can seize this moment to rebuild trust, strengthen oversight and send a clear message that corruption will not be tolerated-especially not in a sector that determines whether millions can withstand the storms ahead.\nStopping the misuse of climate funds is not simply an institutional duty. It is a moral imperative. Bangladesh's resilience-and its credibility-depends on it.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Misuse of climate fund must be stopped",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/misuse-of-climate-fund-must-be-stopped-1763390216",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       November 18, 2025 12:00:00  \nOne may recall the fury of the forest grabbers when they attacked government officials including members of the joint-forces in November last year as the latter carried out an eviction drive at Rajbari in Sreepur upazila of Gazipur to recover forestland. During the attack, 10 people including an assistant commissioner (land) were injured and vehicles belonging to the Sreepur upazila UNO and excavators were vandalized. It appears, government-owned lands including forests are up for grabs, while government people, let alone responsible members of the public who might dare challenge it, would be considered as intruders by the grabbers. \nBut then one is left wondering when Forest Department (FD) itself allows pineapple, banana and papaya to grow on large tracts of forestland once occupied by sal bon (sal forest) of Madhupur in Tangail and where rubber plantation covers over 7,500 acres of land courtesy of FD who leased out that land to the Bangladesh Forest Industry Development (BFIDC). In that case, you cannot perhaps blame ordinary people doing something similar. For people follow examples. Consider the case of Md. Azmir Hossain (37). He lives in the Beltali area of Cumilla Sadar South, close to the Dhaka-Chattogram highway. He, allegedly, cut down some 52 bokul trees (Spanish cherry, bullet wood; scientific name: Mimusops elengi) from the median of the Dhaka-Chattogram highway because to him those trees were of no use and they looked like trash. \n \nSo, after felling and burning down some 52 bokul trees along a 500-metre stretch of the highway divider, Azmir planted some fruit-bearing trees and vegetables. To him there was nothing wrong in what he did. But one wonders, how growing up as a native of this country, the person in question has no knowledge of a bokul tree or its cream-coloured, intensely fragrant flowers that he dismissed as garbage! Let us for the moment forget that bokul is unfamiliar to Azmir, who lives close to the Dhaka-Chattogram highway in a tin-shed hut, which is adjacent to the main gate of the yet-to-be-inaugurated 100-bed child hospital and where he sells tea and snack foods. So, there is no doubt that the man has real business acumen to have chosen the spot to make a living by running a teashop. \nObviously, a sufficiently worldly-wise person, Azmir could not have failed to know that the strip of land on the Dhaka-Chattogram highway was owned by the RHD. So, by cutting down trees standing on government land or using the land for growing vegetables or other kinds of plants, he was knowingly breaking the law. However, he might be unaware of the fact that the bokul trees were planted to beautify the surroundings of the divider between the lanes of the highway. Also, it might be unbeknown to him that in 2016, when the four-lane Dhaka-Chattogram highway became operational, the bokul trees were planted on the highway median so that after growing tall they might block headlights of the vehicles on one lane from dazzling the eyes of vehicle drivers on the opposite lane. But at a time, when even a schoolchild knows that cutting of trees is damaging to environment, it could not be otherwise for a grown-up person like Azmir.\nClearly, Azmir was consciously breaking the law, for he has seen many others are also flouting law with impunity through grabbing government lands or felling trees on such lands. So, he just took a chance. In case, it goes unnoticed by RHD authorities or the law-enforcers, his vegetable farming along with the earning from teashop would be a rewarding enterprise for him. Or maybe, he has connections to fall back on in case any emergency arises. However, Md.Azmir Hossain is not that lucky to get away with his illegal act. He has reportedly been arrested and is now and taken into police custody. Will the government be equally prompt to hold other illegal occupants of public land?\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Grabbing public land with impunity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/grabbing-public-land-with-impunity-1763390404",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 18, 2025 00:00:00  \n\nWinter has already begun, and our country is home to over 5 million street children. During this season, their condition becomes particularly vulnerable. Being homeless, lacking warm clothes, and facing the biting cold every day makes them prone to sickness. It is common to see street children seeking warmth near roadside fires from burning rubbish. This distressing reality should prick the conscience of every citizen. Like all children, street children have the right to a safe, healthy, and dignified life.\nProfessionals and citizens from all walks of life should stand by these children during winter. Small actions-buying warm clothes or blankets, sharing personal winter garments, or contributing to social initiatives-can significantly reduce their suffering. Social organisations should also take active steps, implementing effective programmes to support street children throughout the cold season. Acts of help not only ease their hardships but also bring peace of mind to those who extend it.\nIt is our collective responsibility to alleviate the misery, suffering, and poverty of street children, enabling them to lead a better life. Let us come together to protect them from the harsh winter and uphold their basic rights.\nShah Muntacher Hossain Mihan\nMSS Student\nDepartment of Social Work\nNoakhali Science and Technology University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Help street children this winter",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/help-street-children-this-winter-1763390428",
        "news_paper_name": "The Financial Express",
        "publish_date": "18-11-2025"
    }
]