[
    {
        "full_article": "The expansion of the Bihar Council of Ministers — seven new members, all from the Bharatiya Janata Party (BJP), have been inducted — is the clearest public statement that the party wants to rewrite its terms of engagement with its partner, the Janata Dal (United), or the JD(U). The BJP now has 21 of 36 cabinet positions, while the JD(U) has 13, including Chief Minister Nitish Kumar. The Hindustani Awam Morcha (Secular) has one Minister while the remaining post is an independent. With the Assembly elections only a few months away, the BJP has made it clear to the JD(U) that it will now act as the senior partner of the alliance. The expansion was after Mr. Kumar’s meeting with BJP president J.P. Nadda and just ahead of the visit of Prime Minister Narendra Modi to the State, marking an early beginning of the election campaign in his characteristic style. The Assembly election in 2020 was a turning point. The JD(U) contested 115 seats but won only 43, while the BJP won 74 out of the 110 seats it contested. The partners flipped their positions within the alliance, with the BJP emerging as the senior partner after playing a supportive role to Mr. Kumar for nearly four decades. The BJP conceded the Chief Minister’s post to Mr. Kumar in order to avoid any potential blowback from the Extremely Backward Classes (EBC) which continue to support Mr. Kumar.At 73, Mr. Kumar is younger to both Prime Minister Narendra Modi, who is 74, and the Rashtriya Janata Dal (RJD)’s Lalu Prasad Yadav, who is 76, the other key figure in Bihar. The JD(U) supremo, however, is at a vulnerable moment in his career after having been the Chief Minister for two decades, hopping between the RJD and the BJP for partnership. The BJP is trying to capitalise on this and consolidate its dominance. The caste composition of its Ministers is a clear indicator of the party’s strategy to directly engage with a wide array of communities and reduce its dependence on Mr. Kumar even further. This is in keeping with a pattern that the BJP has been following over the years — the party reaches out to newer electorates by making alliances with parties first and then gradually expands its own direct contacts with them. The most recent example of this was in Maharashtra where the BJP replaced the Shiv Sena as the dominant party. While Mr. Kumar may sense the danger involved in his partnership with the BJP, his options are limited. Having switched between the BJP and the RJD several times in the past, he only managed to delay, but not avoid, this moment of utter helplessness. Published - March 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        Hindustani Awam Morcha\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        Shiv Sena\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2020",
        "headline_1": "​Turning point: On the BJP, JD(U) and politics in Bihar",
        "headline_2": "In Bihar, the BJP is now clearly the senior partner in the alliance with the JD(U)",
        "link": "https://www.thehindu.com/opinion/editorial/turning-point-on-the-bjp-jdu-and-politics-in-bihar/article69275192.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "As the first phase of the Israel-Hamas ceasefire comes to an end on Saturday (March 1, 2025), there are growing signs that the already fragile truce is under enormous strain. When the deal was reached in mid-January, the understanding was that it would be implemented in three phases. In the first, Israel was required to reposition some of its troops, letting displaced Palestinians move from the south to the north, and release more than a thousand security prisoners in return for some 32 hostages. In the second phase, both sides are required to bring the war to an end, while the third phase is about the reconstruction of Gaza. In the first 42 days, both sides stuck to their commitments despite challenges — Hamas released 38 hostages and Israel freed hundreds of prisoners. Talks for the second phase were to begin days earlier — Prime Minister Benjamin Netanyahu sent a delegation to Cairo only on Thursday (February 27, 2025). And, according to the deal, Israel was to complete the withdrawal of its troops from the Philadelphi corridor, the 14-kilometre stretch along southern Gaza’s border with Egypt, by Saturday. But on Thursday, an Israeli soldier ruled out an Israeli pull back from the corridor, casting doubts on the future of the ceasefire.When Israel launched the war on Gaza, following Hamas’s October 7, 2023 cross-border attack in which 1,200 people were killed, Mr. Netanyahu’s declared objectives were the dismantling of Hamas and the release of the hostages. But after 15 months of war, in which nearly 48,000 Palestinians have been killed and more than 1,00,000 wounded, Israel achieved neither of the goals, which eventually forced Mr. Netanyahu to strike a deal with Hamas to get the hostages out. For a permanent end of the war, Israel has to leave Gaza. If Mr. Netanyahu withdraws his troops, Hamas will remain in power in the enclave, an outcome that could lead to the collapse of his right-religious government. The proposal by United States President Donald Trump to “own Gaza” and ethnically cleanse the strip’s 2.3 million Palestinians seems to have hardened Israel’s position further. But by keeping its troops in Gaza, Israel is not only violating the terms of the ceasefire but is also stepping into the abyss. Despite its superior forces and unmatchable fire power, Israel has failed to destroy Hamas, which, in the words of Israel Defense Forces spokesperson Daniel Hagari, is “rooted in the hearts” of Palestinians. After the first phase of the ceasefire, Hamas will still have over 60 hostages. So, if Israel refuses to exit Gaza and extend the ceasefire, what is awaiting the enclave is a war of attrition. Instead, the Jewish state should honour its commitments under the agreement. The U.S., rather than make outlandish statements such as ethnically cleansing Palestinians, should use its leverage over Israel and its Arab neighbours to implement the ceasefire and draw up a plan for post-war Gaza, that includes its governance and reconstruction. Published - March 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        Egypt\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "​Truce under fire: On the first phase of the Israel-Hamas ceasefire",
        "headline_2": "All sides must ensure that the war in Gaza ends permanently",
        "link": "https://www.thehindu.com/opinion/editorial/truce-under-fire-on-the-first-phase-of-the-israel-hamas-ceasefire/article69275164.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "Some merit-based lateral entry is good, period\nSebi’s first woman chief, Madhabi Puri Buch, signed out on Friday. Like all records, hers is a mixed bag. On the plus side, she brought stricter norms for stockbrokers, and curbed retail participation in high-risk derivatives. But she couldn’t, or didn’t, reduce mutual fund expense ratios. Also, the conflict-of-interest charges she faced in the last few months of her three-year term will mar her record. As a lateral hire – first private sector executive to helm Sebi – she should have cleared the air. Her long silence and reluctance to appear before Parliament’s public accounts committee now seem like own goals.\nSebi is back with a career bureaucrat, Tuhin Kanta Pandey. And after last August’s retreat on lateral entry, GoI may not have the stomach for pushing more direct appointments. Which is unfortunate because lateral entry has served India well for decades. Amul is among the world’s strongest food brands now, but who made it a juggernaut? Verghese Kurien, a lateral hire, long before the term was coined. Bimal Jalan, Jagdish Bhagwati, Raghuram Rajan and many others proved the wisdom of the policy. They had already made their mark outside govt, and brought fresh ideas and energy to the system.\nGoI formally announced its lateral entry scheme in mid-2018, and hired 63 specialists over the next five years. Transparent hiring and background checks to spot conflicts of interest were going to be key to its success. However, it wasn’t the Buch case but politics that stalled lateral entry. It’s nobody’s case that career bureaucrats don’t make good leaders – look at Maruti chairman RC Bhargava. But equally, if private sector experts want to serve govt, doors shouldn’t be shut. There will always be cutting-edge areas like AI and clean energy where in-house talent may not suffice. GOI shouldn’t be wary of merit-based lateral entry.\n\n",
        "headline_1": "Buch The Trend",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/buch-the-trend/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "An argument for established religion \nThe modern world is wary of religion. But Believe:  Why Everyone Should be Religious by Ross Douthat makes an intellectual case for faith, and why we would be better off committing to the ritual and ethical practices of established religion. The instinct for the spiritual and supernatural has always been with us, the book says. It argues religion might still offer a reasonable perspective on reality and human destiny. Instead of the pick-and-choose spirituality, it advocates commitment to an established religious tradition.\nReligion is a system of belief and practice that tries to connect humans to a supernatural order, offers moral guidance, and preparation for a possible hereafter. While written from a Christian believer point of view, the book offers examples from world’s major faith traditions, polytheistic and monotheistic.\nThe book offers specific reasons for belief. The intricate design of the world – science added new facts, but didn’t discredit the fine-tuned wonder of our world. Quantum physics only provides wider evidence for the religious worldview. We are not just matter in motion, human minds are not just biochemical arrangements, and AI only deepens the mystery of consciousness. Another reason for belief, according to the book, is empirical – widely documented miracles and mystical visions, in regular life or at the brink of death.\nWhat of the eternal question: If god is all-powerful, why do terrible things happen in the world? The book says humans facing suffering have, paradoxically, less trouble reconciling their experience with a strong belief in God. Another question: why do religious institutions do so many wicked things? Douthat’s answer: Family, business and govt are all replete with abuse – but we don’t give up on them, we try to reform them. There is no evidence, he argues, that religious causes are a source of violence and persecution any more than motives like conquest or resource control. In fact, international law, human rights, and movements for progress and peace have also been religiously inspired.\nWhile some object to traditional religion’s views on gender and sexual ethics, all mainstream religions offer more open-minded interpretations – though the book also suggests religion’s rules may be right, in some cases.\nWe often inherit our religious beliefs, rather than investigating the metaphysical truth of each faith. But the book says even if, for argument’s sake, the truest religion is Sunni Islam but you’re raised as a Protestant Christian, you’re still better off worshipping the same god through a mediating figure of Jesus. Christian practices of prayer tiptoe toward mediation, the Eightfold Path has ethical overlaps with the Ten Commandments, and so on.\nReligious faiths have a common core, and those who believe in any one are better off than those of no faith at all. Just as there is no shame in returning to your parents’ faith, there is no shame in converting to a faith that calls out to you, for whatever reason. The act of questing, of following spiritual threads, might take us to unforeseen destinations, but what matters is the exploration, the book says.\n\n",
        "headline_1": "God Isn’t Dead, So We Better Believe",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/god-isnt-dead-so-we-better-believe/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "Why do cartoon animals act like people?\nFrom China to India, kids everywhere are excited—Peppa Pig is getting a new baby brother or sister! If you don’t know Peppa, she’s a super famous cartoon pig from a British TV show that started in 2004. The show is mostly for preschoolers, but even older kids enjoy it. In India, parents say their kids pick up a British accent from watching too much Peppa Pig!\nNow, everyone is curious: Will Peppa’s new sibling love jumping in muddy puddles like she does? Will they wear a different colored shirt? Peppa’s signature color is pink, after all.\nBut Peppa is part of a much bigger trend—cartoons LOVE animal characters. Think about it: Mickey Mouse, Tom and Jerry, Bambi, Winnie the Pooh, Nemo… the list goes on! These characters are popular everywhere because they don’t belong to just one culture.\nA famous psychologist, Sigmund Freud, once said that kids find adults confusing, but animals make more sense. However, the animals we see in cartoons aren’t real animals at all! They’re just animals acting like humans.\nDoes watching these cartoons make kids care more about real animals? Maybe. But sometimes, it causes problems. After the movie 101 Dalmatians came out, everyone wanted a Dalmatian puppy. Dog breeders started making more and more of them, even if it wasn’t good for the dogs. That’s not really helping animals—it’s just following a trend.\nSo, while Peppa and her cartoon friends are fun, it’s important to remember that real animals are very different!\n\n",
        "headline_1": "Peppa’s Not a Person!",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/peppas-not-a-person/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "On animated animal characters behaving like humans\nFrom Chengdu to Chennai, this may be the hottest news item as far as the kids are concerned – Peppa Pig is all set to get a new brother or sister. For oblivious adults, this is about an animated character and her phenomenally popular TV show that Britain debuted in 2004. Its main catchment area is pre-school. But it also has lots of appeal among those in  primary school. In India, parents note that it tends to give their toddlers an English accent. Anyway, there’s great curiosity about Peppa’s new sibling’s sex, as also about whether he/she will love jumping in muddy puddles like Peppa does, and what will be the colour of his/her shirt. Peppa’s is a signature pink.\nShe’s also of course representative of a sharp ‘animalistic’ trend across children’s shows, movies and books. Animal characters rule across the entire animation spectrum. Bagheera, Bambi, Hello Kitty, Mickey Mouse, Nemo, Rocket, Snowy, Tom and Jerry, Winnie the Pooh…the list is endless. They’re all experts at crossing cultures. One explanation, deriving from Freud, is that children find adults very confusing, and by contrast animals seem relatable. But the psychoanalyst was referring to actual animals. What cartoons give us are highly constructed, even distorted, animals. The extreme anthropomorphisation tells children that it’s only the human lens that gives validity to all the animal species.\nDo these animated characters help raise public interest in animals? Well, don’t zoos do that too? It’s debatable that all this is really in the best interest of the animals themselves. 101 Dalmatians spiked the public’s desire to ‘own’ one themselves. It was boom time for the ‘puppy mills’. But to breed animals to a fad, such as big spots or big eyes, is perversity, not kindness.\n\n",
        "headline_1": "Peppa Ain’t A Person",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/peppa-aint-a-person/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "A major survey carried out by Bangladesh Bureau of Statistics (BBS) in collaboration with the UNFPA has confirmed our worst fears: that women are three times more likely to face physical abuse and over 14 times more likely to suffer sexual violence from their husbands than from others. According to the Violence Against Women Survey 2024—based on interviews with 27,476 women—54 percent of the respondents reported experiencing physical and/or sexual abuse by their husbands at some point in their marital lives. Moreover, 70 percent experienced at least one form of abuse—physical, sexual, emotional or economic—at some stage. These figures are staggering, even if not entirely surprising, given the silence enforced on intimate partner violence (IPV) in our typically conservative society.\nTo understand how widespread this has become, it is sufficient to note that 41 percent of the respondents reported being abused by their intimate partners during the 12-month survey period alone. And the fact that 76 percent of women in rural areas and 75.6 percent in urban areas faced such abuse—with smaller margins of difference among divisions than one would have expected—shows how this has transcended geographical divides. This may come as a surprise to some as urban households are often thought to be more educated. The types of abuse experienced by married women are also diverse, with the most common being controlling behaviour and emotional abuse, underscoring the severity of psychological violence in relationships.\nThis landmark national survey—the third of its kind—offers comprehensive insights into the scale and impact of violence against women. Only the other day, we expressed our concern about the frequent incidents of rape and sexual violence being reported across the country. Among such crimes, IPV is one that deserves to be particularly highlighted because of the silence around it, with many frowning upon even the mere acknowledgment of abuse within marriages. The survey's finding that 64 percent of the victims never share their experiences—and only 7.4 percent seek legal action—is a stark reminder of how deeply ingrained such silence is. It may stem from a desire to protect family reputation, concerns for children's well-being, and the perception that such abuse is \"normal.\" Whatever the cause may be, the culture of silence and denial only enables the perpetrators, helping perpetuate domestic violence through generations.\nThere is, therefore, no alternative to raising awareness and encouraging married women to speak out without fearing stigma and judgement. Equally importantly, men must be engaged in this effort—through education, community programmes, and stricter accountability—to end the impunity that allows such abuse to persist. At the same time, the government must act on the findings of the BBS survey and implement its recommendations so that there are greater protections against all forms of gender-based violence, including domestic violence.\n",
        "headline_1": "Break the silence on domestic violence",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/break-the-silence-domestic-violence-3836586",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "\"I do not know whether I will be able to make it alive. Please get me back home. Otherwise, I may die.\" These were the last words of Rahmat Ali to his wife before communication was cut off with him. Rahmat, hailing from Natore, along with his brother-in-law Humayun Kabir, embarked on a journey to Europe with the hope of improving their financial conditions. They mortgaged lands, sold jewelleries, and took out a loan to pay Tk 18 lakh to a local agent. With a promised monthly salary of Tk 2.5 lakh, the men were first taken to Saudi Arabia and later \"sold off\" to Russia. There, Kabir and Rahmat were forced to take a 15-day military training and join the battlefield. Sadly, Kabir lost his life on January 26 this year in a drone strike. \nIn another instance, a similar fate awaited Akram Hossain and Sohan Mia from Narsingdi. The brothers, under the false promise of the job of a cook or gardener, were sold as war slaves in Russia. Each of them had to pay around Tk 8 lakh to the agency for the jobs, but were later told that they were going to get Umrah visa to go to Saudi Arabia, and from there Russian work permit would be given. However, they got a one-month travel pass instead. Upon reaching the airport in Saint Petersburg, their mobile phones and documents were confiscated. The brothers were tortured, brutally beaten up, threatened, and ultimately forced to join the war. Fortunately, Akram managed to flee to Bangladesh, but Sohan was not lucky enough and was stuck in the combat field. Keraniganj's Aminul Islam, Jashore's Zafar Hossain, and Narsingdi's Mobarak Hossain, along with other victims, had similar experiences of being defrauded and forced to take up arms after month-long combat training.\nAn investigative report revealed that at least 18 Bangladeshi migrants were deceived and sent to Russia only to join the armed forces and fight on the battle front. Some died, many remain missing, while some were severely injured. One such individual is Rajbari's Arman Mondal, who was wounded in a mine blast. He, too, was first sent to Saudi Arabia with an Umrah visa and later handed over to a Russian syndicate. After 30 days of rigorous training, Arman was deployed on the warfront against his will. The agency had promised him a gardening or cooking job at a Russian cantonment, and he was also promised a 10-year work visa. In reality, the agency tricked him and provided a month-long tourist visa only. \nMedia reports show that a number of these workers hoped to go to Europe but were rerouted to Russia and deceived into joining the military. The ones who wanted to go to Russia directly had to pay Tk 7-8 lakh, while those planning to go to other European countries paid a staggering amount of Tk 15-18 lakh. Almost all of them were promised jobs with good salaries. Considering their economic condition, the victims were not able to deny such lucrative offers and walked into the trap set by the perpetrators. In the majority of these cases, an agency named Dream Home Travels is alleged to be the mastermind behind the trafficking ring. Close ones of the victims have been trying to contact the owner of the agency, but their office has since remained locked. After an investigation by the Ministry of Expatriates' Welfare and Overseas Employment, it was confirmed that the agency in question was not a registered recruiting agency but a travel agency. The ministry assured that action was being taken against them and also issued an awareness notice based on this incident, urging aspirant migrant workers to be more careful before accepting a job offer abroad. One of the perpetrators, Tamanna Zerin, was arrested by the CID from the airport on her way to Nepal on February 6. The rest of the accused remain unreachable.\nTurning innocent aspirant migrants into war slaves impacts the workers and their family members physically, mentally, and financially. The relatives of the victims, whose whereabouts remained unknown until now, have appealed to get their loved ones back. They have also demanded exemplary punishment of those engaged in human trafficking. It is evident that syndicates both in Bangladesh and the destination country are jointly operating this trafficking ring. The Bangladesh government must take immediate steps to address the pleas of the affected migrants fighting in the Russian-Ukrainian war zone and ensure their safe return to their motherland. Experts suggest that the Ministry of Home Affairs should take stern action against the travel agencies involved. Also, identifying the local agents and similar agencies is necessary to prevent this heinous crime.\nMohammad Inzamul Haque is project manager at Refugee and Migratory Movements Research Unit (RMMRU).\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The plight of migrant workers stranded in Russo-Ukrainian war zone ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-plight-migrant-workers-stranded-russo-ukrainian-war-zone-3836176",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "Having been a journalist since 1972 and an editor-publisher since 1993, it saddens me deeply to see some editors, instead of embellishing, strengthening, and bringing more honour and dignity to their position, are doing the exact opposite: bringing shame, disrepute, and indignity by acting as public relations officers (PROs) of their owners.\nEditorship is, no doubt, a job. However, far more importantly, it is a position of public trust. It is on that trust that the credibility of a particular media outlet depends, which, at the end of the day, determines its success. An editor must adhere to the fundamental ethics of journalism: truth, objectivity, honesty, and a complete absence of bias. Every story must be fact-based, verified by multiple sources, and the person or the institution being written about be given a chance to respond. Yes, proprietors may, and can and sometimes do, have an agenda of their own, but it is the editor's duty to protect his/her institution from gross misuse.\nA prerequisite of being an editor—qualities far more important than his/her ability to write, edit, direct, lead, brief reporters, have a nose for stories, etc—is to have sufficient self-respect, personal courage, and dignity to never to allow the media under his control to be used to spread lies and hatred, defame, and falsely malign. When a proprietor forces an editor to publish something, the latter must ensure two things: one, that it is fact-based; and, two, that the other side is given a chance to respond. If all his/her efforts fail, he/she should resign and go public to show how he/she tried to save journalism from being exploited. That is how the editorial institution is built and the public respect for it grows.\nIt is not uncommon for proprietors and editors to have political leanings. But that should be in the opinion section and should never cloud reporting, which should only be fact-based and adhere to the fundamental ethics of journalism.\nA proprietor can own anything permitted by law. But there is a difference between owning a shoe factory and a pharmaceutical company. As the owner of the former, he/she can experiment with practically anything: design, colour, material, shape, etc. But in the case of the latter, the owner must totally and completely submit to the professional management and allow complete freedom to operate the factory according to all scientific specifications. Can an owner tell a doctor how to treat a patient or which medicine to prescribe for which malady? Similarly, the media must be run by professional journalists. An owner must allow total independence of the professionals, led by the editor, to run a media establishment in an unbiased and fact-based manner.\nThe purpose of this column is to raise the issue of owner-driven journalism versus professional journalism, a PRO-editorship versus professional editorship.\nLet us remember with pride that only two professions are given protection in any democratic country's constitution: the judiciary and mass media. Why? Because experience has shown that an independent judiciary acts as a pillar of democracy, and free media serves the essential purpose of assuring accountability and transparency of the governance process.\nWhat I write below—without mentioning the names of either the newspapers or their editors—is not aimed at shaming journalists or fellow editors, but at raising the issue of how we are destroying the editorial institution and thereby bringing disrepute and ignominy to our highly esteemed profession.\nOn February 23, three newspapers—two Bangla and one English—published the same report, with the same headline, \"Prothom Alo, Daily Star: The 'masterminds' behind plot to eliminate Begum Zia from politics,\" referring to the events that occurred in 2007—18 years ago. What sort of journalism is it when the same text—word for word—is published in multiple newspapers, each claiming it to be written by their own \"special correspondent\"? What does it say about the \"editor's\" authority in deciding on content? Where does such content originate from, what is the process of its verification, and what leads editors to carry such content without any explanation to its readers? This is when editors relinquish their authority and become PROs of their media owners.\nThe story line is: Prothom Alo and The Daily Star masterminded the ouster of Khaleda Zia from politics. The reports begin like this, \"In 2007, a blueprint was devised to destroy democracy in Bangladesh and depoliticise the country. One of the key architects of the blueprint was the Prothom Alo and The Daily Star group. The two newspapers not only played (a) key role in formulating the plan but also engaged in relentless smear campaigns to eliminate BNP Chairperson Khaleda Zia from politics.\"\nThe origin of the story is a press conference held by Abdul Mannan Bhuiyan, the then secretary general of BNP, which was covered by all newspapers and TV stations at the time. We were able to gather the following few: \"Khaleda Zia baad\" by Ittefaq; \"Khaleda Zia out\" by Sangbad; \"BNP's reform initiative keeping Khaleda Zia out\" (translated) by Inquilab; \"Proposal to reduce the power of BNP chairperson\" (translated) by Naya Diganta; \"BNP reform plan shows door to Khaleda\" by The Bangladesh Observer; and \"BNP's reform proposals\" (translated) by Janakantha. The reports of the three newspapers singled us out and did not mention that all others newspapers published the same story. We had similar heading and content as the others.\nWhat is striking is that this very line of propaganda was followed by the fallen regime, which is now being repeated by these three papers. The Daily Star and Prothom Alo—because we spoke truth to power—were accused by Sheikh Hasina and Awami League ministers and party leaders that we were behind the 1/11 army-backed caretaker government—again without submitting an iota of proof. For 15 years, Hasina and her party held unquestioned power. They must have investigated us as thoroughly as can be imagined. They found no proof. That is why, in spite of lodging 84 cases against this writer—16 of which were for sedition—they did not follow through.\nOn what basis, using what proof did the three newspapers' journalists write this common copy, and why did three separate editors allow this story to be printed? What fact-checking did they do? What sort of authentic—as against biased—investigation did they undertake? And how could the editors violate the most basic norm of journalism, and not give the subjects of the report any chance to respond?\nAmong many reforms that Bangladeshi newspapers must undertake—and we are looking forward to the report of the Media Reform Commission—an important one is to move away from \"owner-driven journalism\" to \"editor-driven journalism.\"\nThe three newspapers in question have published false, twisted, distorted reports against us many times before, similarly without evidence. On April 21, 2011, the Bangladesh Press Council passed a stern judgement against one of the said newspapers on its reporting against Matiur Rahman, editor of Prothom Alo, saying that \"… reporting constituted yellow journalism which is a violation of newspaper ethics.\" A similar judgement was passed against the other Bangla newspaper on May 12, 2011 on another report against the Prothom Alo editor, saying \"… the report was false, fictitious and was an example of yellow journalism.\" On both occasions, the editors and publisher of those newspapers were reprimanded. Similar condemnatory judgements was passed by the press council and delivered against all three newspapers on May 22-24, 2013, who were accused of publishing false, fictitious, derogatory, and unsubstantiated news against Prothom Alo and its editor.\nRecently, I came across a term in Bangla—\"shikari sangbadikota\" (\"target journalism\"), meaning journalism designed to target an individual, institution, personality, editor, or newspaper without proof. The purpose is to denigrate, malign or discredit someone. Just as one hires an assassin to kill someone, one hires \"shikari sangbadik\" to assassinate the character of a person of high repute or a newspaper of high standing.\nI appealed to journalists in a piece I wrote on April 7, 2023, titled \"Only journalists can protect journalism.\" This was in response to a vicious, Goebbels-style campaign, conducted by a private TV station against Prothom Alo about a photo of a child published with a quote from a day labourer as a photo card. The TV station accused Prothom Alo of \"conspiring to destabilise our independence and make our Liberation War questionable.\" The Prothom Alo editor was sued under the infamous Digital Security Act (DSA) and his Savar correspondent was picked up, gangster-style, without a warrant. Sadly, other than the Dhaka Reporters Unity (DRU), no other journalists' body or media organisation said a word.\nToday, I appeal again to all journalists, and especially to fellow editors, to move away from all our past prejudice, hatred, biases, and tendency to make fatal compromises and, alongside rebuilding Bangladesh in the post-July-August 2024 era, also rebuild journalism with renewed pledge to our journalistic ethos and commitment to democracy, freedom of expression, freedom of the press, and public service.\nEditors, please don't sacrifice your dignity and become PROs of the proprietors.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Editors, don't become PROs of proprietors",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/editors-dont-become-pros-proprietors-3835496",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Banking reform must be carried through",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/banking-reform-must-be-carried-through-1740749864",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "Distribution of food through social safety net programmes in Bangladesh — Collected ",
        "headline_1": "Making SSNPs beneficial to the poor",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/making-ssnps-beneficial-to-the-poor-1740749922",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Implications of UN  fact-finding report",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/implications-of-un-fact-finding-report-1740749964",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Trump's tariff policy and risks for Bangladesh",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trumps-tariff-policy-and-risks-for-bangladesh-1740750241",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-03-2025"
    }
]