[
    {
        "full_article": "At the 10th edition of the Raisina Dialogue, visiting New Zealand Prime Minister Christopher Luxon — the conference’s chief guest — outlined three major geopolitical shifts shaping the world: the replacement of rules with power, the rise of security over economic considerations, and a move from trade efficiency to protectionism and resilient supply chains among trusted partners. In this context, Mr. Luxon suggested that India and New Zealand, despite their size disparity, could be ideal partners. Both democracies share an interest in ensuring freedom of navigation in the Indo-Pacific. While New Zealand is not part of the Quad (Australia, India, Japan, the United States) and does not seek membership, Mr. Luxon noted the ongoing dialogue among New Zealand, Australia, Japan and South Korea on regional issues. Following talks with Prime Minister Narendra Modi, the two countries signed a defence Memorandum of Understanding (MoU) to enhance military cooperation, staff college exchanges, and naval port calls. They also agreed to restart talks on a free trade agreement, aiming to expand their modest bilateral trade, currently under $2 billion. However, challenges remain, particularly around market access for dairy and agricultural products, which contributed to India’s decision to exit the Regional Comprehensive Economic Partnership (RCEP), of which New Zealand is a member. In contrast, New Zealand’s trade with China stands at approximately $24 billion, despite broader strategic concerns. Connectivity between the two nations received a boost, with Air India and Air New Zealand signing a codeshare agreement that may also lead to the first direct flights between the countries by the end of 2028.Despite the positive tone, Mr. Modi voiced concern over “anti-India activities by certain illegal elements” in New Zealand, referencing protests and a Khalistan referendum held by the ‘Sikhs for Justice’ group in Auckland last November. Although previously discussed between the Foreign Ministers, New Zealand police had ruled the protests to be lawful. In response, Mr. Luxon reaffirmed New Zealand’s commitment to free expression and noted the importance of not importing foreign political conflicts into its diverse immigrant communities. While such concerns are legitimate, raising them publicly risks deepening divisions within the 3,00,000-strong Indian diaspora and overshadowing growing strategic and economic ties. These sensitive issues may be better handled through diplomatic engagement in private. Ultimately, India and New Zealand stand to benefit from greater collaboration — particularly in trade, defence, and regional stability — as two democracies that “book-end” the Indo-Pacific. Published - March 22, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        diplomacy\n                    \n                            /                      \n                        \n                        New Zealand\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Navigating differences: On India-New Zealand ties",
        "headline_2": "India and New Zealand stand to benefit from greater collaboration",
        "link": "https://www.thehindu.com/opinion/editorial/navigating-differences-on-india-new-zealand-ties/article69358263.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "Summer has arrived early in several parts of India. In the last week of February, heatwaves were officially reported in Goa and Maharashtra. States such as Odisha, Telangana, and Maharashtra have already recorded temperatures exceeding 40°C. Throughout most of February, 31 States and Union Territories experienced night temperatures at least 1°C above normal, with 22 States and Union Territories reporting night temperatures that were 3°C to 5°C above normal. Given that February is classified as ‘winter’ by the India Meteorological Department, these are signposts that point toward new climate normals. Scientists have long warned that rising global temperatures — both on land and sea — will result in more intense and frequent heatwaves. This underscores the need for countries and States to prepare for heat events just as they do for earthquakes or floods. However, a recent study by the Sustainable Futures Collaborative, which examined heat-related preparedness in nine Indian cities, found that none had long-term plans in place. Most responses are limited to short-term emergency measures such as providing drinking water, adjusting work hours, and boosting hospital capacity during heatwaves. Crucial long-term interventions such as ensuring access to household or occupational cooling for vulnerable populations, insuring workers against lost income on extremely hot days, improving fire management, and upgrading electricity grids for reliability are missing. Few cities have even begun planning for expanded local weather monitoring, mapping urban heat islands, or training those responsible for implementing heat plans. Other strategies, which include increasing green cover, creating open spaces to reduce heat, and deploying rooftop solar for active cooling, are often carried out without targeting the populations that are most at risk.While global efforts to combat climate change largely focus on cutting greenhouse gas emissions, the limited progress on that front is shifting attention to adaptation — particularly in managing responses to heat. Affordable cooling devices are frequently recommended, but they raise concerns about increased use of ozone-depleting refrigerants. Experts now advocate having sustainable buildings, green infrastructure, and passive cooling solutions, although these too can impact land prices and urban planning. India must develop a comprehensive national heat strategy and embed it within its National Adaptation Plan ahead of the 30th UN Climate Change Conference (COP30) in Brazil in November. Published - March 22, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        weather\n                    \n                            /                      \n                        \n                        heatwave\n                    \n                            /                      \n                        \n                        Goa\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Telangana\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        drinking water\n                    \n                            /                      \n                        \n                        hospital and clinic\n                    \n                            /                      \n                        \n                        population\n                    \n                            /                      \n                        \n                        fire\n                    \n                            /                      \n                        \n                        solar\n                    \n                            /                      \n                        \n                        greenhouse gases\n                    \n                            /                      \n                        \n                        carbon emissions\n                    \n                            /                      \n                        \n                        Sustainability\n                    \n                            /                      \n                        \n                        United Nations (climate change)\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        insurance",
        "headline_1": "​Heat plan: On Indian cities and heat-related preparedness",
        "headline_2": "India must develop a comprehensive heat strategy ahead of COP30",
        "link": "https://www.thehindu.com/opinion/editorial/heat-plan-on-indian-cities-and-heat-related-preparedness/article69358310.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "A loose global alliance that hates eggheads & loves ‘tradition’\nSix authors (Rita Abrahamsen, Jean-Francois Drolet, Michael C Williams, Srdjan Vucetic, Karin Narita and Alexandra Gheciu) set out to understand today’s most dominant political idea globally. The result is World of the Right: Radical Conservatism and Global Order, a book nine years in the making.\nSome of the analyses, though rooted in events in the last decade, help make sense of current news. When the authors talk of Steve Bannon’s 2017 declaration that a Trump 1.0 goal was “to deconstruct the administrative state”, DOGE pops into mind. When they explain New Right’s global alliance in defence of the “natural family” the logic behind Trump 2.0’s crackdown on DEI is clearer.\nWhat drives New Right? Disdain for experts and anti-intellectualism. It promotes a vague anti-elite discourse that includes praise for ‘tradition’. Its main enemy, of course, is Liberal International Order, LIO, which is pro-globalisation & liberalisation. New Right wants to capture universities, publishers and think tanks, LIO haunts thus far.\nLeftwing politics couldn’t build an internationalism, the book says, but its failure gave rise to a radical global Right, interconnected via a “distinct international dimension to their nationalist populist agendas”. Appearances at global meets are critical for New Right politicians, especially those marginalised in home countries. CPAC conferences, in 1970s, were small meetings of American conservatives. That idea is now everywhere from Australia to Japan, South Korea to Latin America, and also Europe.\nWho goes to these conferences? Bolsonaro, Milei, Orban, Farage, Bannon, Ted Cruz, Tucker Carlson, Ben Shapiro…In 2022, Vance attended Israel’s first CPAC. Japan CPAC “pledged support…within Quad” via an “Asia Pacific Conservative Union”. An AfriForum represents White Afrikaner minority in South Africa. A Madrid Charter seeks Iberosphere: a pan-Hispanic trans-Atlantic identity of Catholic faith. New Right strenuously displays closeness with Netanyahu, the book says, to shelter from accusations of anti-semitism.\nNew Right leaders revel in demonstrating friendships in highly mediatised spectacles – hugs & clasped hands. There isn’t unity, but commonality, which generates “energy and commitment”. So, different, but not disconnected.\nConservatism isn’t a school of thought. So New Right thinkers borrow. Marxist egghead Gramsci has been, the authors show, effectively appropriated. New Right reckons it’s a counter-hegemonic struggle against liberal thought, aka Elite Power. It poses as a pal of “forgotten working classes”. It mobilises groups marginalised by national/international processes of globalisation – economic dislocation, inequality and cultural resentment. This is the Common Cause.\nVagueness is a precondition to building political meaning, articulated in common language of tradition, people, nation, civilisation – similar struggles, different contexts. New Right’s free from Left’s anti-capitalism but it isn’t anti-elite. It wants to create a new elite in its own image.\nLIO’s “managerial elite” is the class of experts and bureaucrats in multilateral organisations – guys who oversee rules-based international order. A class unmoored from cultures, argues New Right, and interested in more globalisation and liberalisation. Therefore, the “struggle” to overturn the “woke-industrial complex”.\nThe book devotes a lot of pages to New Right’s battle against “transformation of culture”. This is code for the modern language of rights: disability, LGBTQ, right to choose, right to die, etc. Rights are seen as destroying cultural distinctiveness. New Right would rather legitimise new forms of exclusion.\nJust like radical chic Left, the personal is political – but for New Right, also geopolitical.\n\n",
        "headline_1": "What’s new about the newly powerful right?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/whats-new-about-the-newly-powerful-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "Why case of HC judge under probe has big implications \nSC moved swiftly in connection with the cash hoard police found at Delhi HC judge Yashwant Varma’s bungalow on Holi. Varma is second in seniority among Delhi HC’s judges, and SC has proposed his repatriation to Allahabad HC. Although, in a press note issued on Friday, it delinked the transfer from the case: “The proposal to transfer…is separate from the in-house inquiry procedure.”\nAs for inquiries, the first by Delhi HC’s chief justice is over and its report has reached CJI Khanna, who may take a call on it on Saturday. If the report supports the allegations, Justice Varma may be asked to resign, or face an inquiry panel.\nThe importance of this case cannot be overstated because, at a time people’s faith in other institutions of governance has eroded, judiciary needs to look squeaky clean. Over the decades, skeletons have occasionally tumbled out of the judicial closet. Calcutta HC judge Soumitra Sen quit midway through the debate on removal motion in Parliament. The charge was misappropriation of funds. Delhi HC judge Shamit Mukherjee quit after he was accused of accepting bribes, and more. Sikkim HC chief justice PD Dinakaran also resigned following allegations of corruption.\nThen there was the cash-at-door case against Punjab & Haryana HC judge Nirmal Yadav. The case blew up after a sum of 15L was wrongly delivered to the house of her namesake, Justice Nirmaljit Kaur, in 2008. Now, as SC probes the cash at Justice Varma’s residence, it should bear in mind the course of this 17-year-old case. In 2009, SC Collegium gave Justice Yadav a clean chit. She was transferred to Uttarakhand HC, where she retired in March 2011. But CBI chargesheeted her on her last day in service, and the case is still on. Justice Yadav’s innocence has not been established. That’s why transferring without exonerating is a bad idea.\n\n",
        "headline_1": "Judging it right",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/judging-it-right/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "A Husain fetches millions. So does a banana. Go figure\nThe relationship between art and money? It’s complicated. Insofar as the idea of starving artists is alive and well, so is that of art having value above and beyond money. But the way every auction record is celebrated, suggests the money art fetches is its true KRA. Some cases, like that of Husain, are extra complicated by extracurricular issues, legal to political. Now, with a 1954 canvas fetching $13.8mn, his work has set a new record for Indian art. It’s possible this headline will get his work more audience than all the galleries combined.\nAndy Warhol, who called his studio The Factory, also famously said good business is the best art. That isn’t supposed to be taken at face value, anymore than his Campbell’s soup cans are just soup cans. Pundits said those cans were an ambivalent critique of capitalism and consumer culture. In Husain canvases, pundits find anthropomorphisation of modern India, its icons and ordinary persons and everyday scenes.\nBut really, some of this punditry is too much of a muchness. Like the duct-taped banana from Art Basel Miami Beach that rang in at $6.2mn last year. Or the algorithmically generated rendering of code, The Goose, that rang in the same at Sotheby’s in 2023. Sometimes it all seems like richie rich pranksters getting high together. But then, is the fault not in our artist stars but ourselves? Why do we look at the price tag before we see the canvas?\n\n",
        "headline_1": "What price art?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/what-price-art/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "He has cast himself as hero of southern resistance against delimitation & NEP for a bigger reason: like dad Karunanidhi, he wants to be opposition frontman nationally\nThere will be a sense of déjà vu when chief ministers of the southern states (or their deputies) meet in Chennai on March 22. As they devise strategies to oppose the Union govt plan to increase Lok Sabha seats, it’s not just the delimitation debate that’s making history repeat itself. Leadership is doing the same.\n\nTaking the lead in rallying opposition parties – and reaching out to even the BJP govt in Odisha, a relatively small state that could be disadvantaged by delimitation – Tamil Nadu chief minister MK Stalin is following in the footsteps of his father, as a statesman bringing together regional powers for a common cause.\nRead the full story on TOI+.\n\n",
        "headline_1": "Stalin is now all-in",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/stalin-is-now-all-in/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "The findings of the recently unveiled National SDG Report 2025 highlight, once again, the deeply unequal nature of whatever progress Bangladesh has achieved over the years. According to a report based on the study, prepared by the Citizen's Platform for SDGs in collaboration with the government and the UNDP, a whopping 87.5 percent of the population—or 15 crore people—do not have access to all eight basic services, namely clean drinking water, basic education, sanitation facilities, hygiene facilities, clean fuel and technology, basic information services, basic mobility in rural and urban contexts, and basic waste collection services. This means that a vast majority of the citizens are facing persistent risks and hardships due to inadequate infrastructure and policy failures.\nThere are many other aspects related to these struggles. For instance, per the study, more than 26 percent of the population remains food insecure. Maternal and infant mortality rates remain high in a number of districts, while entrenched disparities persist between rural and urban areas, with the Chittagong Hill Tracts (CHT) and other poorer regions bearing the brunt. The picture is even grimmer for the most vulnerable segments of the population. Dalit and Adibashi communities, for instance, remain trapped in traditional, caste-determined occupations due to stigma and limited access to education and skills development. Approximately 8.9 percent of children are also engaged in economic work, with a third of them performing hazardous labour.\nThe report also highlights our fragile gains in poverty reduction, the persistent gender gap, and the disparities in education in terms of both access and quality. These findings are consistent with that of other recent studies and surveys that together paint a worrying picture of the ground realities facing poor and marginalised communities. It confirms that our development policies are not working as well as they should; instead, they are helping sustain inequalities year after year.\nWe must reverse this trend. First of all, our approach to governance must change. The authorities must prioritise inclusive development, rather than focusing on GDP figures that mask deeper inequalities. At the same time, political parties must play a greater role by integrating measurable SDG commitments in their manifestos and supporting programmes geared to that goal. We need tangible action for tangible outputs—proper data collection to list all vulnerable households, targeted policy interventions to address disparities, and increased investment in social infrastructure to increase access to essential services. Governance reforms are also crucial as corruption and inefficiency in public service delivery are directly linked to exacerbating inequalities. We must address all these interconnected issues for sustainable progress.\n",
        "headline_1": "We must do more, and better, to address inequalities",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-must-do-more-and-better-address-inequalities-3854221",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "A skinny, malnourished and tattered mother staggers towards a nearly empty medical clinic in a remote village in South Sudan. Her weak baby tries to nurse but finds no milk. A merciless midday sun scorches down. This scene, a daily reality for millions, is worsened by the US government's funding cuts to development organisations and NGOs. The impact of these cuts is not theoretical; it's a brutal reality playing out in some of the world's most vulnerable regions. \nThe situation is particularly grave in Yemen, a nation ravaged by conflict. According to UNICEF, around 17 million people in the country, more than 40 percent, are food insecure, of which 4.7 million are at crisis levels. Sixty-four percent of the households can't obtain their minimum food needs.\nSouth Sudan, another nation grappling with conflict and climate-related disasters, also faces immense challenges. Nine million people (54 percent of them children) require humanitarian assistance, including at least 7.1 million people who are estimated to have been severely food insecure at the peak of the lean season between July and September.\nThe crisis extends to Syria, where years of conflict have left over 16 million people in need of assistance. Any reduction in aid worsens an already precarious situation. \nIn Afghanistan, 14.8 million people have acute food insecurity, 3.5 million children are malnourished, and $652 million is urgently needed for World Food Programme (WFP) operations up to June 2025.\nThese statistics are not mere numbers, but the faces of human suffering. US aid has been a vital lifeline supporting essential health, education, human rights, and disaster relief programmes for decades. This funding has empowered communities to build resilience and improve their lives. With diminishing resources, these organisations are struggling to continue their vital work.\nThe impact is tangible. In South Sudan, medical clinics, already stretched to their limits, struggle to provide even basic care. All over Africa, organisations combating the effects of climate change and hunger face severe limitations in their ability to deliver essential aid.\nThe consequences are particularly acute in conflict zones. Organisations working to promote peace and human rights find their ability severely diminished. In Yemen, the reduction in funding threatens to plunge the nation deeper into a humanitarian catastrophe. In Myanmar, the country ravaged by the world's longest-running civil war, 35 percent of the population—18.6 million out of 53.8 million—need humanitarian aid. The humanitarian agencies are left scrambling for alternative sources of support, forced to lay off staff, cancel medical services, and close facilities.\nThis is not simply a matter of budgetary adjustments. It is a matter of human lives. Reductions in funding for education and healthcare perpetuate cycles of poverty, denying future generations the opportunity to build a better future. The weakening of civil society organisations undermines democratic institutions, silencing the voices of the most vulnerable.\nFaced with reduced US aid, we must proactively adapt, innovate, and find ways to continue humanitarian operations. First, diversify funding streams. Organisations can seek support from various sources instead of relying solely on one donor. This means building relationships with European and other governments, tapping into their established development programmes, and engaging with multilateral institutions like UN agencies.\nSecond, strengthen strategic partnerships. By forging alliances with local community organisations, NGOs can share resources, enhance programme effectiveness, and foster a sense of shared ownership. They can also collaborate with other NGOs to create more powerful and effective programmes.\nThird, invest in local sustainability. Develop robust local fundraising strategies to reduce reliance on external donors and empower communities to take ownership of their development. This involves building local ability and fostering a culture of giving.\nFourth, use digital platforms. Online fundraising, social media campaigns, and crowdfunding initiatives offer powerful tools to reach a global audience and mobilise support. Storytelling and transparency are critical when using these platforms.\nFifth, improve operational excellence. Streamline operations, focus on high-impact programmes, and implement rigorous monitoring and evaluation systems to ensure that every dollar is used effectively and shows tangible results.\nSixth, engage in advocacy. Development organisations can raise awareness about the impact of funding cuts and advocate for sustainable development policies. This involves engaging in policy dialogues, informing policymakers, and amplifying the voices of the vulnerable. NGOs must become more adaptable, resourceful, and collaborative to ensure that their vital work continues.\nLet's get back to the mother and her child. As they reach the nearly empty medical clinic in South Sudan, will they find the care they desperately need? Will the limited resources be sufficient? This is a stark reminder of the devastating consequences when the world turns its back on those in need. The effects of funding cuts are not abstract concepts; they are the faces of hunger, the cries of despair, and the loss of human potential. The world cannot afford to ignore this unfolding tragedy.\nDr Sayeed Ahmed is a consulting engineer and the CEO of Bayside Analytix, a technology-focused strategy and management consulting organisation.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "What can the world do as US aid cut pushes millions to the brink?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/what-can-the-world-do-us-aid-cut-pushes-millions-the-brink-3854141",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "There is no singular definition of a forest. The process of defining and identifying forest areas is inherently tied to the politics of power and authority. The state, the forest department, multilateral banks, donor agencies, corporations, and forest-dependent communities all perceive forests differently and define their relationship with them in distinct ways. However, institutionally, a forest is defined as a collection of numerous trees, their species, and wildlife. According to The United Nations Convention on Biological Diversity (CBD), forest biodiversity refers to the assemblage and relationships of all trees, animals, and microorganisms within a forest, as well as their ecological processes and functions.\nAlthough Bangladesh has a relatively small land area, its forests are remarkably diverse. They include mangroves, coastal swamp forests, deciduous sal forests, hill evergreen mixed forests, rainforests, swamp forests, reed forests, rural forests, and sacred groves. According to numerous indigenous narratives worldwide, civilisation itself was born from the forest. While countless species, including humans, depend on forests for food, shelter, medicine, and survival, the neoliberal system continuously disregards these contributions. The unilateral commercialisation, exploitation, and occupation of forests began with the shipbuilding, timber, and pharmaceutical industries. To sustain profit-driven commerce, various colonial controls were imposed on forests in Bangladesh and across Asia.\nBangladesh's forests and genetic resources are continuously subjected to distress and threats. Already, rural forests, sacred groves, swamp forests, and reed forests across the country have been ruthlessly destroyed. Over the past 20 to 25 years, an unchecked trend has emerged, with forests being deliberately set on fire. Although natural forest fires do not occur in Bangladesh, large swathes of forestland and rare genetic resources are lost every year due to \"planned arson.\" The state has yet to take a strong stance or systematic action against forest fires. There is still no ecosystem-based policy, planning, or management framework to address this issue. Environmental organisations, political parties, and citizens remain largely silent on the issue of forest fires. Such neglect and indifference allow the country's \"lungs\" to burn without question. Each year, acts of ecocide occur without accountability. Every year, March 21 is observed as International Day of Forests. This year's theme is \"Forests and Food.\" This article seeks to remind us of the unbearable suffering caused by forest fires in Bangladesh and calls for justice for the forests.\nThe Lawachara wildfire incident\n\nThe largest wildfire in the history of Bangladesh's natural forests occurred on June 14, 1997. This devastating ecocide was triggered by a gas exploration survey conducted by the American company Occidental Petroleum Corporation. The flames consumed vast areas of Moulvibazar's Sreemangal-Kamalganj region, including Magurchhara and Lawachara. In 1996, a 1,250-hectare portion of the 2,740-hectare West Bhanugach Reserved Forest was declared the Lawachara National Park. Lawachara is home to 460 species, including 167 species of plants, four amphibians, six reptiles, 246 birds, 20 orchids, 20 mammals, and 17 species of insects. Since the 1997 ecocide went unpunished, many forest grabbers across the country, including in Lawachara, became emboldened to grab forestland by setting fires. This rainforest is one of the primary habitats of the hoolock gibbon. However, multinational mining operations, American projects, railway and road construction through the forest, corporate hotels and resort businesses have collectively pushed this forest to the brink of collapse. On April 24, 2021, while implementing a forest department initiative, a fire broke out in a section of Lawachara, resulting in extensive damage. In 2023 as well, a fire was deliberately set in Lawachara. On February 26, 2025, nearly two acres of forest were set ablaze in broad daylight.\nThe Bhawal Sal Forest fires\nIn 1886, Frank B Simson in the book Letters on Sports in Eastern Bengal described hunting adventures in the Bhawal Sal Forest. Spanning nearly 65,000 acres in Gazipur, the Bhawal Sal Forest today is frail, shrinking, and plagued by encroachment and pollution. The last recorded sighting of a tiger in the Bhawal Sal Forest dates back to 1940. After Bhawal was declared a national park in 1973, it became home to 220 species of plants, 13 species of mammals, nine reptiles, five amphibians, and five species of birds. Every winter, the Bashtoil Sal forest near Bhawal is deliberately set on fire. The land of the burnt forest is then repurposed for housing, hotels, factories, and other construction. Just before the International Day of Forest in 2023, large areas of the Sal forest in the Goshinga-Patka region of Sreepur, Gazipur, were reduced to ashes by fire. Similar incidents of arson occurred in March of both 2022 and 2021. In 2023, a fire also devastated the Sakhipur Sal forest.\nThe Rangtia Sal Forest fire\nRangtia, located in Jhenaigati upazila of Sherpur, is one of the country's significant sal forests along the border. One of its distinctive features is the presence of various types of flax. This forest is home to approximately 250 species of plants. Ten rare and distinct species of medicinal plants whose roots are traditionally used as medicines grow in this forest. With the dominance of the neoliberal market, Rangtia eventually transformed into a site for China clay and stone mining. Streams, hills, and forests were ravaged in the pursuit of stone trade. The Rangtia Sal Forest houses many sacred trees, holy sites, and groves. However, most of them have been encroached upon. At the beginning of this month, a wildfire raged through Rangtia for an entire week.\nThe Madhupur Sal Forest fires\n\nMadhupur has stood as a prime example of the various forms of oppression and exploitation that can be inflicted upon a forest. In 1950, jhum cultivation was forcibly banned in the Madhupur sal forest area. In 1955, the name of the forest was changed to \"Woodlot Garden.\" 1962, it was declared a national park, and barbed wire fences were erected. From 1989 onwards, invasive trees and rubber gardens replaced the natural forest. Commercial pineapple and banana plantations were later established. The forest department planned to implement an eco-park project in the sal forest, enclosing it with a 61,000-foot-long wall. Meanwhile, Bangalee settlers began to occupy forest lands. Since 2000, various parts of the Madhupur Sal Forest have been set on fire every year to clear the land, which is later used for cultivation.\nThe Sundarbans fire incidents\nAccording to forest-dependent communities, local residents, the forest department, and media reports, the Sundarbans have experienced nearly25 fire incidents between 2002 and 2024. Approximately 72 acres of forest have been directly burned. On March 22, 2002, a fire broke out in the Katka Wildlife Sanctuary in the Sharankhola range of Bagerhat. On March 25, 2004, a fire destroyed three acres of forest in the Chandpai Range. On December 27, 2004, nine decimals of forestland were burned in the Aruarber area. In the past two decades, many such fires ravaged this forest.\nWhenever fire incidents occur in the Sundarbans, we see the forest department making irresponsible statements in the media. When a fire burns parts of a forest, the damage is assessed in a one-dimensional manner, focusing only on the area burned and the volume of timber lost. When a complex ecosystem like the Sundarbans is scorched, can its damage truly be measured merely by cubic feet of lost timber or land area affected? A natural forest is certainly not a timber plantation, a decorative botanical garden, or a zoo.\nThe Rema-Kalenga Wildlife Sanctuary fires\nAfter the Sundarbans, Rema-Kalenga in Habiganj is the largest natural forest in Bangladesh. It was declared a wildlife sanctuary in 1982. In 2023, the authorities of the Hatimara Tea Estate set fire to the forest land they took a lease of intending to expand their tea plantation. They also cut down nearly 140 ancient trees altering the classification of the land.\nThe fire burned down large portions of the Rema-Kalenga Wildlife Sanctuary, killing many wild animals.\nBuilding a discourse of resistance against forest fires\n\nAccording to Bangladesh's existing forest laws, environmental laws, and the Wildlife (Conservation and Security) Act 2012, setting fire to natural forests is a punishable offence. Yet, we have never heard of any exemplary trials or punishments. Despite signing the United Nations Convention on Biological Diversity and the Paris Climate Agreement, the state has failed to prevent fires in natural forests. Although the Tree Conservation Act 2016 was drafted, it has yet to be approved. In 2021, Bangladesh signed the Glasgow Leaders' Declaration on Forests and Land Use to end global deforestation yet the state remains unaware of the extent of forest and tree loss due to fires. Although Article 18(A) of the Constitution declares the protection of forests and genetic resources as a state responsibility, we are yet to see effective measures to safeguard forests from fires.\nNatural forests do not catch fire spontaneously; such incidents are often caused intentionally. Firstly, the forest department and state authorities must recognise and address this issue. Negligence is unacceptable—each incident of fire must be responsibly addressed. Every fire should be investigated, and those responsible must be brought under the law. Following a fire, the forest department should organise visits involving all relevant stakeholders. Based on the input from the community and others, a forest management plan can be developed. Immediate efforts must be made to extinguish the fire during such incidents, with active involvement from the community. Assessing the damage should prioritise the natural and cultural aspects of the forest.\nTo establish short, medium, and long-term forest management, the forest department and related authorities must cultivate a culture of public dialogue about the country's forests, ensuring that the opinions and suggestions of citizens from all classes, professions, genders, and ethnic groups are understood and considered. The commercial narratives about forests must change. The traditional knowledge and forest management practices of forest dwellers, forest-dependent communities, and indigenous peoples are now universally recognised. Their vision and expertise must be regarded as the core strength of the state's forest management. Let a new public discourse emerge to protect natural forests, rooted in the knowledge and narratives of the people, involving everyone.\nPavel Partha, an ecology and biodiversity conservation researcher, is director at Bangladesh Resource Centre for Indigenous Knowledge (BARCIK). He can be reached at [email protected].\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Let’s begin a discourse of resistance against forest fires",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/lets-begin-discourse-resistance-against-forest-fires-3853881",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "World must act to  stop Israel",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/world-must-act-to-stop-israel-1742569443",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Securing Bangladesh's export sector against fraud",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/securing-bangladeshs-export-sector-against-fraud-1742569486",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Reviving the spirit of Independence Day",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reviving-the-spirit-of-independence-day-1742569535",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "World Water Day and wastage of water",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/world-water-day-and-wastage-of-water-1742569561",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-03-2025"
    }
]