[
    {
        "full_article": "President Donald Trump’s decision to charge new applicants for the H-1B highly skilled non-immigrant visa $100,000, nearly six times the current fee, has caused widespread consternation that not only might the lives of tens of thousands of potential visa applicants in the tech space be impacted, leading to “humanitarian consequences” for families, as mentioned by India’s Ministry of External Affairs, but there will also be widespread disruption among major tech companies in the U.S. that rely on hiring skilled workers under this visa. While the number of visas issued in this category has been capped at 85,000 per year since 2004, and allocations are decided through a lottery, reports based on U.S. Citizenship and Immigration Services data suggest that applications for the upcoming fiscal year have dropped to a four-year low of nearly 3,59,000. Indian nationals typically account for 71% of these visas, yet data also suggest that close to 60% of these visa recipients earn less than $100,000, which, over the longer term, implies that their employers may find it harder to justify hiring such specialised workers from abroad. The External Affairs Ministry’s response to the White House action included a reiteration of the fact that “Skilled talent mobility and exchanges have contributed enormously to technology development, innovation, economic growth, competitiveness and wealth creation in the U.S. and India”, yet there is limited scope for South Block to apply pressure, diplomatic or political, to get the policy reversed.However, the fallout for Indian citizens can be contained if there is a proactive approach by the Government to bolster India’s infrastructure and undertake necessary reforms to improve the prospects for the Indian tech industry to make even greater strides than it has done so far. This might be achieved by capitalising on opportunities to develop new capabilities in the Artificial Intelligence space and exploring new markets across Asia, including China and Russia, and in parts of Europe, where the transatlantic contagion of nativist protectionism has not yet found willing takers. While the Trump order is set to expire within a year, there is no guarantee that it would not be extended, making it all the more pertinent for policymakers in India to evolve a long-term plan to reduce reliance of Indian tech workers on the shrinking pool of job opportunities in the U.S. economy. As India and other countries adjust to this new reality of the hostility of the Trump White House to welcoming future innovators, job-creators, and tax-payers to their shores, it is the U.S. rather than other nations that will suffer a shortage of scientific and engineering prowess to fuel economic progress. Published - September 22, 2025 12:30 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        immigration\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        business (general)\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        science and technology\n                    \n                            /                      \n                        \n                        engineering\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        Europe",
        "headline_1": "H-1B, maybe: On Donald Trump and the H-1B visa fees hike",
        "headline_2": "India’s tech workers must reduce their reliance on U.S. jobs",
        "link": "https://www.thehindu.com/opinion/editorial/h-1b-maybe-on-donald-trump-and-the-h-1b-visa-fees-hike/article70077214.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "The Centre’s decision to mine uranium at any cost from Meghalaya, after deliberations with local leaders proved futile, is a troubling benchmark in India’s history of resource extraction. Khasi groups have opposed the exploration and extraction of large deposits in Domiasiat and Wahkaji since the 1980s. Recently, the Union Environment Ministry issued an office memorandum (OM) exempting the extraction of atomic, critical, and strategic minerals from public consultation. Local groups have already condemned the OM-based route; one associated with the ruling party has called on the Khasi Hills Autonomous District Council to use its Sixth Schedule powers to protect tribal rights. OMs are executive instruments that erode procedural safeguards and are issued without independent scrutiny. In this case, the OM reduces stewarding communities to bystanders in decisions with profound consequences for them. This is not the first time that the government has moved with force on the matter of uranium. The Uranium Corporation of India Limited has conducted operations in Jharkhand’s Singhbhum district for decades. While hearings for expansion or new mines were met with protests over radiation exposure and loss of livelihoods, villagers have also alleged that the Corporation issued notices in unfamiliar languages and disregarded objections. For tribal communities, the experience has reinforced the perception that their land remains a ‘resource frontier’ for the ‘Rest of India’.In its conversations with the local leaders, the state should have respected their refusal, but has instead signalled that ‘no’ is no longer an acceptable answer. Uranium mining is highly polluting and can irreversibly alter the landscape. This is why free, prior, and informed consent, as under global norms, is essential. If such consent is unavailable, it behoves the same state that instituted the democratic protections to stop treating uranium as the only route to national security or development and to weigh other deposits, substitutes or even power-generating strategies. Now, the communities might consider challenging the OM’s validity in courts, banking on precedents such as Niyamgiri (2013), and invoking protections under the Fifth and Sixth Schedules. Second, the Ministry must withdraw its OM: by exempting the mining of several minerals from public consultation, it sets a precedent that can reshape mining governance across India. Finally, if local protests intensify, the Centre should once more respond with dialogue: coercion, while achieving its goal in the short-term, will only breed resentment later. It is obligated not only to maintain order but also to ensure that constitutional protections are realised in practice. Published - September 22, 2025 12:15 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        mining\n                    \n                            /                      \n                        \n                        Meghalaya\n                    \n                            /                      \n                        \n                        minerals\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        pollution\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        tribals",
        "headline_1": "Uranium unrest: On uranium mining in Meghalaya",
        "headline_2": "Resource extraction projects should have the people’s consent",
        "link": "https://www.thehindu.com/opinion/editorial/uranium-unrest-on-uranium-mining-in-meghalaya/article70077165.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "In which all members munched seriously\nHaving recently been inducted into one of the newly formed book clubs in town, I felt I had arrived! We were meeting in a fortnight. Meanwhile, the matter of the book had to be settled. What was it going to be? Mystery? Thriller? Horror? Romance? Science fiction? Fantasy? Dystopian? Magical Realism? \nWhatsApp messages flew fast and furious. Suggestions – some with book covers, some without – poured in faster than one could read them. Each time a proposal was put forward, other group members went on an overdrive with their views. Too long, too boring, font too small…the disagreement was endless. So I came up with the brilliant idea, why don’t we meet over lunch and decide on a book? A date was set. All members arrived with their selected book in tow. This was serious stuff. \nEach person puts forth her views about her choice of book interspersed by cups of hot coffee and finger foods. The protagonist, who is on (munch munch) the run, seems to…(this coffee is nice, have you tried these croquettes? I make them too, but these are different), what was I saying? After about half an hour the waiter comes with the menu and all the members take a well-deserved break to discuss the pros and cons of the various dishes animatedly.\nAfter almost another half hour the order is decided and everyone sits back satisfied. Was the book discussion completed? Or was it to continue after lunch? I hadn’t a clue, and frankly, I don’t think the others had either. By now the conversation has shifted to the children, grandchildren and gardens…in that order.\nWith lunch served, the chatter settles into soft murmurs plus the clinking of the forks and spoons. Then it is time for a dessert conference, then the bill. Dividing the amount by the number of attendees, ‘It’s X amount!’ announces the lady in pink, triumphantly. In another flurry of activity everyone dives into their bags but many don’t have the exact amount so bigger notes are exchanged for smaller ones within the group. Finally, the job is done and the waiter summoned one last time as he is handed over the motley collection of notes (tip included) with a flourish. Everyone gets up to air kiss and say their goodbyes when one voice pipes up, ‘We haven’t yet decided on the book!’\n\n",
        "headline_1": "Book club",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/book-club/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "Assam shows the deep hold of regional pop culture figures on popular imagination \nAssam is in a state of mourning over the death of local superstar Zubeen Garg, who died in Singapore while swimming without a life jacket. The singer, whose songs have enthralled millions in Assam with hits like Mayabini Ratir Bukut, Hiya Diya Niya, and Maya Mathu Maya, was perhaps the most striking figure in Assam’s cultural firmament since Bhupen Hazarika. That a sea of humanity turned up to pay last respects to the singer as his body lay in state shows the deep emotional connect people had with him. In a state with a history of complicated ethnic relations and language politics, Zubeen transcended all divides. He sang in multiple languages, including Bangla, and was a great representative of the Northeast. \nThe popularity of Zubeen also highlights the regional nature of icons in a vast country like India. True, south India has long been a trendsetter, with superstars from the local film industry smoothly making the transition to politics. From NT Rama Rao in Andhra, to MGR, Jayalalithaa and Karunanidhi in Tamil Nadu, these local stars had massive following, bordering on hysteria. But there is no set formula by which popular personalities are elevated to stratospheric stardom. Some are able to ride the zeitgeist of the times and live on in people’s hearts long after they are gone. \nBut the hysteria is also a double-edged sword. Hundreds had committed suicide or died of shock after Jayalalithaa’s death in 2016. When news of Zubeen’s death reached India, many of his fans filed multiple FIRs against his manager Siddharth Sharma and organiser of North East Festival – for which Zubeen had gone to Singapore – Shyamkanu Mahanta, holding them responsible for Zubeen’s death. However, this is more emotional than rational as Singapore authorities have so far not found any foul play, and Zubeen’s wife herself has requested for the FIRs to be withdrawn. Mourning is best done quietly.\n\n",
        "headline_1": "Death Of A Star",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/death-of-a-star/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "Globalisation isn’t dead. But self-reliance, spotlighted in PM’s speech, across sectors is now an urgent necessity \nIt was very much against the backdrop of yet more Trump policy damage to India, that PM addressed the nation yesterday. Both the themes he picked – GST reforms and atmanirbharta – speak to what’s needed to keep our economy robust in the face of global headwinds. \nWith Indians getting almost 70% of the H-1B visas that were issued in 2024, obviously the country will be the one most impacted by a one-time $100,000 fee that exceeds the median annual salary of India’s H-1B visa-holders. This is on the heels of Trump imposing a 50% tariff on Indian exports to US and revoking the Chabahar sanctions waiver. But there’s turbulence from other directions as well, whether it’s China reminding India of its rare earth vulnerability or Europe also taking an anti-immigration turn. Deep and wide as different countries’ economic ties still remain, clearly a new phase of globalisation is now underway, where India really has to watch out for itself in a way that’s perhaps never been needed since Liberalisation 1991.\nAs Modi reminded yesterday, we have gotten out of the habit of thinking whether or not the comb in our pocket is Indian-made. It’s also true that India’s large domestic market is what provides relative resilience to external shocks. The test of GST reforms as they become operational today will be what savings they pass on to consumers, and thus spur demand, but they’re definitely in the necessary direction. As for meaningful movement in the direction of atmanirbharta, that will, again as Modi’s speech underlined, need Centre and states to work together. States governed by different political parties will need to act in concert. \nFrom chips to rare earths to pharma to defence…India’s dependencies in sector after sector are all traceable to its abysmal R&D ecosystem. The private sector has shown a confoundingly poor appetite for this spend. So, pretty pledges aside, GOI has to ensure something fundamentally shifts in the research and innovation space. This is what govts of China, South Korea and Taiwan got right and India must as well. External uncertainties leave us no other option. It’s possible that the H-1B visa will see India benefit through more GCCs expansion. But it’s not impossible that MAGA’s crusade for tariffs on services succeeds, flooring even this opportunity. Shifting global sands call for India to keep Plans B, C and D…ready. It has to create, build and deploy more nimbly than it ever has.\n\n",
        "headline_1": "Hello Swadeshi",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hello-swadeshi/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "America’s tense politics post-Charlie Kirk is in part centred around gun rights, which are sanctified by a Constitution largely frozen in time. India’s Constitution is more responsive to changing society because it’s easier to amend. That’s a plus as long as politics is responsible\nThe shooting and death of right-wing commentator Charlie Kirk in US has rightly drawn widespread condemnation.\nViolence in any form is unacceptable in a democratic society.\n\nYet, once the immediate outrage passes, the episode also offers an opportunity to reflect on a deeper structural issue: the way constitutions, by their design, can lock nations into paths increasingly out of step with contemporary realities.\nRead the full story on TOI+.\n\n",
        "headline_1": "Us & US: Taking a constitutional",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/us-us-taking-a-constitutional/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 22, 2025 00:00:00  \nEconomists often describe innovation as the key driver of economic growth, and rightly so. While land, labour and capital have long been considered the fundamental inputs of production, it is innovation that transforms these resources into engines of prosperity. From the steam engine of the industrial revolution to today's artificial intelligence tools, innovation has consistently expanded the boundaries of what economies can achieve. In this context, it is disheartening that the common people of this country, by and large, hardly innovate, even though they are quick to adopt innovative technology and outputs from elsewhere. Social media, AI, and other technologies that make life easier have been embraced here with remarkable speed. The ready-made garment (RMG) industry, the backbone of the country's economy, illustrates another glaring failure in innovation. Although the RMG sector is the second-largest exporter of garments in the world, it has remained largely a stitching hub, with product designs supplied by foreign buyers. Moreover, as the sector lags in innovation, it continues to export primarily low-value apparel items and has so far had little success in moving into the high-end market.\nThe country's poor track record in innovation has once again been reflected in this year's Global Innovation Index (GII) prepared by the World Intellectual Property Organization (WIPO). Although Bangladesh has climbed from the 116th position in 2020 to 106th in 2025 among 139 countries, it still remains one of the least innovative countries in the world. For a country that spends less than two per cent of its GDP on human capital development, this outcome is hardly surprising. The ranking reflects Bangladesh's chronic inability to nurture ideas, resulting in a society that thrives on imitation and shows little appetite for innovation. Deprived of opportunities to spread their wings, many creative minds have left for foreign shores - where Bangladeshi scientists, educators, innovators and artists are making their mark. The question, then, is: if Bangladeshis can flourish abroad, why not at home?\nBringing innovation to fruition requires an idea-friendly environment. Such an environment depends on an education system that fosters curiosity and scientific rigour, infrastructure that facilitates learning and an economy that enables new businesses to grow. Unfortunately, in Bangladesh, investment in research, development and education has never been a priority. How, then, can we expect innovation to take root in this soil? Capital, too, is essential to transform great ideas into real-world enterprises. Yet in Bangladesh, start-ups are often starved of funds. By contrast, countries at the top of the GII rankings - such as Hong Kong - have developed robust financial ecosystems, offering diverse channels of funding through angel investors, venture capital and private equity at every stage of growth.\nBangladesh, however, holds a distinct advantage that few nations can claim: its vast youth population. Nearly 65 per cent of the people are of working age. This demographic dividend could be a powerful driver of growth, if properly harnessed. If Bangladesh aspires to climb the development ladder, it must urgently invest in human capital to build a knowledge-based economy. With the right skills and education, young Bangladeshis could infuse the much-needed dynamism across all sectors and accelerate economic growth by creating high-value products and services.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "When innovation  is not a priority",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/when-innovation-is-not-a-priority-1758466275",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       September 22, 2025 00:00:00  \nRepeated warnings by medical scientists and numerous studies conducted both by international as well as local research bodies have more than once come up with stark reminders against the dangers of improper, excessive and non-prescribed use and over-the-counter (OTC) sale of antibiotics. Still worse, indiscriminate use of antibiotics in poultry, fish and veterinary feeds has greatly compromised the potency of the anti-microbial drugs. According to a study, some 12 common antibiotics proved ineffective against common diseases like diarrhoea, urinary tract infection, lung infection and treatment of various wounds. A study conducted in 2016 by a pro-environment body Poribesh Bachao Andolan (Proba) found that 56 per cent of the antibiotics prescribed for patients in Dhaka proved mostly ineffective as the microbes had grown resistant to antibiotics. The situation has hardly improved since then. On the contrary, it has only changed for the worse. However, it is not only in Bangladesh, globally, too, the picture is rather grim. A 2014 review commission by the UK government in a report titled, 'Antimicrobial resistance: Tracking a crisis for the health and wealth of nations' in a broad brush estimate forecast that a continued rise in antimicrobial resistance (AMR) might lead to 10 million people of the world dying every year by 2050 and a reduction of 2.0 per cent to 3.5 per cent of global GDP. That would cost the world to the tune of US$100 trillion. Of the people to die annually due to AMR, Bangladesh will have also its share, thanks to unchecked use of antibiotics taking advantage of the lack of blood culture facilities at the district-level hospitals and clinics. Add to that the aggressive marketing policy of drug companies which is largely behind the rampant use of antibiotics despite the stern warnings issued by concerned study and research groups against the hazards such abuse of antibiotics pose to public health.\n\nThe National Antibiotics Resistance Survey was conducted between 2017 and June 2023. The Institute of Epidemiology Disease Control and Research (IEDCR) released the alarming findings of the study. Over the five years that the study was conducted, antibiotic resistance in the country increased by 11 per cent, while the efficacy of some commonly used antibiotics decreased by up to 82 per cent in 2023 compared to 71 per cent in 2022. In fact, antibiotics resistant bacteria have been proliferating at an alarming rate in the country. But as no new class of anti-bacterial drugs or antibiotics have been developed during the last three decades or so, doctors have to make do with whatever they have in hand to treat patients suffering from bacterial infections. Doctors are concerned that it is becoming difficult to save lives during surgery since, for instance, cephalosporin, a broad spectrum of bactericidal antibiotics, is becoming resistant to bacteria. But when it comes to the case of multidrug-resistant tuberculosis among surgery patients, it is really a crisis situation they face. It is against this dreary background that the International Centre for Diarrhoeal Disease Research, Bangladesh (icdr,b), recently revealed that there has been widespread colonization by drug-resistant pathogens in Bangladesh. And newborns are being colonised at alarming rate by such dangerous pathogens. Here, colonisation refers to the presence of bacteria in or on the body without causing any immediate disease. But these bacteria can spread and later trigger infections that are extremely difficult to treat.\nAs the study report further goes, 81 per cent of the newborns in neonatal ICUs were colonised by Klebsiella pneumoniae which is resistant to the drug carbapenem. Notably. Carbapenem is a powerful broad spectrum antibiotic used against serious bacterial infections that have not responded to other treatments. So, consider the danger the newborns are exposed to as they have practically no treatment against the drug-resistant pathogens, which the newborns acquired from hospital. Similar colonies of drug-resistant bacteria were found in adult ICUs and at the community level raising infection risks and prolonging hospital stays. The Antimicrobial Resistance (AMR) Research Unit at icddr,b presented the findings of the multi-country 'Antibiotic Resistance in communities and hospitals (ARCH)' study. The ARCH study is the first one to systematically investigate colonisation of AMR pathogens in both communities and hospitals. In this connection, the ARCH 1.0 was conducted in 2019 which detected high levels of resistant bacteria among both healthy individuals in communities and hospitalised patients. Extended-spectrum cephalosporin-resistant Enterobacterales (ESCrE) variety of bacteria were found to be highly prevalent in both communities (78 per cent) and hospitals (82 per cent). To note, Enterobacterales is a group of bacteria that can colonise the gut of healthy individuals without causing infection. ARCH 2.0 study, on the other hand, highlighted critical risks of newborns and ICU patients. In NICUs, 81 per cent of the babies were colonized with carbapenem-resistant bacteria. \nThe prospects look desperate. How are the health professionals going to face the new challenge of colonisation of both newborns and adults in hospitals as well as in the community by drug-resistant bacteria? The good news is that the ARCH study showed that infection prevention and control (IPC) interventions, such as strengthening health hygiene among healthcare workers and improving environmental cleaning can substantially reduce colonisation with resistant organisms and lower bloodstream infection in NICUs. In fact, it is the senseless use of the anti-bacterial drug that brought things to such a pass. Until scientists are able to break new ground in developing a new class of antibiotics to fight these antibiotic-resistant superbugs, public health will be facing a big challenge here at home as well as globally.\nBut until the crack of that new dawn in medical research, it is going to be the phase of managing with existing resources in dealing with public health. In that case, the government will have to strictly control the use of antibiotics. Strict monitoring should be mounted so the drug stores may not sell antibiotics and other critical drugs without prescriptions. Another issue the public health authority will be required to give serious attention to. Many of the drugstore operators are also not registered compounders. But they prescribe medicines. The poor, unlettered working maids and day labourers are their customers and even patients. There should be a nationwide crackdown against these drug-sellers doubling as doctors and other quacks across the country. Last but not least, the drug companies need also to respond to the public health concern of the nation.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Antibiotics' losing battle against microbes!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/antibiotics-losing-battle-against-microbes-1758466625",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       September 22, 2025 00:00:00  \nOld habits die hard. A section of the bungling bureaucracy inherits this element much like people naturally inheriting the deoxyribonucleic Acid (DNA) from their ancestors. Or, how could the public administration ministry submit a proposal for purchasing luxury cars for the cabinet ministers who would take over following the next election slated to be held early next year? What is particularly intriguing is that the first such proposal placed for consideration was rejected by the finance ministry in the face of public outcry. This time the proposal for procurement reportedly of the sport utility vehicles (SUVs) made is even more outrageous because of much higher expenditure on those cars.\nThe local chapter of the Berlin-based Transparency International has rightly questioned the motive that has prompted the ministry concerned to raise an issue quite irrelevant right at this moment. At a time the implementation of the annual development programme (ADP) is the lowest in 15 years with 12 ministries and divisions reportedly failing to spend a single taka in the first month of the current financial year, this bureaucratic overture targeted to appease future ministers smacks of cronyism that became a deplorable hallmark of mutual collaboration between the cabinet and the civil service during the past regimes. In the past turbulent year, the expenditure stood at 49.08 per cent of the revised ADP outlay.\nThis is understandable but this year is different. Planning Adviser Wahiduddin Mahmud also expressed his displeasure, saying, \"This year, things should be moving fast. Last year's excuses should no longer apply\". Had a reasonable portion of the ADP allocation been spent on infrastructure development and projects, employment would get generated.\nSure enough, there are more pressing issues such as the law and order situation, setting reform agenda as much as the interim government can do and creating conditions for holding a free, fair and peaceful election. Austerity also emerges as a most viable option for the government. High inflation has been forcing more people of the lower segments of society to move below the poverty line. Rising unemployment is also taking its heavy toll. \nContrary to people's expectation of exemplary short-term measures with potential broad-based adoption by the next elected government, the civil servants feel no qualm about raising and extending the privileges of people in power at the expense of the common people. The interim government is also to blame for its overreliance on the bureaucracy. If the July-August uprising did not elevate itself to a revolution with specific agenda stipulating people-oriented socio-economic programmes, it had given ample opportunities to dismantle the bureaucratic stranglehold in favour of a welfare state.\nHowever, the radical reforms that envisage the well-beings of the common people have been missing ever since the interim government took over. Privileged coteries ---both civil and military ---were in charge of the fluid situation and the student leaders who spearheaded the uprising now seem to have lost the steam. They have failed to bring about a manifesto spelling out the salient features of their demand in order to protect and preserve public interests.\nThis explains why the bureaucracy can dare take an elitist approach and brazenly propose purchase of luxury cars for would-be ministers. The TIB has roundly condemned this move and even rightly asked for an investigation into this overenthusiastic appeasement ploy in advance. TIB Executive Director Iftekharuzzaman has also raised the legal provision in this matter. He has categorically mentioned, \"The type of transport a minister is entitled to is clearly stated in Section 6 (a) of The Ministers, Ministers of State and Deputy Ministers (Remuneration and Privileges) Act, 1973\". A minister is given a car for round-the-clock use but not the luxury type of Toyota Land Cruisers. This is in violation of the law of the land. Those behind the move should be identified and made accountable for initiating the move not once but twice.\nThe civil servants have time and again proved they are not amenable to any new idea; instead they are habituated to defending their old colonial tradition no matter if people's rights are sacrificed in the process. It is time they changed themselves to rise up to people's expectation.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Luxury cars for future ministers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/luxury-cars-for-future-ministers-1758466692",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 22, 2025 00:00:00  \n\n The story of Swamibagh is a mirror of our city. Every morning begins like a battlefield. Residents open their doors with hope, only to find broken roads, piles of bricks and sand, and a muddy deadlock created by rain. In the name of development, the path meant to bring comfort has become a pit of suffering.\nDhaka's Swamibagh today resembles a laboratory-demonstrating how development work can paralyse daily life. The only lane connecting people to the main road has been swallowed by bricks, sand, and iron rods. Everywhere lie construction materials, making residents captive. Sidewalks have been taken over by tin shacks for workers and storage, leaving no space for pedestrians. Even light rain turns the road into a swamp of mud and stagnant water, spreading foul odour. Women, children, and the elderly now walk in fear.\nThe severity becomes clear on a closer look. Residents complain that no one cares about their suffering. This narrow lane was once their lifeline-for school, college, offices, groceries, or rushing to a hospital. Now it is a symbol of paralysis. Office workers fail to reach jobs on time, students arrive late to class and ambulances face uncertainty in entering this clogged and muddy path.\nDaily life has become precarious. An old man with a grocery bag struggles to balance himself through the sludge. A schoolgirl, her white uniform stained, searches for a dry spot to step. To outsiders these may seem minor inconveniences, but for locals they mean constant stress, fatigue and helplessness.\nThe causes reveal the chronic sickness of urban management. Development projects start without proper planning. Timelines, alternative routes, or resident mobility rarely feature in blueprints. Once work begins, supervision is weak; contractors abandon sites while locals count their days in misery. Most importantly, the voices of ordinary people are ignored. Where they will walk, how much hardship they bear-these concerns hardly matter.\nSwamibagh's struggle is not an isolated incident but a reminder of how urban development without accountability turns citizens' lives into a daily ordeal.\nMD. Rished Ahmed\nSwamibagh, Dhaka\nmdrishedahmed@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Swamibagh's only exit sealed by construction",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/swamibaghs-only-exit-sealed-by-construction-1758466712",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-09-2025"
    }
]