[
    {
        "full_article": "February’s sharp rise in the monthly services Purchasing Managers’ Index (PMI), to 59, has provided a welcome relief to investors and policymakers, following the rise in GDP growth numbers, released by the National Statistical Office (NSO) for the December quarter of the current fiscal (Q3FY25). The strong rebound in the services PMI, up from 56.5 in January, which marked a 25-month low, helped offset the decline in the manufacturing PMI, which fell to a 14-month low of 56.3 in February. A PMI reading above 50 signals expansion, while anything below this indicates contraction. The PMI survey, conducted every month by S&P Global across over 40 countries, is a key indicator of economic momentum. The fact that manufacturing and services — sectors that have accounted for about 80% of India’s GDP since 2010 — remain in expansion mode is positive. This resilience persists despite capital outflows from Indian markets, suggesting that the country’s economic fundamentals remain strong. A more telling indicator of long-term economic strength is the quarterly earnings of the Sensex, India’s benchmark index comprising 30 of the most valued and actively traded companies on the Bombay Stock Exchange (BSE). The Q3FY25 results point to solid net profit growth for nearly all firms.However, looming economic risks remain. The threat of reciprocal tariffs announced by United States President Donald Trump, and set to take effect on April 2, poses a challenge for the manufacturing sector. Meanwhile, the services sector is facing a different disruption: the rapid pivot to artificial intelligence (AI)-driven solutions. While the NSO reported 6.2% real GDP growth for Q3FY25, top executives from India’s leading IT firms have, at an industry event in Mumbai, cautioned that growth in the sector could be as low as 5.1% in FY25, up from 3.8% in FY24. Although this may seem concerning for an industry that has enjoyed a 16% compounded annual growth rate for nearly 25 years, it still represents an increase of $29 billion, bringing the sector’s expected value to $283 billion in FY25. In its 2025 Strategic Review report, NASSCOM has identified geopolitical upheavals and rising tariffs as key challenges. But business leaders at the event attributed much of the slowdown to the disruptive impact of AI, which is reducing earnings from new contracts and reshaping hiring and training practices. India’s services and manufacturing sectors face a triple challenge: rapid technological transformation, increasing global protectionism, and the potential for a U.S. recession. This could have significant repercussions for India, given that the U.S. remains its largest trading partner. To navigate these headwinds, India must urgently diversify its trading base. Published - March 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        economy (general)\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        stock activity\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        Mumbai\n                    \n                            /                      \n                        \n                        computing and information technology\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        trade policy",
        "headline_1": "​Diversify now: On India and looming economic risks",
        "headline_2": "India needs to expand its trading base to overcome global headwinds",
        "link": "https://www.thehindu.com/opinion/editorial/diversify-now-on-india-and-looming-economic-risks/article69303172.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "Earlier this week, Indian Army and Indo-Tibetan Border Police teams rescued 23 workers who were stuck in a rubble of snow and ice, following an avalanche at Mana village, Uttarakhand. Eight workers died in the disaster, which occurred at a Border Roads Organisation construction site that had housed 54 labourers in eight containers. To say that the rescue operation was arduous would be an understatement. The rescue teams worked in a near-continuous 60-hour shift amidst heavy snowfall at an elevation of 10,500 feet above mean sea level. With the roads blocked by the snow, helicopters were used to evacuate those rescued to the Joshimath Army Hospital — five helicopters from the Indian Army, two from the Indian Air Force and one civilian copter. Along with the sheer physical effort expended in the extraction, the rescue operation employed a drone-based detection system to detect the containers that were buried under several feet of snow, ice and rock.Avalanches in the Himalayan States, like the one in Mana, which is among the last outposts in Indian territory and close to the border with China, are not uncommon. Villagers here have historically been ‘winter-migrants’, which means that during the winter months the village is deserted. Coinciding with the ritual closing of the Badrinath temple in November, there is migration to villages lower down, such as Gopeshwar and Jyotirmath, for the winter, with residents returning only when the temple reopens in April or May. This is part of traditional wisdom and has a lot to do with the historical experience of the upper Himalayan stretches being prone to disasters. While these practices may have saved the resident villagers, it still raises the question as to whether the workers — several of them migrants — were adequately aware of the risks of their enterprise. Given the strategic location of the village and the need to develop improved roads for civilian and military access, there will always be a sizeable number of people engaged in activity in regions that are inherently inhospitable and risk-prone. Once disaster strikes, efforts focus on the rescue operation, and once they conclude, there is little reflection on whether preventive measures could have been taken. Avalanches cannot be predicted with precision, but steps can be taken to design containers that are safer to live in and can improve the odds of survival. There is much to learn from the way bomb shelters are imagined or how research stations at Antarctica are designed. All of this requires a greater sensitivity to workers who toil amidst hazards and not merely label these tragedies as inevitable consequences of natural disasters. Published - March 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        mountains\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        avalanche/landslide\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Antarctica\n                    \n                            /                      \n                        \n                        Uttarakhand",
        "headline_1": "​Himalayan tragedy: On avalanches in the Himalayan States",
        "headline_2": "Natural disasters are not very predictable, but their impact can be controlled",
        "link": "https://www.thehindu.com/opinion/editorial/himalayan-tragedy-on-avalanches-in-the-himalayan-states/article69303208.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "Yajnadevam, aka Bharath Rao, is a rare cryptographer – among epigraphists, archaeologists, linguists etc – who can claim to have cracked the code to deciphering the Indus Valley script. The earliest pottery with Indus script symbols dates to 4,000 BCE. Ever since, the Indus script has resisted attempted decipherments.\nMany ancient scripts were deciphered using bilingual or trilingual inscriptions. Champollion’s decipherment of Egyptian hieroglyphics was based on the fact that the Rosetta Stone (found during Napoleon’s invasion of Egypt) had the same Greek names written in ancient Greek and hieroglyphics.\nRead full story on TOI+\n\n",
        "headline_1": "Decoding 6K-year-old language can bury modern myths",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/decoding-6k-year-old-language-can-bury-modern-myths/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "Among the many achievements of G20 under India’s leadership in 2023 was their specific commitment to promote women-led development. This commitment went beyond the general catchall of advancing “women’s economic empowerment”.\nIt signalled an increasing recognition by world’s top leaders that promoting full, equal, effective, and meaningful participation of women in the economy as decision-makers benefits society multidimensionally.\nRead full story on TOI+ \n\n",
        "headline_1": "That sadly uncracked glass ceiling",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/that-sadly-uncracked-glass-ceiling/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "Kiwis are a marvellously different cricket team\nAustralian cricket legend Dean Jones had this to say about the differences between cricket in Australia and New Zealand: “When kids in Australia come back home after playing cricket, their dads ask, ‘Did you win?’ But with kids in New Zealand, it’s always ‘Did you have fun?’” This perhaps explains why Kiwis are the perennial nice guys of cricket. Despite being one of the most consistent cricketing sides, Black Caps have always worn their success lightly. They will again feature in a major ICC final tomorrow as they take on India in the 2025 Champions Trophy decider. India, according to pundits, are favourites. But that won’t bother Mitchell Santner and his men – they have always been unassuming underdogs.\nCricketers across generations will affirm that the Kiwis are just impossible to dislike. Recall how they lost out on winning the 2019 ODI World Cup on a ridiculous boundary rule after both they and England got tied scores in normal time and super overs. Any other team would have thrown a hissy fit. But not Kiwis. For them cricket is not only about winning. New Zealand Cricket actually has a nationwide programme called Smash Play Junior-Tamariki for 5-12-year-olds that promotes fun and values such as honesty, camaraderie and mutual support.\nThus, in a cricketing world where winning and commercial interests powerfully, sometimes toxically, combine, it’s lovely to have a team that plays hard but doesn’t take itself too seriously. And as their 2021 World Test Championship victory showed, nice guys don’t always finish last.\n\n",
        "headline_1": "One for nice guys",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/one-for-nice-guys/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "Blame their aura, clout, performance & inflated stock values\nStarbucks’ new CEO Brian Niccol earned $96mn for four months’ work last year when his US baristas earned only $18 an hour, on average. The hourly differential is mind-boggling. But Niccol is no outlier. The median compensation for S&P500 CEOs touched $16.3mn in 2023. In tandem, the pay gap with ‘median’ employees – suits, not baristas, in Starbucks’ case – also grew from 185 times in 2022 to 196 times in 2023. Nobody doubts that inequality has been growing since 1970s, but why? If it is money-grubbing, how do top managers justify it, Alexander Pepper asks in his book If You’re So Ethical, Why Are You So Highly Paid?\nSome say vertiginous CEO pay merely reflects the decision of market forces. They are not ‘overpaid’ because earning more than they deserve would be inefficient, and free markets hate inefficiency. Others say CEO pay is an example of economic ‘rent’ – they are paid way more than the minimum they would be willing to accept. We’ll come to the first view later.\nSo, how are super managers able to extract economic rent? Is it because they are scarce? When corporate profit zooms under a new CEO – other things remaining unchanged – isn’t it fair to attribute the increase to them? In which case, it would be fair that a part of the increase goes to them. The problem with this idea, Pepper points out, is that profits cannot increase if other things remain unchanged. A new CEO comes in, but workers aren’t enthused, productivity doesn’t change, the product doesn’t get better, no extra effort is put in to sell it…It’s impossible then for sales and profits to zoom. So other things have changed, and the question is, what part of the change is objectively, quantifiably, the new CEO’s contribution? Nobody knows.\nYou may argue that these changes were all due to the CEO. But consider, how can the new CEO of a carmaker, sitting in the HQ, influence customer service at a faraway workshop? There’s a good deal of delegation, and some of the best ideas come from unsung managers down the chain.\nA more plausible explanation – not justification – for soaring CEO pay is that the chiefs are part of rarefied social circles. Pepper says board members feel closer to them than to shareholders, and so are inclined to reward them handsomely. Unlike line workers, with whom salary negotiators feel no affinity, CEOs are insiders. But obliging one of your own has social costs. As worker pay remains stagnant, there’s bound to be some outrage. Firms have a workaround for this – camouflaging executive pay so that only a financial whiz can ascertain the real compensation. For example, a large chunk of CEO pay is delivered as shares, but since it’s not ‘money in hand’, CEOs don’t value it very much. Result: they ask for a lot more of it to feel satisfied, and that inflates the bill.\nComing back to the market forces point of view, let’s say the supply of CEOs is limited, and some of them are significantly better than others. As a firm, how do you attract the best? By offering 10-20% above a ‘normal’ CEO pay, or throwing money to get them at any cost? Pepper says saving money here could amount to being penny-wise but pound-foolish. Nobody wants to look foolish.\n\n",
        "headline_1": "Why even sky isn’t the limit for CEO pay",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-even-sky-isnt-the-limit-for-ceo-pay/",
        "news_paper_name": "The Times of India",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "Although the political landscape in Bangladesh has become more vibrant, with both old and new parties trying to woo the public with their promises, the scope of women's political participation continues to be quite poor. The dominance of men in politics and the absence of any structural changes to address gender discrimination, which excludes women from exercising their political agency, are major deterrents. Furthermore, the unrelenting rise of violence against women—from rape to online sexual harassment—has created an unsafe environment for all women in general, even more so for those with political aspirations.\nAccording to the Human Rights Support Society (HRSS), nearly 12,000 women and girls faced torture and violence in the last five years. During that period, 1,089 women and girls were gang-raped, and 207 were murdered after sexual assault. At least 50 victims took their own lives due to the trauma they had endured. The latest incidents of moral policing, mob violence, and sexual harassment in public spaces targeting women, and the administration's ineffectual attempts to punish perpetrators, have created an even more insecure environment for them. Added to this is the vitriolic online sexual harassment of women, whether they are journalists, activists, political figures, or celebrities, all of which discourage women's participation in politics. And what is most disturbing is the perception of impunity due to the lack of enforcement of laws, which has emboldened perpetrators of violence against women.\nWe are encouraged by the fact that the new student parties have strong women leaders, although their numbers are still too few. These women face the daunting task of not only challenging the inherent male chauvinism of society but also making public appearances and raising their voices in an environment that is quite hostile towards women. The stark difference between women's presence during the July uprising protests and today's political rallies is telling.\nThe interim government must take stern measures to deter groups and individuals who believe they have a license to harass or attack women. Online harassers must also be brought to book. The government, through its law enforcement agencies, must create a safe environment for women in public spaces so that they can freely participate in politics—whether at protests, rallies, or simply walking in the streets without fear.\nWhile security is a basic requirement for women's political participation, structural discrimination and tokenism are major barriers. During the Awami League's rule, women members of parliament were selected for their loyalty to the party rather than their leadership qualities. Without direct elections, the scope for developing effective women leaders was severely curtailed. The Electoral Reform Commission and the Constitution Reform Commission have proposed increasing the number of parliamentary reserve seats for women to 100 (from 50), with all seats filled through direct elections. This is bound to make a significant difference in the capabilities of women members of parliament. However, political parties must also honour the mandatory allocation of at least 33 percent of all committee positions to women—something that has been absent in major political parties. Bangladesh has much to gain from having more women politicians who earn their positions through merit rather than nepotism or dynastic politics.\n",
        "headline_1": "Our democracy needs women",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/our-democracy-needs-women-3842536",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "A woman's right to live a life free of violence is not a privilege—it is a fundamental human right. Yet, for millions of women and girls worldwide, including in Bangladesh, this right is routinely denied and remains out of reach. As one of the most pervasive human rights violations, violence against women and girls not only impedes their potential but also limits a nation's progress, growth, and stability. It is not just an individual tragedy, but a lived reality and a systemic crisis that weakens families, communities, and the society at large.\nIn Bangladesh, the scale of the problem demands our urgent attention. Findings from the recent Violence Against Women Survey 2024 released by the Bangladesh Bureau of Statistics reveal a sobering reality—70 percent of women have experienced at least one form of intimate partner violence in their lifetime, with 41 percent facing such violence in the past year alone. The forms of intimate partner violence surveyed include physical, sexual, economic, and emotional violence, as well as controlling behaviours. Equally concerning is the prevalence of non-partner violence, which encompasses physical and sexual violence. About 16 percent of women reported experiencing non-partner violence from relatives, neighbours, or strangers since the age of 15.\nWe must bear in mind that media reports are just the tip of the iceberg, as violence against women and girls is often silenced due to fear, stigma or lack of support systems. Service providers, civil society organisations, police, and health workers play a crucial role in responding to cases, yet their data only reflects incidents that are reported. The Violence Against Women Survey reveals a staggering 64 percent of survivors never share their experiences. Many believe it is a \"normal\" family matter. This silence is even more pronounced among older women, rural populations, and those facing multiple forms of discrimination. Data from service providers does not capture the scale of violence. The prevalence survey is the closest we can get to understanding the scale of violence against women.\nThe survey reveals that women in disaster-prone areas experience higher levels of violence than those in non-disaster-prone regions—74 percent of women in these areas have experienced intimate partner violence in their lifetime, compared to 68 percent in other parts of the country. The survey confirms what we have long recognised: the climate crisis is not gender-neutral. Disasters intensify existing inequalities, disrupt protection systems, and restrict women's and girls' access to essential services. With inadequate shelters and safety nets, women are at greater risk.\nFurthermore, the survey reveals the intersectionality between gender and age, which deepens the vulnerabilities of adolescent girls. The data shows that married adolescent girls in Bangladesh experience disproportionately high levels of intimate partner violence in the last 12 months, making them the most affected age group. This is, unfortunately, linked to child marriage, which affects nearly half of the girls in Bangladesh who are married before their 18th birthday. The adolescent girls are also highly vulnerable to non-partner violence.\nOne enumerator recalls being alarmed by the extent of violence experienced by older women. \"Honestly, I didn't expect them to face violence at this stage of their lives,\" she said. However, her perspective quickly shifted as she interviewed many older survivors of violence, who perhaps never disclosed their experiences to anyone before.\nEven when survivors do come forward, they encounter several challenges—from social judgments to financial costs. According to the survey, out-of-pocket expenses for legal and medical support likely deter women from pursuing justice or treatment. High healthcare costs, lengthy legal processes, and fear of family backlash all converge to keep survivors trapped in cycles of violence.\nThere is an urgent need to expand survivor-centred multi-sectoral services and break the culture of silence around violence against women. Greater awareness of toll-free hotlines—999 and 109—is crucial as current use is low. ​​Survivors need to have timely, compassionate, and comprehensive access to the Essential Services Package, which includes health, social services, police, and justice sectors. It is equally important to address the root causes of violence against women and harmful practices by investing in women's and girls' empowerment, leadership, education, and economic opportunities along with actively engaging men and boys as allies. By reinforcing legislative frameworks, investing in prevention, and ensuring services are accessible and effective, Bangladesh can move toward a reality where every woman lives free from fear and harm.\nEnding the pandemic of violence against women is not just a moral obligation—it is essential for the nation's sustainable development. There are signs of hope. We have seen communities rally to end violence against women, local councils promote safe spaces, and youth speaking up against violence. The momentum for change is here. It requires sustained collective efforts from government institutions, civil society, development partners, media, and local communities.\nIf more women and girls can safely engage in their communities, schools, and workplaces, Bangladesh will be stronger—both in fulfilling its gender equality commitments and realizing the sustainable development goals (SDGs). This International Women's Day, let us commit to ensuring that every survivor has access to quality healthcare, justice, and dignity. This is very much within reach, only if we act decisively, collectively, and with urgency.\nGwyn Lewis is resident coordinator of the United Nations in Bangladesh.\n\nGitanjali Singh is representative of UN Women in Bangladesh.\nMasaki Watabe is representative ad interim for UNFPA in Bangladesh.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "Combating violence against women and adolescent girls in Bangladesh",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/combating-violence-against-women-and-adolescent-girls-bangladesh-3842321",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "Despite efforts to curb social inequalities, women, and girls worldwide continue to face unprecedented challenges, especially owing to humanitarian crises. And nowhere is this more evident than in the Rohingya camps and surrounding areas of Cox's Bazar. Every visit to these camps and nearby areas—home to locals—reveals the depth of their struggles, with their voices echoing pain, frustration, and desperation for change. During our camp visits, we often come across many women whose words continue to echo in our minds for days. One Rohingya woman once said, \"When confronted with violence, I felt lost and unsure of how to respond or how to protect myself in dangerous situations, which are common in camps.\"\nOnce an integral part of social spaces, fewer women and adolescent girls meet the eye on the alleys in the camps these days because of inadequate protection, especially from gender-based violence (GBV). As such, their exclusion serves as a stark reminder of the psycho-social barriers they face.\nWomen—despite making up half the population in the Rohingya camps and neighbourhoods—continue to face economic exclusion, while restricted mobility further traps them in cycles of hardship. With recent funding cuts, support for the refugees is gradually declining while challenges and struggles are amplifying—especially for the women and girls whose futures are now more uncertain than ever.\nAs we observe International Women's Day this year under the theme \"For ALL Women and Girls: Rights. Equality. Empowerment,\" it is important to focus and prioritise one of the most vulnerable and marginalised groups—the female dwellers of Rohingya camps, as well as the beaches, and hills of the charismatic Cox's Bazar.\nAround 614 million women and girls worldwide live in conflict-affected areas. They are often stripped of basic rights like education, healthcare, and economic independence. As such, about 500,000 women and girls representing about 50 percent of the camp population, and another 200,000 females in the host communities in Cox's Bazar continue to combat systematic barriers.\nDespite being a basic right, formal education remains a privilege for most Rohingya girls, which stifles their potential and narrows their future prospects, in turn compelling them to opt for early marriage for survival. Furthermore, lack of digital literacy and technical skills only deepens their exclusion from the constantly evolving world.\nThe situation is no better for women hailing from the host communities in Cox's Bazar, where drop-out rates remain higher than other parts of the country. During one of the visits to areas where locals reside, we met a teen girl invested in taking care of her siblings. She told us, \"In our village, girls are expected to marry young because our families struggle financially. I had to leave school to help my mother with household work, even though I wanted to study more.\"\nSuch instances compel us to formulate and advocate for sustainable initiatives to improve the overall quality of life of these women and girls, or at least to keep the dream of a just society with well-balanced resources and opportunities alive for the generations to come.\nIncomplete education only marks the beginning of struggles for many girls. Widespread child marriage leads to health risks for most young mothers, with reports accounting for around 47 percent of Rohingya women lacking access to antenatal healthcare services during their most recent pregnancy.\nThe maternal mortality rate being 168 per 100,000 live births at the camps testifies to the urgency of addressing risks. Besides health risks, embracing maternity at such a tender age also restricts their mobility, shrinking their worlds to fit the four walls of their makeshift camp \"homes,\" therefore stripping their decision-making power and chances at financial independence.\nRegrettably, the overall healthcare situation of the country is also considerably dire. Overcrowded facilities struggle to provide essential maternal and child health services while mortality rates remain high due to a lack of skilled birth attendants and basic medical care. Meanwhile, malnutrition is also rampant, as women are often the last to eat in households struggling with inflation amid shrinking aid.\nAgainst the backdrop of all the challenges, violence against women and girls in Cox's Bazar remains an urgent crisis. In the Rohingya camps, one in four women report experiencing GBV, with intimate partner violence being the most common. The presence of armed groups makes the situation even more dangerous, increasing the risks of trafficking and exploitation.\nOn the other end, local women also continue to fight domestic violence, economic dependence, and limited legal protection. Many of them suffer in silence.\nTrapped in the economic limbo amid the absence of legal work opportunities, Rohingya women entirely rely on humanitarian aid.\nLack of vocational training or access to financial services further ensures that they remain poverty-stricken, contributing to the barriers to achieving equality through empowerment.\nAddressing these challenges requires collective action where all actors must dedicatedly work together to create a safer environment for women and girls, enabling them to contribute and develop their potential. Several initiatives can be taken: establishing accredited education programmes for Rohingya girls while expanding free, quality education for the locals; investing in adult literacy programmes; increasing legal aid and awareness facilities while increasing protection measures for GBV survivors; introducing skills-training, financial literacy programmes and income-generating opportunities for locals; and strengthening maternal and child health services.  \nHasina Rahman is country director of International Rescue Committee (IRC) in Bangladesh.\n\nShabira Nupur is head of advocacy and communication at IRC in Bangladesh.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "We must prioritise education, safety, opportunity for women and girls in Cox’s Bazar ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/we-must-prioritise-education-safety-opportunity-women-and-girls-coxs-bazar-3842376",
        "news_paper_name": "The Daily Star",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Information commission needs independence",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/information-commission-needs-independence-1741446256",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Fixing the problems of Islamic banks",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fixing-the-problems-of-islamic-banks-1741446491",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "A major quake striking BD not a remote possibility",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-major-quake-striking-bd-not-a-remote-possibility-1741446553",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Issues with Dhaka Elevated Expressway",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/issues-with-dhaka-elevated-expressway-1741446566",
        "news_paper_name": "The Financial Express",
        "publish_date": "09-03-2025"
    }
]