[
    {
        "full_article": "The growing sophistication of cybercrimes, from “digital arrests” to anonymous, large-scale cross-border scams, has made tackling them both urgent and difficult. Cybercriminals have exploited a security gap wherein user accounts on instant messaging apps remain functional even after the associated SIM card has been removed, using this anonymity to conduct government impersonation fraud. The rampant use of spoofed or tampered IMEI numbers has also made tracking perpetrators nearly impossible for law enforcement. It is perhaps inevitable that the government seeks sharper tools to address these software and hardware vulnerabilities, which explains the Department of Telecommunications’ directives on November 28 and December 1. The first mandates “SIM binding” — ensuring that a user’s account is disabled if the physical SIM is removed. In the second, smartphone manufacturers must pre-install the Sanchar Saathi app to verify device authenticity in all new devices by March 2026. While the first directive is a security patch which could inconvenience WhatsApp/Internet messaging users, the second is reminiscent of the saying, the road to hell is often paved with good intentions. The solution to the problem of counterfeit handsets and spoofed IMEI numbers is a cure that could potentially be more damaging than the disease.The explicit instruction in the directive that the app is “readily visible and accessible to the end users at the time of first use or device setup and that its functionalities are not disabled or restricted” would mean that this app will be given a higher security clearance within the phone’s operating system, allowing it more intrusive access to features such as camera, phone or SMS access. The potential for misuse of this app for state surveillance and being utilised by a malicious entity after compromise to target millions of users is very present and clear. This is no empty fear considering what the Union government has done with the use of Pegasus software to target the political opposition, journalists and activists. Notwithstanding Union Minister Jyotiraditya Scindia’s clarification that users could delete the app, the directive’s text mandating that it cannot be disabled suggests that it will function more as a Panopticon and less as a simple verification tool. As the Supreme Court’s K.S. Puttaswamy (2017) judgment established, any state intrusion into privacy must satisfy the tests of legality, necessity, and proportionality. The government already possesses less intrusive means to verify device genuineness. The Sanchar Saathi web portals, SMS-based checks, and USSD codes should suffice. By ignoring these less invasive alternatives, the directive on Sanchar Saathi fails the proportionality standard. It is little wonder that privacy-conscious manufacturers such as Apple have reportedly refused to comply with this order. Published - December 03, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        cyber crime\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        mobile phones\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        telecommunication service\n                    \n                            /                      \n                        \n                        PDAs and smartphones\n                    \n                            /                      \n                        \n                        security\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        Pegasus surveillance\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Supreme Court",
        "headline_1": "Zero stars: On the Sanchar Saathi app",
        "headline_2": "Mandating Sanchar Saathi app to tackle cybercrime is an overkill",
        "link": "https://www.thehindu.com/opinion/editorial/zero-stars-on-the-sanchar-saathi-app/article70349952.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "The last few days have shown just what a roller coaster of a ride India’s economic data can take. Last Friday’s robust Q2 GDP growth, a six-quarter high of 8.2%, lifted the government’s mood and brought cheer to its supporters. The relatively low nominal growth rate and grade by the IMF did little to dampen this feeling. However, the latest data on the Index of Industrial Production (IIP) and, to an extent, the manufacturing PMI are likely to do more in that regard. The IIP’s growth in October 2025 was just 0.4%, a 14-month low. While the GDP data for the July-September quarter showed the manufacturing sector growing 9.1%, the IIP showed the sector had slowed to a 14-month low of 1.8% in October. One of the possible reasons for this is that the GDP growth rate was boosted by a low base, since the sector had grown just 2.2% in the July-September 2024 quarter. The other, more troubling reason, is the impact of the U.S.’s tariffs. Merchandise exports grew in September, the first full month of 50% tariffs, as earlier orders were being fulfilled. They then contracted nearly 12% in October as the tariffs began to weigh on new order decisions. The PMI data, too, showed that the score for India’s manufacturing sector stood at a nine-month low of 56.6 in November. The report specifically mentioned that new export orders rose at their slowest pace in over a year, another sign that the U.S.’s tariffs were hurting.While subdued exports likely weighed on the manufacturing sector, the change in weather towards winter and prolonged rains pulled down the electricity and mining sectors, respectively. As a result, the primary goods sector contracted in October. The GDP data had shown that investment had grown by a reasonably strong 7.3% in Q2. However, the IIP data suggest this could have slowed in the beginning of Q3 with the capital goods sector growing at a 14-month low of 2.4%. The IIP data also have some concerning news regarding household consumption. The GDP data showed that Private Final Consumption Expenditure grew at nearly 8% in Q2. However, the IIP showed that the consumer durables and non-durables sectors contracted in October, in aggregate their worst performance in two years. This was the first full month of data following the GST rate rationalisation. GST revenue of ₹1.7 lakh crore in November, reflecting economic activity in October, also shows that demand did not come rushing in as fast as the government would have liked. Taken together, multiple initial metrics are indicating that Q3 is not likely to be a cheerful quarter for the economy. Published - December 03, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        weather\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        mining\n                    \n                            /                      \n                        \n                        consumer goods",
        "headline_1": "​Speedbreakers ahead: On India’s economic data",
        "headline_2": "The third quarter is unlikely to bring cheer for the economy",
        "link": "https://www.thehindu.com/opinion/editorial/speedbreakers-ahead-on-indias-economic-data/article70349466.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "Social media makes money by algohacking many human brains. Contrast that model with responsible media’s \nAnger can be a useful emotion. It can play a key role in building a strong individual psyche, as also a  just society. But the algohacking of our brains to keep them in a state of incessant anger? That’s pure poison. Some companies and individuals draw colossal profits from it, but at terrible cost to general well-being. That rage bait has been declared Oxford’s word of 2025 is indicative of the spread of this poison. In 2024, it was brain rot that came on top. Both speak of the same diseased online ecosystem. Enshittification is another name for it, given by Cory Doctorow. Attention deficit epidemic, is how Jonathan Haidt annotates it. All of this is bad enough for adults, but what it’s doing to children is a great nightmare. \nSpecifically, rage bait refers to online content designed to elicit anger or outrage. Once tech platforms figured out how this kind of content spirals user engagement, the algorithms got tweaked to feed us more and more of the same, activating a diabolical incentive structure of hate. Of course, in this swamp, reality is completely distorted. You could take any major event of recent times as an example and the difference between your newspaper’s reportage and your online feed would be dramatic. Reading responsible accounts of pollution, terror attack, election result…would give you food for thought. On social media, you would be targeted with stuff doctored to send you into troll mode. \nIf you block the accounts that most inflame you, you deprive them of your attention, you refuse to buy the hate they are selling. Blocking even hurts them with the algorithm. David did defeat Goliath. And make no mistake, this is a civilisational battle. We must fight against the atrophy of our attention, its capture by the most terrible types of things that human nature can be drawn to, to regain our sense and sensibility. \n\n",
        "headline_1": "Baiting With Rage",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/baiting-with-rage/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "Govt should put Sanchar Saathi in app stores, keep improving it & let users decide whether they want it on their phones\nGovt’s clarification that Sanchar Saathi app is not mandatory for new phones may reassure buyers, but the matter doesn’t rest there. Phone makers, almost all of whom are foreign-based, still have to deal with the original order’s ramifications. Reports say Apple has already refused to preload the app on its phones, others are pondering. \nIn hindsight, this controversy was avoidable. The Sanchar Saathi portal launched in May 2023, followed by the app. Govt has been spreading awareness about both via text messages, and they already have many millions of users, no doubt attracted by their success in tracing lost or stolen devices. It could have let the app grow organically, rather than order its compulsory installation on all devices. Or, it could have held public consultations with users, privacy groups and industry before taking a decision. \nThat said, making govt apps mandatory outside an emergency is not a good idea. Phones are our private space, and one mandatory intrusion by govt raises fears of more in the future. Covid justified the Aarogya Setu mandate before the population was vaccinated, but it was only required for accessing public places like airports and railway stations. Is Sanchar Saathi a similar crisis intervention? No. Then, let’s not make it compulsory. Place it in App Store and Google Play, go on improving it, but let users decide whether they want it. \nPhone manufacturing has been one of India’s bigger post-pandemic success stories. In value terms, it more than doubled in just four years, and exports grew nine-fold. To remain on this trajectory, more investments are needed, but jarring orders like this can be discouraging. Industry – especially foreign investors – is never comfortable with the feeling of overreach. Recall what happened when India tried to spur local manufacturing of laptops and tablets in Aug 2023, by announcing import curbs with immediate effect. But as firms stopped shipments, it deferred the curbs a day later, and withdrew them in Oct. Yet, big brands like HP have grown manufacturing capacity in India over the past two years, without govt pressure.\nLikewise, people will adopt Sanchar Saathi in growing numbers when it fulfills a compelling need. It’s good that govt has built infra to prevent cybercrime, equipping it with a supercomputer and AI. But it should be patient with Sanchar Saathi’s growth, and withdraw the order mandating its installation completely. \n\n",
        "headline_1": "Call Back",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/call-back/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "From being a poor man’s food, the fruit has gained celebrity status in the culinary world \nIt was a green gooey glob in the salad bowl. And it tasted like manna from heaven, with a subtle savour and a texture smooth as ingestible velvet, creamy as a word composed exclusively of vowels with no angular consonants. \nBunny and I were in a small eatery in Acapulco, Mexico, and were tasting guacamole for the first time ever. \nGuacamole, the signature sauce of Mexico, used to garnish salads, or as a dip for tacos, or spread on a chapati-like tortilla, is made of mashed avocado with a little salt, lime juice, onions, jalapenos, and coriander added. \nWe’d never encountered an avocado before and its buttery succulence was a revelation to us. That was back in the 1980s and avocados were unheard of in India, or at least in North India. \nWe didn’t know that a type of avocado known as ‘butter fruit’ was common in South India, generally eaten with a sprinkling of sugar. Tasteless and mushy, it was dismissed as a ‘poor man’s’ food. \nBut shortly after the turn of the millennium India awakened to the appetising delights of the avocado. No one’s quite sure how it happened. Did a celebrity chef in Mumbai or Delhi put it on the bill of fare? Did a Bollywood superstar endorse its exquisite edibility? \nWhatever the cause, suddenly imported avocados, with their pale gold flesh, as mellow as winter sunshine, brought from as far afield as South America and Africa became status symbols like the latest model mobile phone, and the fact that their cost almost approximated that of such a device only added to their desirability. \nAnd now, cashing in on this wonder food that lowers cholesterol and BP, improves eyesight and skin tone, farmers in Gujarat, MP, Coorg, and Mizoram are growing avocados from foreign transplants brought into the country, and are selling them at a fraction of the price of the imported fruit. \nThe abundance of home-grown avocados has reportedly resulted in avocado dosas, tikkis, gol-gappa stuffing, achaar, et avocado alia.  \nAnd soon – who knows? – in kindergarten schools A for Apple might be replaced by A for Avocado…\n\n",
        "headline_1": "Avocado a la carte",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/avocado-a-la-carte/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "Personality, prosperity, destiny – number plate says it all\nNumbers once lived quiet lives on calculators and report cards. Now, they ride proudly on bonnets and bumpers, announcing identity with more conviction than any business card or biography. Every civilisation eventually finds a new altar at which to worship. Once it was fire, then it was gold, later it became Wi-Fi, and now, in our endlessly inventive India, it is the humble number plate. What was once the ID of the car has now become the identity of the individual. A number now does not merely identify your vehicle. It interprets your personality, your prosperity, and possibly your karmic horoscope.\nLast week, this worship reached its zenith when HR 88 B 8888 sold for a gravity-defying ₹1.17cr. There was a time when a number mattered only in two scenarios: exam results and cricket scores. A ‘lucky number’ meant wearing jersey No. 9 to the cricket stadium or buying a ticket ending in 3. Today, however, the number has ascended to a plane once reserved for gurus, gemstones, and IPO listings.\nWhy this zeal for digits? Because we have always been a nation that believes numbers tell stories of luck, of lineage, of latent potential. The only surprise is that it took us until 2025 to realise that these sacred symbols could also tell the world our net worth.\n8888 is so symmetrical it could calm a raging algorithm. Numerologists insist that 8 radiates power, ambition, and prosperity. Sceptics note it also resembles two neatly stacked laddus. Either way, India is merely joining a global pilgrimage. Dubai auctions plates for sums exceeding ₹120cr. Countries with mature vanity-plate cultures, like UAE and UK, treat plates as collectible assets. But India adds something uniquely its own: numerology, aspiration, sentiment, and a faint hope that symmetry might soften destiny.\nIn the end, perhaps a ₹1.17cr number plate says less about extravagance and more about evolution. The world changes; status symbols shift; aspirations adapt. And as long as humans crave meaning, we will continue to find it in stars, in symbols, and now, in sequences of eights. And in a country where we refuse to start a journey without checking the muhurat, why wouldn’t we want destiny engraved on metal? So, the next time you see a car glide past bearing a number that looks more curated than a museum exhibit, remember: it isn’t showing off. It is simply expressing its numerological truth.\n\n",
        "headline_1": "What is in a number",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/what-is-in-a-number/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "Bangladesh is facing one of the most substantial declines in marine fish stocks in its history. According to a new comprehensive fisheries survey, the stock of small pelagic species in the Bay of Bengal has dropped by a staggering 78.6 percent in just seven years—from 158,100 tonnes in 2018 to only 33,811 tonnes in 2025. This collapse follows earlier warnings, including the 2019 Department of Fisheries assessment, that categorised several species, such as tiger shrimp, Indian salmon, and large croakers, as severely depleted. Overfishing remains the central driver of this transformation: the number of commercial trawlers has nearly tripled since the mid-1980s, from around 100 to 273, putting heavy pressure on the bay's fragile ecosystem. Officials and surveyors caution that the shrinking number and size of commercially important species reflect a marine environment under acute stress.\nThe recent findings also point to deeper patterns of ecological disruption, with excessive and unregulated fishing, improper use of technology on industrial trawlers, rising microplastic pollution, and depleting oxygen in coastal zones—all playing a part in it. The survey recorded 418 microplastics, mapped abnormal jellyfish proliferation across the trawl stations, and observed that bycatch and wastage have increased due to poor monitoring. Notably, of the country's 20 major commercial fish species, only five are now viable for harvest, down from nine in 2018. Experts have repeatedly warned that without effective management, Bangladesh risks losing both biodiversity and the marine resources on which coastal communities depend.\nThis accelerating degradation, we must say, is largely a consequence of policy failures. Despite years of warnings, licences for industrial trawlers have continued to rise while monitoring mechanisms remain weak. Of the 273 industrial trawlers currently operating, 72 use advanced technology, yet its misuse has worsened bycatch. Oxygen depletion, high concentrations of microplastics, and collapsing pelagic stocks have all combined to threaten not only fish populations but also long-term food security, livelihoods, and the credibility of state-led conservation commitments.\nWe urge the government to take this crisis seriously. Going forward, the issuance of new trawler licences should be strictly limited, and the total fleet size must be reduced in phases. Industrial trawlers using illegal nets or violating designated zones should also face immediate suspension. Equally importantly, the state's marine research capacity must be strengthened to ensure continuous monitoring and informed policymaking. Protecting our marine resources is no longer an environmental preference; it is an economic and ecological necessity that demands urgent response and sustained commitment.\n",
        "headline_1": "A marine crisis we can no longer ignore",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/marine-crisis-we-can-no-longer-ignore-4048331",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "There is rarely a convenient time for a strike, but the timing of the latest strike by secondary school teachers comes across as particularly surprising. As the annual school examination season begins—a period of high anxiety for students and parents alike—a set of educators have abandoned their duty in an attempt to force the government to meet their demands. We find this move totally irresponsible.\nThe timing could not be worse. According to the government's schedule, annual exams were set to run from November to December, followed swiftly by selection tests and junior scholarship exams wrapping up on New Year's Eve. This is the crunch time of the academic calendar. Yet, instead of quiet concentration in exam halls, students are having to face administrative anarchy.\nThe Directorate of Secondary and Higher Education attempted to regain control with stiff directives, warning that any \"negligence\" in conducting the exams would trigger punitive action. But teachers, organised under various associations, have chosen to ignore these orders. The result is chaos across the country: while some schools held exams, many institutions have suspended tests, according to our reporters. As the coordinator of the movement has said, the boycott is well underway, rendering the government's late-night circulars largely ineffective.\nThe teachers' grievances are numerous and significant, and we urge the government to review and address them properly. Their demands include the upgrading of entry-level assistant teacher posts, the creation of a separate Directorate of Secondary Education, and the reinstatement of benefits withdrawn as far back as 2015. It is possible that these demands have merit. But to hold the future of children hostage in their push for pay and perks is a totally unethical tactic.\nEducation is not a factory line where work abstention merely delays a shipment; it is a time-sensitive endeavour in which disruption can derail academic progression and inflict psychological stress on students. The teachers' coordinator has argued that the government's circulars are an attempt to suppress their movement. He may be right about the government's steps, but he is wrong to assume that this gives his colleagues the moral licence to jeopardise the academic year.\nThe teachers must respect their primary responsibility to students. They claim they will only return if the education ministry sits down with protest leaders. This is the language of blackmail, plain and simple. The teachers may believe they are teaching the government a lesson in power dynamics. In reality, they are sending the wrong message. They should return to classrooms and exam halls immediately for the sake of the students. The government, meanwhile, must expedite efforts to resolve the issues at the root of this crisis.\n",
        "headline_1": "Teachers must not hurt students’ future",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/teachers-must-not-hurt-students-future-4048101",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "We welcome the government's approval of a new ordinance that aims to prevent human trafficking and the smuggling of migrant workers by introducing comprehensive remedial measures. At a time when the overwhelming majority of such cases end in acquittal, the initiative signals a long-overdue recognition that the country's legal and institutional framework has failed some of its most vulnerable citizens. Updating the existing law to align with international standards and clearly define offences related to migrant smuggling—long legally undefined despite its widespread occurrence—is a step in the right direction. Of course, law alone is not enough. But having a proper law can enable effective investigation, prosecution, and ultimately justice for victims.\nA review of official case-disposal records paints a grim picture of how trafficking cases have fared so far. In 2020, the courts disposed of 14 cases, and 13 of them ended in acquittal. In 2021, both disposed cases ended in acquittal. In 2022, all 34 disposed cases met the same fate. The volume of disposed cases surged in 2023 but the acquittal rate remained disturbingly similar, with 415 of 436 cases ending in acquittal. In 2024, out of 363 cases 342 cases resulted in acquittal. Even the first six months of 2025 followed the same pattern, with 132 of 141 disposed cases ending in acquittal. These figures do not suggest the absence of crime, but rather the weakness of investigations, the confusion in legal categorisation, and the inability of our system to hold perpetrators to account.\nThe new law intends to address these gaps. The decision to introduce a separate chapter on the smuggling of migrants (SOM) is particularly noteworthy as an average of 95 percent of SOM cases ended in acquittal over the last four and a half years, largely due to miscategorisation. It also addresses the growing use of online platforms for \"job recruitment\" by traffickers, while limiting the influence of the accused by allowing the freezing of bank accounts, seizing of assets, and restricting of travel during investigation, with court approval of course. Meanwhile, the provision of improved witness protection and safeguards to prevent victims from being pressured into withdrawing complaints could strengthen cases that previously fell apart under intimidation.\nHowever, as we have already noted, law alone is insufficient. Many of those who fall victim to traffickers or smugglers do so out of desperation, poverty, and a lack of safe, legal migration pathways. So if the ordinance is to achieve its stated objective, it must be accompanied by robust implementation, proper training for law enforcement and prosecutors, and sustained awareness campaigns in high-risk communities. Only then can we succeed in suppressing human trafficking.\n",
        "headline_1": "Time to ensure justice in trafficking cases",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/time-ensure-justice-trafficking-cases-4047586",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 03, 2025 00:00:00  \nOver the past one and a half decades, the term Gross Domestic Product or GDP became synonymous with development and the state-owned statistical agency and other official documents would occasionally come up with various data showing how the economy was on an ever-rising growth trajectory. Obviously, those were projected as the measure of the nation's development. Even the international development partners were convinced of those growth narratives and would praise the then-government for its success story of economic growth. Against this backdrop, economists have of late been coming up with research data that are unravelling the mismatch between growth, for instance, in the manufacturing sector and the rising rate of unemployment. Presented at a recently held discussion event styled \"Beyond Jobless Growth: Towards an Employment-Centred Policy Framework for Bangladesh Through a Post-Neoliberal Lens\", some study findings showed that the manufacturing sector despite recording an impressive annual rate of growth at around 10 per cent between 2013 and 2023, had shed 1.4 million jobs during that period. How can one explain this glaring mismatch between growth and unemployment at the same time? \nIt was found that in the export-oriented garment industry, fewer workers produced more value in terms of export earnings than before. In 2013, for instance, the industry required 220 workers to produce goods worth US$1.0 million in terms of export earnings. However, a decade later in 2024, the same amount of goods and matching export earnings could be generated by 94 workers. That was definitely good news for the investors who achieved such success through adoption of modern technology that increased productivity of the industry manifold, but at a cost. While one cannot deny the industry's higher level of productivity and earnings that go with it, but at the same time it creates a fresh crisis for the policymakers resulting from the massive job cuts. How can these dichotomous developments in the macro-economy be reconciled? Growth is no doubt a priority before the investors in the manufacturing industries such as the export-driven ones, but the question that would also arise at the same time is, growth for whom? And this issue is especially problematic for a country where about 3.0 million people are entering the job market annually. So, creating jobs for the fresh millions joining the workforce every year should be the topmost priority before the government as well as the development thinkers. \nUnsurprisingly, some experts at the said discussion event blamed the deepening employment crisis on what they termed disproportionate focus on a single industrial sector, namely, the Readymade Garment (RMG). This, no doubt, created an imbalance affecting the rest of the economy. For when the RMG-led manufacturing has been experiencing significant rise in terms of growth, the agriculture that absorbs the overwhelming proportion of the growing workforce went through a decline as its contribution to the GDP fell markedly from its previous level. This calls for incentivising more agro-based industries including the start-ups in the sector. That may help reduce the job loss on a massive scale like the manufacturing sector suffered over the last one decade. \nOverall, it is time for a rethink on the part of both the government and the economic expert about getting the priorities for growth and employment right. While the economists are rightly blaming government policies and explaining the existing economic realities through different terminologies such as 'triangle of vicious cycles' and so on, the real challenge would be to come up with the correct guidelines for the policymakers and the businesses to follow. It goes without saying that the right model for the economic growth should be the one that creates more jobs and ensures growth at the same time.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Striking a balance between growth and job creation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/striking-a-balance-between-growth-and-job-creation-1764685529",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       December 03, 2025 00:00:00  \nBangladesh's trade imbalance with China has continued to rise over the past decade, driven mainly by high imports of industrial goods from its single largest source. While Bangladesh's export earnings from China have remained largely stagnant despite enjoying duty-free access for 98 per cent of its tariff lines, imports have surged to fuel local manufacturing, infrastructure building and industrial expansion. This widening gap has inevitably raised a pressing question: why has Bangladesh been unable to capitalise on its almost fully duty-free status in the vast Chinese market?\nThe answer, however, is more complex than it appears at first glance. The link between export performance and duty-free access is far from linear. Market entry-even with tariff advantages-depends on a range of factors that go beyond trade preferences. A closer look at Bangladesh-China trade dynamics helps illuminate the structural realities shaping this outcome.\nAt present, China accounts for roughly 22 per cent of Bangladesh's total imports, dominating the supply of industrial raw materials, intermediate goods, chemicals, fabrics, yarn, accessories, and capital machinery. This heavy import footprint has, over the years, created a deep industrial reliance on Chinese inputs, which traders and analysts say is driven by competitive pricing, consistent quality and reliable availability. From textiles to electronics, leather to construction, Bangladeshi industries depend heavily on Chinese supply lines to keep production running.\nCentral bank statistics covering FY2019-20 to the first quarter of FY2025-26 show how significantly Bangladesh's import bills from China have outpaced its export receipts. Imports ranged between US$ 11 billion and US$ 20 billion annually, while exports remained confined to around US$ 500-600 million. Imports rose sharply from US$11.49 billion in FY20 to a historic peak of US$ 20.88 billion in FY22, supported by strong domestic manufacturing growth and major infrastructure projects. However, the trend reversed as macroeconomic pressures mounted. Foreign exchange shortages, currency depreciation, and subdued industrial activity pushed imports down to US$ 17.83 billion in FY23 and US$16.64 billion in FY24. The cautious stance continued in FY25, with import LC openings registering US$ 15.48 billion. During the first quarter of FY26, imports stood at US$ 4.04 billion, reflecting restrained industrial demand and a more conservative purchasing outlook.\nIn stark contrast, Bangladesh's exports to China have shown minimal movement over the same period. Yearly export earnings fluctuated mildly: US$ 595.39 million in FY20, US$ 680.50 million in FY21, US$ 674.62 million in FY22, before dipping to US$ 580.40 million in FY23 and then rising modestly to around US$ 670 million in FY24 and FY25. In the first quarter of FY26, exports reached US$ 190.89 million-consistent with past patterns, but nowhere near the scale required to narrow the deficit meaningfully.\nThis stagnation persists despite China's duty-free access for 98 per cent of Bangladeshi products. Tariff concessions alone cannot overcome the deeper structural challenges that constrain Bangladesh's export capacity. Several factors lie behind this limited utilisation of market access.\nFirst, Bangladesh's export basket remains narrow. The country relies overwhelmingly on ready-made garments (RMG), a sector in which China itself is a global manufacturing powerhouse. Competing in China's domestic apparel market is very difficult, given its scale, cost efficiency and advanced industrial ecosystem. Beyond garments, Bangladesh has yet to develop diversified, high-value products that resonate with China's evolving consumption patterns.\nSecond, supply-side constraints weigh heavily on export performance. Bangladeshi firms face limitations in production capacity, quality consistency, product design, and technological sophistication-areas where China excels. Logistics, port efficiency, customs procedures, and transport systems in Bangladesh remain significantly behind Chinese standards, limiting the speed and reliability required for export-oriented supply chains.\nThird, Bangladesh has struggled to leverage duty-free access effectively. Without diversified products and strong supply capabilities, preferential tariff access alone cannot stimulate a meaningful increase in exports. Many Bangladeshi firms lack the market intelligence, branding strength, compliance readiness, and long-term export strategies needed to enter and sustain operations in a competitive market like China.\nFourth, there is a clear mismatch between Bangladeshi export offerings and Chinese market demand. China's import preferences have shifted towards higher-value items-technology-infused apparel, specialised textiles, high-grade agro-products, electronics components, machinery parts and advanced materials. Bangladesh is yet to build competitive capacity in these sectors.\nFifth, China's domestic supply chains are exceptionally strong. With efficient manufacturing clusters, cheap logistics, and economies of scale, Chinese producers enjoy inherent advantages. Even when Bangladeshi products enter the market duty-free, competing against China's own low-cost producers becomes extremely challenging.\nAdding to these structural barriers are domestic challenges. Political instability, business uncertainty and periodic disruptions in transportation and logistics exacerbate export constraints. Investors-both domestic and foreign-often prefer to maintain a cautious stance, slowing down capital formation in industries that could otherwise diversify Bangladesh's export base.\nExperts note that the Bangladesh-China trade imbalance reflects more than just a numerical deficit-it is symptomatic of deeper industrial dependence. Currently, 30-35 per cent of Bangladesh's industrial raw materials and machinery originate from China. This reliance, while difficult to avoid given pricing advantages, makes it harder for Bangladesh to build a competitive manufacturing base capable of producing a broader array of exportable goods.\nTo reduce the imbalance in the long term, Bangladesh must diversify its sourcing network, encourage local backward-linkage industries and upgrade manufacturing capacities. At the same time, developing new export-oriented sectors-IT services, agro-processed goods, pharmaceuticals, specialised textiles, light engineering and leather goods-can help tap into China's vast and dynamic market.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Duty-free advantage in China: opportunity or illusion?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/duty-free-advantage-in-china-opportunity-or-illusion-1764685566",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 03, 2025 00:00:00  \n\nTikTok has rapidly become one of the most influential digital platforms among Bangladeshi youth, reshaping how they communicate, express themselves and participate in online culture. The short-video format has unlocked new avenues for creativity, giving young people the freedom to showcase talent, share opinions and connect with a wider audience. From dance clips and comedy sketches to educational content and social awareness campaigns, TikTok has expanded the possibilities of digital self-expression for the country's younger generation.\nOne of TikTok's most notable contributions is the way it encourages creativity and confidence. Thousands of young Bangladeshis, many from outside major cities, have found a platform where they can express their identity without the need for expensive equipment or professional training. \nHowever, alongside these positive developments, the rise of TikTok culture has introduced several concerning trends. Through TikTok, many people are now creating fake content and spreading a lot of fake news, causing ordinary people to suffer. The pressure to gain followers and likes often leads young users to imitate risky behaviours, follow viral challenges without considering consequences, or engage in unhealthy competition. Excessive screen time has become a growing issue, affecting sleep, productivity and academic performance for many students. \nAnother worrying aspect is the spread of misinformation and sensational content designed solely to attract views. Without proper media literacy, many young people find it difficult to distinguish reliable information from online exaggeration, making them vulnerable to manipulation. At the same time, the commercialisation of TikTok fame can sometimes promote unrealistic expectations, where success is measured only through virtual popularity.\n Balancing these opportunities and risks is essential as TikTok continues to grow in Bangladesh. Parents, educators, and policymakers must work together to promote responsible digital use by encouraging media literacy and creating awareness about online safety. At the same time, TikTok itself can play a positive role by strengthening content moderation, promoting educational creators, and highlighting responsible trends. For Bangladeshi youth, the challenge is to embrace the platform's innovative potential while staying mindful of its adverse impacts.\nAhmed Abdullah Rafi, Student\nDepartment of Marketing\nNorth South University.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "TikTok: Innovation and abuse",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tiktok-innovation-and-abuse-1764685599",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-12-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       December 03, 2025 00:00:00  \n\nSmall and Medium Enterprises (SMEs) remain one of the most influential drivers of Bangladesh's economic development. They support millions of jobs, promote local entrepreneurship, and contribute to balanced regional growth. As the country aims for long-term economic advancement, the SME sector continues to play a central role in ensuring inclusive and sustainable progress.\nHowever, the growth of SMEs is often limited by several structural challenges. Many entrepreneurs face difficulty accessing finance due to strict collateral requirements, complex loan procedures and limited awareness of financial opportunities. In addition, the slow adoption of modern technology and digital tools has reduced the competitiveness of small businesses in a growing digital marketplace. Without proper support, SMEs struggle to reach broader markets or improve productivity.\nTo strengthen this vital sector, coordinated action from the government, financial institutions and private organisations is essential. Simplifying loan processes, expanding SME-friendly financial products, and enhancing digital literacy and business training programmes can significantly improve the business environment. Public-private partnerships can also help build stronger supply chains and create additional market opportunities. A more resilient SME ecosystem will support employment, innovation, and long-term economic growth in Bangladesh.\nHabiba Sikder\nDhaka\nhabibasikder01@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Strengthening SME sector for sustainable growth",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/strengthening-sme-sector-for-sustainable-growth-1764685638",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-12-2025"
    }
]