[
    {
        "full_article": "For decades, the women who serve as Anshakalin Stri Parichars (ASPs) in Maharashtra have been performing some of the hardest, yet least acknowledged, labour in the rural health system. For a wide breadth of responsibility, their monthly wage has stagnated at ₹3,000 since 2016, decades behind inflation. They also lack job security, pensions, safety gear and travel allowance. In 2023, a labour court in Nagpur acknowledged that they deserved at least the protection of the Minimum Wages Act but left the decision to the State. In keeping with its verbal-only assurances, the State has even now only promised them ₹6,000 a month by December 2025 — much less than what multi-purpose health workers receive. The indifference is not accidental: ASPs, who predate Accredited Social Health Activists (ASHA) and anganwadi workers, have been easy to ignore because they are poor, rural women. Their neglect reveals a gendered and caste-inflected hierarchy of labour within public health, where skilled work is low status and devalued because of who performs it. Their ongoing protests are part of an arc of agitation following similar sit-ins in Kolhapur, Nagpur, Ratnagiri and Yavatmal. In this regard, their plight resonates with that of ASHAs in other States. ASHAs, created under the National Rural Health Mission in 2005, are the community’s first link to the health system and are also officially classified as “volunteers” rather than employees, compensated only through oft-delayed incentives, amounting to less than subsistence. Across States, ASHAs have repeatedly agitated for fixed honoraria, recognition as government staff and social security, and, like the ASPs’ protests, have borne the same refrain: States cannot continue to build their health systems on the underpaid labour of women.These struggles highlight a structural contradiction. While India relies heavily on women community health workers and attendants to deliver maternal and child health care, immunisation and disease surveillance, especially in rural areas, it refuses to recognise them as workers entitled to minimum benefits and dignity. The reliance is often framed as offering rural women “opportunities” for public service. Yet, in practice, it is exploitation. These women risk snakebite while clearing hospital grounds and death in accidents en route to vaccination duty without insurance or compensation. A health system that does not value the people who keep it functional and link its margins to formal care is bound to sabotage itself. To secure rural health is to secure the rights of those women through living wages, safe working conditions and stable employment. Published - October 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        gender\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        health\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        social security\n                    \n                            /                      \n                        \n                        pension and welfare\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        public health/community medicine\n                    \n                            /                      \n                        \n                        parent and child\n                    \n                            /                      \n                        \n                        disease\n                    \n                            /                      \n                        \n                        rural health\n                    \n                            /                      \n                        \n                        vaccines",
        "headline_1": "​Labour of care: On the Anshakalin Stri Parichars, women community health workers",
        "headline_2": "Women who facilitate rural health care should get better wages",
        "link": "https://www.thehindu.com/opinion/editorial/labour-of-care-on-the-anshakalin-stri-parichars-women-community-health-workers/article70108239.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "Once widespread across the Gulf of Mannar, Palk Bay, the Gulf of Kutch and the Andaman and Nicobar Islands, India’s dugongs dwindled to a few hundred individuals as poaching, by-catch, habitat loss and pollution compounded the animals’ slow rate of reproduction. But, in the last decade, a series of initiatives have signalled a serious, if still inchoate, effort to reverse this decline. The most visible step was the notification of the Dugong Conservation Reserve in Palk Bay in 2022 under the Wildlife (Protection) Act. Protecting over 12,000 hectares of seagrass meadows, it has become a model of integrated marine conservation. Tamil Nadu’s stewardship, bolstered by the Wildlife Institute of India (WII) and local community participation, has mitigated poaching and encouraged fishers to release dugongs caught as by-catch. Now, the International Union for Conservation of Nature has recognised the reserve as an exemplar, lauding its ecological significance and innovative restoration techniques. WII surveys suggest that the population here numbers over 200, fragile but encouraging progress from the fear of extinction voiced two decades ago. India has also experimented with technologies that widen conservation options, which include drone platforms and acoustic and satellite-based mapping of seagrass beds.Yet, much remains to be done. Even in the reserve, mechanised fishing, port construction, dredging and pollution from agriculture and industry threaten seagrass meadows. Dugongs continue to die in fishing nets. Rising sea temperatures, acidification and storms threaten restoration gains. Populations in Gujarat and the Andamans are also smaller and less protected than in Tamil Nadu. Experts have stressed the importance of cross-border collaboration, particularly with Sri Lanka, since dugongs traverse the narrow Palk Strait. Without shared protection, the recovery will remain local. Funding, too, has been inconsistent: while allocations from the compensatory afforestation fund have helped, the long gestation of dugong populations requires decades of steady investment. These efforts and shortcomings hold broader lessons for the conservation of other marine species that demand intact ecosystems while being directly threatened by human activity. The Palk Bay reserve demonstrates that community engagement with fishers as partners can mitigate by-catch and create local constituencies for conservation. The IUCN recognition underscores how international endorsement can amplify domestic efforts, offering legitimacy and opportunities for knowledge exchange. Likewise, blending traditional ecological knowledge with technologies such as drones and echosounders shows how conservation can bridge tradition with modernity.\r Published - October 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        Gujarat\n                    \n                            /                      \n                        \n                        Andaman and Nicobar Islands\n                    \n                            /                      \n                        \n                        wildlife\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        habitat (conservation)\n                    \n                            /                      \n                        \n                        conservation\n                    \n                            /                      \n                        \n                        environmental issues\n                    \n                            /                      \n                        \n                        wildlife\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        Sri Lanka\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        pollution\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        forests",
        "headline_1": "Swim to safety: On the dugong and conservation",
        "headline_2": "Engagement with fishers can help with marine conservation",
        "link": "https://www.thehindu.com/opinion/editorial/swim-to-safety-on-the-dugong-and-conservation/article70113059.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "America’s MAGAtma & our Mahatma\nMAGAlomaniacs make the merely mega ones seem like models of Gandhian humility. Oct 2 is the right day to appreciate how many of the Mahatma’s 11 vows Doland-ji has made his own.\nSatya. Trump’s Experiments with Truth are unending. Not just bending it to his whim, he has X-ed out other platforms and expanded this core principle to ‘Truth Social’. He has thus cleverly incorporated the Gandhian message of social justice.\nAhimsa. Hear this: ‘Only the PREJUDICED LYING MEDIA damns me the ANTITHESIS of non-violence. Nothing can be further from the TRUTH SOCIAL. You don’t believe I stopped Operation Sindoor? Go ask that Paki fella who came with his box of coloured rocks to IMPRESS ME. More important, by siding alternately with ‘Pootin’ and ‘Whatshisname’, I’ve warned them that neither of you can depend on the US of Arms, So you better make peace. And let me get my much-deserved Nobel.’\nSwadeshi. No one has made a bigger impact in getting so many countries to boycott American goods and turn to self-reliance. His ‘good friend Narrendur’ acknowledges this in every speech. ‘Hey Vance, what’s that word Injuns like yer wife have for praise? Ah yeah, tarrif.’\nAparigraha. Trumpji’s H-1B tightening is ‘selflessness’ personified. The world’s brightest and best will now stay home or flock to non-American countries. This will level the economic playing field, endorsing his mantra, MOGA: Make Others Great Again.\nAsprishyata/Sparshbhavana. Remember how, till recently, no one could touch America, or even come near its excellence in every sphere? Trumpji has singlehandedly succeeded in removing that ‘untouchability’.\nSatyagraha. Gee!, POTUS non-cooperates with countries begging for more reasonable tariffs. Wow!, he’s even made Lotus one non-cooperate with his demands. Non-violently.\nSarva dharma sambhav. Doesn’t he treat all faiths, other than his own, with equal contempt?\nSharira shrama. MahaTrump has manifestly internalised the principle of ‘bodily labour’. Have you any idea how much time he labours over just his hair?!\nSee, the MAGAtma clearly believes in ‘Gandhisn’ vows. Only, his spelling’s not too good.\n                                          ***\nAlec Smart said: “UNESCO tag for Chhat puja ok. But religion and politics should be kept polls apart.”\n\n",
        "headline_1": "Dos and Don’s",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/dos-and-dons/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "6-point-something GDP growth won’t make India a developed country. The asking rate is 12-plus now\nA surplus monsoon bodes well for agriculture and rural demand this year. GST reforms, which kicked in 10 days ago, are also expected to spur consumption. So, RBI’s revised growth forecast of 6.8% isn’t surprising. It seems like a small increment from 6.5%, but in a $4tn economy each fraction of a percentage point amounts to billions of dollars. Yet, it’s nothing to celebrate when Trump’s tariffs have cast a shadow over roughly $50bn worth of goods exports.\nEven otherwise, 6.5% or 6.8% isn’t an aspirational growth rate for India. As the finance ministry has said more than once this year, India needs to grow at 8% “every year, at least for a decade” to become a developed country by 2047. Yes, India remains the fastest growing major economy, but relative performance doesn’t improve living standards. In the late 1990s, when India’s population was growing at 2% per annum, economists recommended a 9% growth target for 7% effective growth – to double income every 10 years. Now, although population growth has slowed to about 1% per year – based on estimates in the absence of a census – 8% is the slowest acceptable GDP growth target.\nHowever, a new Morgan Stanley analysis shows even 8% might be too slow. To address the growing problem of unemployment, the asking rate must be 12.2%, it says. The report points to record youth unemployment – 17.6% – and a surge in agricultural employment, which are faces of the same coin. Growing farm employment is in fact the clearest sign of a jobs crisis. As countries develop, agriculture’s share in employment and output shrinks. Farm work accounts for only 1.2% of employment in US. But in India, this year’s Economic Survey showed agriculture’s share in employment increased from 44.1% in 2017-18 to 46.1% in 2023-24.\nOver the next 10 years, 84mn Indians – equal to the population of Germany – will hit working age. So, creating good jobs for them has to be a national priority. Long-neglected manufacturing, whose share in GDP had slipped to 15.9% in 2023-24 from 16.7% in 2013-14, should be the preferred engine for this, because it creates more related jobs than services. That’s how US built its middle class in the 1950s, and China in the 2000s. The vision of developed India hinges on this.\n\n",
        "headline_1": "2 Sixes, Please",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/2-sixes-please/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "ICMR study shows how ruinous our diets are to our health. Policymakers, sit up \nListen carefully to what ICMR-India Diabetes study has to say – a cross-sectional population based survey weighted for region, age and gender, conducted from Nov 2008 to Dec 2020. Prevalence of generalised obesity is at a huge high of 29%, abdominal obesity at almost 40%, type 2 diabetes (T2D) at over 11%, prediabetes at over 15%. To put this in context, take the fact that non-communicable diseases (NCDs) account for almost 70% of deaths in India. And NCDs are caused by conditions substantially created by poor diet – low quality carbs (white rice, milled whole grains, and added sugar), low intake of protein and high levels of saturated fats. Now, the argumentative Indian would insist that pan India’s basic rice-atta/maida staple has no parallel – at her own peril. For India has rapidly undergone dietary transition alongside ever-increasing physical inactivity. And it’s not as simple as just replacing ‘bad’ carbs with fancy organics.\nIn fact, ICMR found that replacing refined cereals with whole wheat/ millet flour without decreasing overall carbohydrate quantity doesn’t reduce risk of T2D or abdominal obesity. The survey found that risk of T2D or prediabetes can be reduced by 6-10% if carbs are replaced with fish or egg – but meat does not have the same impact. Also, barring Jharkhand, Chhattisgarh, Arunachal and Manipur, no state met recommended saturated fat intake. While urban India is more overweight, and leads far more sedentary lifestyles than rural India, a total of 61% pan India was physically inactive, 43% overweight, 26% obese. The north had the highest rates of overweight people (54%). Nearly a third of India’s population has hypertension (27%). This highly significant ICMR study comes not a day too early – policymakers must get down to formulating the changes that will help fix diets, increase protein intake, cut sugars, etc to eventually reduce NCDs, a ticking health bomb. \n\n",
        "headline_1": "Curb The Carbs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/curb-the-carbs/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "The pendulum of life oscillates between fleeting moments of joy and seemingly longer periods of pain. This appears to be the reality of life for most of us, despite our best efforts to create happy and calm lives. We believe that things will never improve for us. However, upon reflection, we find that periods of difficulty often have a silver lining. There are times when we are suffering or maybe our family and friends are suffering, so we feel their pain. We may have financial hardships. Those periods are terribly painful. Sometimes, we encounter multiple problems at once. We wonder if God will ever give us a break.\nYet, what we may not realise is that many of these events are due to something we did in the past. The third law of physics, which states that every action has an equal and opposite reaction, is at work. Whatever actions we took caused reactions. It could be a reaction to something we thought, said, or did in the past. While it is painful and we suffer, we should recognise that it is a debt we owe that must be repaid. We may have done something to someone in the past, and we must later face the consequences of our actions. But even though we have passed through rough times, they do not last forever. There are also sunny days ahead for us.\n\nA sunny day arrives at a time when, once that debt is paid, we are free of it. The weight that covers our soul and keeps us tied to this physical realm begins to lift. We are then lighter and can soar higher. Like a hot-air balloon weighted down with sandbags, when we toss out those weights, the balloon can lift off to soar. Our load is lightened, and we can experience more inner progress free of those burdens. We can learn how to lead our lives to make spiritual progress. We can lead our lives in a way that we are conscious of our thoughts, words, and deeds.\nWhen we realise that life brings rainy days and sunny days and that there is a purpose for what happens to us, life becomes calmer and more peaceful. We can learn how to stay at an even keel, whether we are passing through stormy or sunny days of life, by finding a calm centre. We can reach this still point through meditation. Within us are all the riches of divinity. We are not just the body and mind, but the soul. The soul is filled with light, love, and joy. It relates to the Source of divinity, creative Power, which is also light, love, and joy.\nThe creative Power and soul are made of the same essence. If we spend some time daily in the silence of our souls, we will be connected to a place of bliss. Then, the outer circumstances of our life will not affect us. We will not be affected by temporary phases of life. We can learn to find a still centre filled with peace and balance, which will provide us with permanent happiness despite outer variations of life.\nWhat we take as setbacks and problems may also result in things working out for the better. We often discover that it was rainy days that brought us bouquets of flowers. There are several areas in which we may have felt we were going through dark times. In each of those times, it appeared as if our suffering would never end. However, ultimately, those times may have led to a breakthrough, allowing us to pass through them and once again experience joy in our lives.\n\n",
        "headline_1": "Difficult times have silver linings",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/difficult-times-have-silver-linings/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "Recently on LinkedIn, I have been noticing numerous campaigns and discussions about toxic leadership and why people leave workplaces. One phrase in particular struck me: \"people don't leave workplaces; they leave toxic people.\"\nI find it to be true. People leave for many reasons—salary concerns, heavy workloads, personal circumstances, or the attraction of a better opportunity. These are all valid and very real factors. But when I reflect on my own experiences and observe others, I realise that more often than not, the deciding factor is not simply money or opportunity—it is the quality of leadership. A toxic leader can make a well-paid job unbearable, while a supportive leader can make even the most challenging circumstances worth staying for. That is why I believe toxic leadership is not just one of the reasons people quit—it is often the most decisive one.\nA toxic boss has the power to break even the most passionate professional. Under constant negativity or insecurity, people begin to doubt their own abilities. What once felt like potential slowly turns into fear. Ideas that could have driven innovation remain unspoken, and creativity is silenced before it ever has the chance to grow. Over time, enthusiasm fades, and resignation, whether emotional or literal, becomes the only escape.\nBut here is the encouraging part: the opposite is equally true. A supportive leader can unlock strengths that a person may not even recognise in themselves. With the right guidance, feedback, and encouragement, an employee's confidence grows, their creativity flourishes, and their performance reaches new heights. In fact, one good leader can transform not only the quality of someone's work but also the entire trajectory of their career.\nWe often talk about workplace harassment in terms of gender discrimination, bullying, or outright abuse of authority. However, there is another layer that does not receive enough attention: when a supervisor feels threatened by the potential of their subordinate and it starts reflecting in their behaviour.\nIn my experience, this dynamic can occur across genders. Instead of providing mentorship and support, an insecure leader may respond with harsh criticism, unnecessary pressure, or subtle acts of exclusion. Over time, these behaviours do not just hold people back—they can actively push talented professionals out of their roles. What makes this form of harassment so damaging is its invisibility. It rarely leaves obvious marks, but it erodes confidence, stifles growth, and quietly drives good people away.\nThe issue is critical for everyone. Both men and women face challenges under insecure or hostile supervision. Men may struggle with the pressure of always having to appear strong, competent, or \"in control,\" which often prevents them from seeking help or speaking out when mistreated. The stigma around vulnerability can leave them feeling isolated, silently enduring toxic environments rather than addressing them.\nFor women, the issue becomes even more complex. In many societies, women already carry the weight of cultural expectations—balancing family responsibilities, facing stereotypes about their competence, or constantly fighting for recognition in male-dominated spaces. When, on top of this, a woman encounters hostility from her supervisor, especially from another woman in a supervisory role, the impact can be deeply discouraging. Instead of solidarity, she experiences inaccessibility. Instead of mentorship, she encounters competition. This socio-cultural baggage makes workplace harassment even harder for women to navigate, and in many cases, they choose to leave rather than fight endless battles on multiple fronts.\nI can relate to both sides of the leadership spectrum. On the one hand, toxic supervision leaves people feeling diminished, undervalued, and constantly second-guessing themselves. Instead of growth, there is only self-doubt. On the other hand, supportive leadership has the power to do the exact opposite—it can recognise strengths, encourage potential, and create an environment where individuals are able to shine.\nWhen I was given the chance to lead teams myself, I tried to practise the second kind of leadership. I still remember one incident clearly. While leading a team, a donor was adamant about dismissing one of my team members because of her performance. I could have taken the easier route and let her go. Instead, I sat down with HR, and we agreed to groom her rather than reprimand her. I negotiated with the donor to keep her in the project. I never revealed this to my team member; instead, I tried to guide her discreetly.\nAlthough the said individual never grew particularly fond of me, that is fine. Because leadership is not about being liked or seeking approval. It is about making hard choices, standing up for your people, and doing what is right for them—even when they do not see it, acknowledge it, or agree with it at the time. Leadership is about protecting people when they are vulnerable, giving them a chance to improve, and creating an environment where they feel safe enough to grow.\nEvery individual has different potential. A true leader recognises that and adapts their support accordingly. Leadership is not about proving superiority—it is about pooling collective strength. When insecurity, jealousy, or an inferiority complex guides leadership, it becomes toxic. Moreover, toxic leadership is one of the hidden reasons why workplaces lose good talent every single day.\nIf you hold a position of leadership, take a moment to pause and reflect: am I leading from a place of support or insecurity? Am I helping my team members realise their potential, or am I unconsciously holding them back out of fear? Am I creating an environment where people feel safe, valued, and motivated to grow?\nWorkplace harassment does not always announce itself loudly. Sometimes it hides behind a smile, a title, or even a performance review. Yet, its impact is undeniable—lost confidence, missed opportunities, and talented people quietly walking away.\nIt is time we called this behaviour what it is and committed to a different path. When leaders choose empathy over insecurity, collaboration over competition, and growth over control, they build stronger teams, as well as a thriving work environment for their employees.\nTaslima Tinni is a human rights activist.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "How the quality of leadership makes or breaks a workplace",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-the-quality-leadership-makes-or-breaks-workplace-3999281",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "We are alarmed by how our children are increasingly becoming victims of physical and sexual abuse despite there being enough laws and policies to protect them. According to the Local Education and Economic Development Organization (LEEDO), child rape cases rose by nearly 75 percent in the first seven months of 2025 compared to the same period last year. Between January and July, 306 girls were raped, up from 175 in the same period of 2024 and already exceeding the year-total of 234, according to Ain o Salish Kendra (ASK). Moreover, there have been many instances of children being murdered or suffering abuse, including physical assault, sexual violence, and corporal punishment.\n\nThe recent rape of a teenage girl in Khagrachhari, the sexual assault of a 7-year-old madrasa student in Cumilla, and the rape of a 12-year-old domestic worker in Gaibandha are just some of the cases reported in the media. The list goes on. The question is: how long must our children grow up in such an unsafe environment?\nChildren are being abused not only outside but also within their own homes. According to UNICEF, nine out of 10 Bangladeshi children aged 1-14 experience violent discipline at home at least once a month, which is quite troubling. Unfortunately, such harmful practice of parental violence is rarely discussed in our society. Moreover, online abuse has also increased alarmingly with the growing internet usage among children. Incidents of children being exploited to create online content have also emerged in the media. Meanwhile, a 2025 study by SpringerLink found widespread physical abuse among child labourers in rural informal sectors. Additionally, child marriage remains a major driver of both physical and sexual abuse. The situation is disturbing.\n\nWe, therefore, urge the government to take decisive steps to reduce all forms of abuse and sexual harassment of children. It must ensure safe environments and counselling support in schools, implement effective monitoring to prevent domestic abuse, end child labour by providing families with social protection and alternatives, and prioritise the investigation and speedy trial of child sexual abuse and rape cases. Raising awareness among parents, teachers, and employers is also essential. Equally important is the role of the media in promoting child rights and protecting children's identities while covering incidents of abuse. With online abuse on the rise, cyber laws must also be strengthened, and child-friendly helplines established to prevent further harm. Without such decisive actions, the safety and future of our children will remain at grave risk.\n",
        "headline_1": "Amid rising abuse, we must take better care of our children",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/amid-rising-abuse-we-must-take-better-care-our-children-3999231",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 02, 2025 00:00:00  \nThat animation has developed as a global industry within the media and entertainment sector is not widely known. However, its application to feature films, television cartoon series and video games has kept the entertainment world moving. The virtual world thus created becomes an edition of the real world. Bangladeshi animators have proved their creativity by working for global entertainment giants. Yet this particular type of work lags behind its neighbours on account of weak infrastructure, regulatory constraints and a lack of required policy support from the government. But the only Bangladeshi, now settled in the United States of America and heading the DreamWorks Animation, to have won an Oscar for visual effects on a US film is Nafees Bin Zafar. He won the Academy Technical and Scientific Award as early as 2008 for developing a fluid simulation system. \nThere are talented graphics designers and animators among those who freelance for entertainment giants in the USA. So far as creativity in this particular industry is concerned, there is no dearth of geniuses in this country. They can overcome the challenges they face on the creative front but when the tools are not highly advanced, the contents do not reach the depth they should have done, they are helpless. Yet the animators have taken the industry by dint of their grit and on their own initiative. A report carried in this newspaper on Tuesday last claims the country's animation industry has a potential for earning $3.0 billion a year provided that it is given the policy and supports it needs. The global market of this industry is projected to reach $550 billion by 2030. Unless the human resources and technical support become compatible for setting up powerful studios and those are structured though a network to develop computer hubs, Bangladesh will miss a golden opportunity of grabbing a share in the projected animation market. \nSadly, the policymakers are in no hurry to develop the right ecosystem for the animation industry. An official of the Information Communication and Technology (ICT) Division has candidly admitted that under this government there is no plan for helping the sector to expand as a foreign exchange earner. It may happen when an elected government takes over. Such a laidback attitude of the higher authorities speaks volume for the lack of urgency. Time is precious here. India and China lead the outsourcing market and they will go ahead further while Bangladesh will miss the boat. \nAt a time when there was a need for developing the capacity of the industry by injecting fresh investment, at least the government could prepare a policy framework with provision for public-private partnership. Right now 20,000 people are working for the industry. If the industry flourished, more human resources could be absorbed. In the absence of an enabling policy, the animators have to face daunting challenges. At least the process of paying foreign employees and at the same time appointment of foreign consultants could be made easier. But none of these is going to happen because the government has failed to grasp the import of delay in taking a positive decision on this issue. The industry will have to fend for itself.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Animation industry, its growth potential",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/animation-industry-its-growth-potential-1759329643",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       October 02, 2025 00:00:00  \nThe International Day of Older Persons was observed on October 1 with the theme, \"Older Persons Driving Local and Global Action: Our Aspirations, Our Well-Being and Our Rights.\" The theme highlights that older persons, far from being passive beneficiaries, can play a transformative role in building resilient and equitable societies by sharing their knowledge and experience. A reflection of this can be drawn from Bangladesh's current interim government, where almost all the advisors, including the chief advisor, are elderly people. Even in past governments, ministers, opposition leaders, presidents, and chief justices have largely been from older generations. Yet, the irony is, in a country that has literally been run by elderly people, ordinary older citizens - without income, pension, or meaningful government support - are left to suffer immeasurably.\nArticle 15 of the Constitution calls for ensuring the rights of elderly citizens. In line with this provision, the National Policy on Older Persons 2013 was adopted to guarantee a dignified, poverty-free, active, healthy, and secure social life for those aged 60 and above. According to the 2022 census by the Bangladesh Bureau of Statistics (BBS), the country now has over 15 million people in this age group.\nThe United Nations notes that the average life expectancy in Bangladesh has been steadily rising, thanks to advancements in medical science and healthcare services. At present, the average life expectancy stands at 70.06 years for men and 71.98 years for women. While this increased longevity is a positive sign of progress, it also means that people are now living longer in retirement than previous generations. Increase in life expectancy poses a dual challenge: ensuring proper care for senior citizens while also finding meaningful ways to utilise their experience and skills for the greater benefit of society.\nHowever, the hard reality is that the aged people in this country do not get a fraction of the institutional facilities and benefits that their counterparts are entitled to in the developed countries. Moreover, their wellbeing is becoming a casualty of modernisation itself. The break-up or slow disintegration of the traditional family structure has left the aged ones high and dry, physically deprived and psychologically estranged. Their pain and solitude hardly find any exposure in the public domain.\nA recent report of a 65-year-old man being abandoned at a district hospital by his relatives stands as a glaring example of the neglect some ill-fated senior citizens face. During the pandemic, a heart-wrenching case emerged when an elderly mother was left in a forest by her own children, who suspected her of being infected with coronavirus. These are not isolated incidents. Elderly people are often seen begging on the streets, at railway stations, bus terminals.\nEven more disturbing are the silent sufferings endured by the elderly within their own households. With age, many parents find themselves weighed down not only by frailty but also by the neglect of their children and the pain of loneliness. The very children who learned to walk holding their parents' hands have now abandoned those same hands when they need them most. These stories of forgotten parents are neither rare nor new. It is painfully common. Countless mothers and fathers, who once gave their best years to raising families with love, sacrifice, and unyielding devotion, now crave for companionship, support, or even the bare means of survival. Yet, financial support, time, patience, and compassion are too often looked upon as luxuries that many of their offspring cannot afford.\nThe Parents' Maintenance Act 2013 was passed to provide a legal framework for the financial and physical care of elderly parents who are unable to support themselves. The Act mandates every child to ensure maintenance for their parents and, in parents' absence, for their grandparents (paternal and maternal). The Act also mentions that any person violating any of the provisions will be subjected to a fine of one lakh taka; failing which, s/he may face imprisonment for up to three months. \nThe Law has been enacted to make it obligatory for sons and daughters to care for their elderly parents and bear their expenses. However, familial love and responsibility cannot be instilled solely through legal measures, making enforcement of the law challenging. It is still unheard of any parent having taken legal action against their child using this law. The very existence of the law is intended to act as a moral reminder and obligation for financially capable children to provide for their parents.\nThe government should also step up support for elderly citizens. In the 2025-26 fiscal year, the monthly allowance for elderly persons has been increased from 600 to 650 taka. Around 5.5 million people benefit from these programmes. Even after the slight increase in the elderly allowance, the amount remains modest and its coverage is limited, while the beneficiary selection process is riddled with irregularities. Concerns have been raised over age falsification and partisan considerations in the registration process for elderly allowances. Some elderly people have even complained that they had to pay bribes to be enrolled in this allowance programme.\nApart from increasing the elderly allowance both in amount and coverage, the government must introduce other comprehensive support measures to ensure dignity and well-being for senior citizens. These could include establishing senior citizens' homes at every districts, providing free medical treatment and essential medicines at public hospitals and community clinics, reserving seats on all forms of public transport, offering special discounted tickets, and setting up separate ticket counters for the elderly. Such initiatives would not only offer the much-needed assistance but also help restore a sense of respect, security and inclusion for older members of society. But, it is ultimately societal conscience, empathy and family responsibility that can ensure the dignity, security and well-being of the senior citizens.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Caring for the elderly",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/caring-for-the-elderly-1759329811",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 02, 2025 00:00:00  \n\nBangladesh, a developing country with a population of over 170 million, struggles to convert its large population into productive wealth. According to the Bangladesh Bureau of Statistics (BBS) Labor Force Survey-2024, around 9 lakh highly educated individuals are unemployed, while the total number of unemployed ranges between 25-27 lakh. Many job-seeking graduates face mental stress, and in some cases, resort to extreme measures like suicide.\nThe root of the problem lies in the education system, where the focus is often on obtaining certificates rather than practical knowledge. Most subjects in higher education do not guarantee subject-based jobs, except for teaching. Each year, around 700,000 graduates enter the job market, yet fewer than 7,000 are hired in teaching professions. This mismatch has led to a rapidly rising unemployment rate.\nPhysical education and sports science have emerged as promising fields to tackle unemployment. These disciplines focus on physical and mental fitness, leadership, skill development, and intellectual growth. Graduates in this field rarely remain unemployed. Currently, four public universities and one private university offer honors and master's degrees in physical education and sports science. Additionally, six government and 20 private colleges under the National University, as well as Uttara University, provide professional degrees like B.P.Ed.\nGraduates with honors or master's degrees in physical education are eligible for positions as teachers, trainers, or sports personnel in schools, colleges, universities, training academies, English-medium schools, and district sports offices. According to the recent 18th Teacher Registration Examination, out of 4,600 vacant posts in private schools and colleges, only 1,700 were filled, leaving more than 3,000 opportunities available. The government's Physical Education Teacher Policy has further expanded job prospects in schools and primary education.\nThus, studying physical education and sports science offers a practical solution to unemployment while contributing to a healthier, skilled, and productive society.\nMd. Raihan Hossin\nLecturer\nGovt. College of Physical Education, Barishal\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reducing unemployment through physical education",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reducing-unemployment-through-physical-education-1759329837",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 02, 2025 00:00:00  \n\nRoad accidents are a leading cause of premature death. A perfectly healthy person may suddenly lose her/his life due to a catastrophic event on a road or highway. A head-on collision between vehicles, a pedestrian being struck by a car, a collision with roadside objects, or losing control and plunging into a ditch are all considered road accidents. Such incidents profoundly impact individuals, families, communities, and the economy. In Bangladesh, road accidents are alarmingly frequent.\nBangladesh, a rapidly growing nation, faces a significant risk from road accidents, which also hinder economic growth. Traffic accidents have become a common headline in newspapers. Every day, 22 road accidents occur in Bangladesh, adding up to around 7,500 annually. Each year, traffic accidents claim 24,000 lives, while approximately 65 people are injured daily. The main causes of accidents include reckless driving, speeding, driver fatigue, risky overtaking, defective vehicles, poor pedestrian awareness, and adverse weather conditions.\nAddressing this crisis requires a comprehensive strategy. Measures could include stricter vehicle inspections, mandatory driver training, improving traffic management, advanced traffic signals, technology-driven safety innovations, and public awareness campaigns. Enforcement of road safety laws is also crucial.\nRoad accidents have become a national epidemic, claiming countless lives under the guise of \"development.\" While it may be impossible to eliminate accidents entirely, their frequency and severity can be reduced. Beyond planning, the government must prioritise sustainable infrastructure and effective traffic management to save lives.\nShetu Khanam\nDepartment of Public Administration\nIslamic University, Kushtia\narifasetu1727@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ensuring road safety",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ensuring-road-safety-1759329862",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-10-2025"
    }
]