[
    {
        "full_article": "The U.S. decision to impose sanctions on a United Nations Special Rapporteur for her criticism of Israel’s war in Gaza has been called a “dangerous precedent” by the UN and top UN Human Rights Council officials. The comments followed U.S. Secretary of State Marco Rubio’s announcement that Francesca Albanese, a “Special Rapporteur on the situation of human rights in occupied Palestinian Territories since 1967”, would face restrictions as a result of her engagement with the International Criminal Court (ICC). The ICC has already been sanctioned by U.S. President Donald Trump in an executive order, shortly after he took office. While the scope of the sanctions are still unclear, they are understood to include travel and visa bans, and possible asset freezes for Ms. Albanese, who has drawn American ire with a report in June that urged international organisations to prosecute corporate entities and multinationals whose work helps fund the war. Ms. Albanese has frequently accused Israel of conducting the “cruellest genocide” in Gaza, as well as its takeover of the Gaza Strip. She has also been calling for scrutiny of the “Gaza Humanitarian Foundation”, a U.S.-Israeli NGO. The U.S. actions have no doubt been spurred by Israeli Prime Minister Benjamin Netanyahu’s latest visit to Washington, where he announced that his government would nominate Mr. Trump for the Nobel Peace Prize.Amidst the rising death toll in Gaza and no ceasefire or deal for the return of Israeli hostages in sight, Washington’s focus on a UN official is absurd and outrageous. Ms. Albanese’s work is mandated by the UN Human Rights Council, and the U.S. actions undermine the global multilateral world order by calling those actions criminal. It is irrational to hold her responsible for the warrants and orders issued by the ICC and the International Court of Justice, which have heard testimonies from representatives of at least 40 states and international organisations on petitions calling for action against Israel. Mr. Rubio’s contention, that Ms. Albanese should be sanctioned for engaging with the ICC to prosecute U.S. and Israeli nationals “without the consent of those two countries”, is not legally valid. Further, his allegations that she “has spewed unabashed antisemitism [and] expressed support for terrorism” are not borne out by facts. As global outrage over Israel’s killing of Palestinians, and the U.S. support for those actions, grows louder, as well as the BRICS summit condemnation this week, that India too joined, it is time for the U.S. to look in the mirror. The need is to effect an immediate ceasefire, and not in bringing the considerable might of the most powerful country to bear over one individual, in order to silence her voice.\r Published - July 12, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        non government organizations (NGO)\n                    \n                            /                      \n                        \n                        award and prize\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        international court or tribunal",
        "headline_1": "​Silencing a sane voice: On U.S. sanctions against UN Special Rapporteur Francesca Albanese",
        "headline_2": "U.S. sanctions against a UN official are dangerous and absurd",
        "link": "https://www.thehindu.com/opinion/editorial/silencing-a-sane-voice-on-us-sanctions-against-un-special-rapporteur-francesca-albanese/article69801090.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "English medium education is an aspiration for many Indians, but state policy regarding the medium of instruction has been uneven across time and regions. The ongoing language debate in India, which stems from the renewed efforts of the Bharatiya Janata Party to enforce a three-language policy, has many components, the medium of instruction being one. Educationists generally argue that instruction in the mother tongue helps children achieve better learning goals in their early stages of development. This view is supported by pedagogical research, but it cannot, and does not, operate in isolation from other factors such as constitutional rights and ground realities. India’s linguistic diversity and distribution is such that even the question of what is a child’s mother tongue can often be a contested one. There is also the constitutional question of freedom of expression and choice. In 2014, after a protracted legal tussle, the Supreme Court of India held that a Karnataka government order of 1994 that made instruction in Kannada mandatory until Class four was not valid under the Constitution. For, children have a right to choose, and the state cannot enforce its view on what is good for them. The rights of private educational institutions to offer education as per market demand is another related issue.The National Education Policy that is being aggressively pushed by the Centre has a particularly anti-English edge, which is not in line with popular aspiration. Many States that want to promote their local language and culture also want to promote English education and English as a medium of instruction. In Karnataka, Andhra Pradesh, Kerala and Tamil Nadu, there are aided English medium schools. The demand for English medium education is growing — this includes the Hindi-speaking regions — which is met largely by substandard and expensive private institutions. English skills help individuals and the country in gaining a place in the global services sector. India’s subaltern caste groups in particular seek to empower themselves through English education, which remains a currency for upward mobility. If state schools do not offer English medium instruction, relatively richer families could still access it through private schools. In this context, education becomes a continuing reproduction and even aggravation of social inequalities, which is the exact opposite of its purpose. The fact is that knowledge of English is empowering and convertible for other outcomes. There can be a debate on whether it should be the medium of instruction at the primary level, but a basic test of any policy is in how it advances the ambitions of the most disadvantaged sections.\r Published - July 12, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        education\n                    \n                            /                      \n                        \n                        English\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Kerala\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        language",
        "headline_1": "​English dreams: On language debate and English medium education",
        "headline_2": "Imposing any language as the medium of instruction is unacceptable",
        "link": "https://www.thehindu.com/opinion/editorial/english-dreams-on-language-debate-and-english-medium-education/article69800752.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "Ferrero buying Kellogg isn’t just a business story\nLast year, Indians abroad sent home $129bn, a record. And on Thursday, Italian candymaker Ferrero announced it would buy US cereal giant WK Kellogg for $3.1bn, which is not a record – not even close – for the acquisition of a brand. Brit firm Vodafone’s $190bn acquisition of German firm Mannesmann in 2000 remains on the podium after 25 long years. And America Online’s ill-advised $182bn acquisition of Time Warner the same year remains equally gasp-worthy. Both outstrip Indian remittances by an enormous margin, without factoring in inflation, or involving 35mn-plus emigrants. \nThat is the power of brands, and a country that creates conditions for them to thrive is well on its way to becoming a winner. In the Cold War, US and USSR were evenly matched nukes-wise, but US had a phalanx of brands, from Coke to Boeing, while the Soviets said nyet to their own Lada.\nLet’s be clear – brands aren’t things. There were scooters, and there was Vespa; razors, and Gillette; denims, and Levi’s. Brands have an X factor that makes them desirable beyond borders. Jaguar and Land Rover were British cars, but so desirable that American Ford bought them. And when Ford fell on hard times, India’s Tata Group took over. So, a brand’s value transcends not only the physical product but also the balance sheet. India has brands, of course, but they are national-level players, inter-district champions. We need some Olympians.\n\n",
        "headline_1": "Name theory",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/name-theory/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "Movies caught between censors, govts, courts \nEvery case is different. Punjabi Sardaarji 3: The price it pays for starring a Pakistani actress is forgoing an India release. Never mind that they made it before Op Sindoor, Indian producers lose out. Malayalam Janaki vs State of Kerala:  CBFC decides the titular character suffering traumatic experiences causes grave offence to religious sentiments, because Janaki is another name for Sita. A name tweak is negotiated. Punjabi-Hindi Punjab 95 is a biographical film that has been hanging fire at CBFC since 2022. Its director says that the 127 cuts demanded will make it CBFC’s film, not his. Hindi Udaipur Files: This one was kosher with CBFC but on the eve of its-pan India screening, Delhi high court enabled the objectors to make their case to central govt.\nSo, every case is the same. In India, any hurt-sentiment lobby can derail any film. Courts and govt cannot be relied on to deliver on freedom of expression guarantees. Worse, the statutory film certification body itself is often stepping up to do derailment. Sometimes, its ‘decency and morality’ obsession is reminiscent of Orwell’s 1984 where a Ministry of Truth is constantly un-personing people for thoughtcrimes. At other times, its hatchet jobs remind observers of the ‘blind and aimless fury’ of Lewis Carroll’s Queen of Hearts. Basically, CBFC is carrying on its job too much in tandem with its British Raj roots a hundred years ago. As if in a bizarre transference of the white man’s burden.\nFrom Trump’s tariffs to digital disruption, India’s film industry faces plenty of threats from outside India. At least stop clipping its wings at home. Stop forcing the taste of a few on all. Why assume that citizens are more thoughtless than the censors?\n\n",
        "headline_1": "They all say cut",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/they-all-say-cut/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "In wanting full explanations, people are disengaging with truth\nMathematician and epidemiologist Adam Kucharski in Proof: The Uncertain Science of Certainty sets out for readers “why it is crucial to find better ways to trust the things we cannot explain…and…explain the things we do not trust.” \nThere’s little that’s self-evident truth. People need, crave proof. A lack of explainability bothers them. Many things are difficult to explain, simply because there may be no straight answer to the ‘why’ of it. That’s why, as more and more scenarios turn complex – scientific modelling to politics to Covid to AI – predictions are replacing explanations. \nMany explanations to the ‘why’ of things only explain the ‘how’ of it. Take general anesthesia. Or heart defibrillation. Or Lincoln setting out equality as a goal for a country to be created. Or vaccines for Covid. We know what anesthesia or heart defibrillation does, but why a combination of drugs makes a person unconscious or why an electric current restores a heartbeat is not all clear. \nLincoln framed equality as a goal, when slavery was still in vogue. Instead of framing equality as a self-evident truth, Lincoln framed it as a proposition proved in building the nation. Equality remains a notion that’s flexible, wrought through amendments to laws that are proof of equality. So Lincoln taught himself from Euclid’s The Elements: The idea that mathematics has absolute answers, even if an illusion, made for powerful rhetoric. \nIn the vacuum of things unexplained, conspiracy theories take shape. When the science is patchy or complex, conspiracy theorists are driven to extremes, believing there is “no such thing as a coincidence”. The danger, in Henri Poincaré’s words, is “to doubt everything or to believe everything are two equally convenient solutions; both dispense with the necessity of reflection.” \nKucharski fears people are disengaging with truth in today’s climate of almost excessive doubt, argues that the gap between what’s happening and why it’s happening has to be bridged. What can be done to speed up the process of proof in a world of noisy data and noisier opinions? Making a plea for the value of rigour and logic, Kucharski says much of modern science is stuck in rote learning, whereas scientific evidence should be about tools, not rules. The toolkit is contradiction, construction, contraposition. \nScience is dynamic, and proof ever evolving. “Even mathematical notions of proof” are “not always as robust and politics-free as they might seem.” That’s why it’s essential to embrace uncertainty, balance-rebalance beliefs. To understand how ‘proof’ works, and the concept of it, it’s important to understand errors and biases. The need for total proof can be dangerous in a crisis – some level of scientific evidence may demand certain action but the inaction in waiting for more ‘proof’ can prove costly. \nProbability quantifies uncertainty. Covid highlighted the need to understand such ‘uncertainty’. Were lockdowns effective? Did vaccines work? How to prove what Delta’s rise may mean in coming months? Kucharski says Covid showed how politicised science was – search for scientific truth collided with the urgency of decision-making. Questions arrived quickly, answers weren’t instant, and the evidence wasn’t deemed enough for policy tweaks. Was Delta more transmissible? What was the extent of the link between social contacts and transmission? What was the proof? The book argues that in navigating the noise of data, it’s essential to keep the questions open. Leave room for, and learn to be comfortable with, uncertainty, doubt.\n\n",
        "headline_1": "Why 100% proof is an illusion",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/why-100-proof-is-an-illusion/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "Calling it a ticking “water bomb”, Arunachal Pradesh CM Pema Khandu has flagged China’s planned 60GW mega dam near India’s border, as an existential threat to his state’s tribes and livelihoods. It’s not a new fear in India’s northeast that Beijing’s hydrological ambitions on Yarlung Tsangpo, known as Brahmaputra in India, could turn catastrophic.\nKhandu also lends deeper context to Assam CM Himanta Biswa Sarma’s recent, almost sardonic dismissal of the Pakistan warning, that India would be in trouble if China turns off the Brahmaputra tap like India has suspended IWT. Sarma said that if China were indeed to halt or divert Brahmaputra’s flow, it would only benefit India’s northeast. This was a political jab at an old rival. It also hinted that India’s real water conflict lies with China, not Pakistan.\nRead full story on TOI+\n\n",
        "headline_1": "Who’s the Big River Daddy?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/whos-the-big-river-daddy/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 12, 2025 00:00:00  \nThe importance of the capital market, which acts as a bridge between the savers and those looking for capital such as businesses as well as governments, cannot be overstated. In fact, it helps channel savings into productive investments. Unfortunately, in Bangladesh, the general investors are yet to consider the stock market as a reliable place where they could get expected returns on their investments. A major failure of the country's stock markets is that they could not encourage most privately-owned companies with good fundamentals to participate for long-term financing. Many are of the view that the cumbersome listing process, conservative pricing mechanism for Initial Public Offerings (IPOs) --- through which a privately-owned company offers its shares to the public for the first time- over-regulation, etc., are factors discouraging potential entrepreneurs. Also, a non-transparent secondary market, lack of action against market manipulators, high cost of compliance which is higher than the tax benefits offered against listing, etc., are among the major obstacles to the growth of the capital market. So, entrepreneurs prefer easily accessible bank loans for capital to going for the time-consuming IPOs. \nThese issues of concern again came up at a recently held seminar styled, 'Expansion of the capital market: A framework for sustainable economic growth'. Speakers which included some leading business houses of the country, representative of the securities regulator and experts on the subject expressed their views on the prevailing conditions in the country's capital market and their concerns. Businesses do not join the stock market just for the fun of it or out of corporate social responsibility. They would look for any comparative advantage they might gain from joining the capital market. Managing director of the Apex Footwear Limited, a leading manufacturer, exporter and retailer of footwears in Bangladesh, for instance, dwelt at length on the stumbling blocks to the growth of the country's capital market. The existing capital market with a few scrip dividends on offer calls for urgently improving the market's depth. It must ensure adequate liquidity and foster ability to handle large transactions with minimum price fluctuations. An important point of disadvantage for the potential entrepreneurs is that here valuation of IPO is done on the basis of a company's net asset value (NAV). Actually, far from being dictated by the market, the securities regulator fixes the price of the primary shares. \nAs a result of the NAV-based IPO valuation, which experts at the said seminar viewed as flawed, companies as large as the Uber will have zero value as they will have no assets, according to the definition of NAV. This is ridiculous. Notably, Uber is a global technology company providing services including app-based ride-sharing, cargo transportation, etc. Another drawback of the local capital market is the lack of buyback provision through which a company may like to exit from the market. This is done by way of a listed company's purchase of its outstanding stocks thereby reducing the number of its shares in the open market. Through this measure, companies control the supply of their shares in the market to increase their value. Since the practice of buyback is global, capital markets here needs to make allowance for such facility for the participating companies.\nAlong with the fact that many well-meaning entrepreneurs are not joining the country's stock markets, the general investors, too, are not showing much interest in those, thanks to the manipulators' control over the capital market. Thus investors need to be educated about the basics of the secondary market so they might consider it a profit-only trade or be cheated by manipulators. Emphasis should be on establishing good governance, efficiency and transparency in the capital market. Only then can the hearts of both common investors and sound businesses can be won, a precondition for ensuring capital market's growth.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Capital market calls for massive reform",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/capital-market-calls-for-massive-reform-1752245299",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       July 12, 2025 00:00:00  \n\nHow profoundly examination systems shape students' intellectual and personal growth is no common knowledge. But meaningful reforms in student assessment can work wonder. Today's education system in Bangladesh is the last thing to produce confident, articulate individuals. As students graduate from secondary school, higher secondary or even university, it becomes clearer that while many perform well in written exams, most struggle while expressing their thoughts beyond rehearsed answers. The moment they encounter questions requiring genuine thinking rather than textbook repetition, their struggling words or silence reveal a deeper problem beneath the surface. \nA number of students in Bangladesh enter the workforce right after finishing their secondary education while some seek employment overseas even earlier. Whatever their route, they quickly realise that their time in school and madrasah did not adequately prepare them for the demands of the real world. An excessive focus on learning by rote at the expense of the development of clear communication skills holds them back in viva examinations, job interviews or even basic professional interactions. As a result, the burden of mastering these skills falls entirely on them, often too late and under significant pressure. It is concerning that in an era where communication is more crucial than ever, secondary and higher secondary education systems largely neglect this vital area of development. Viva examinations are introduced only at the university level, by which time the opportunity to build foundational confidence is often lost. \nLanguage proficiency rests on four pillars: reading, writing, listening and speaking. International assessments like the IELTS evaluate all four. But classrooms in Bangladesh focus almost exclusively on the first three. Students read textbooks, listen to lectures and demonstrate their knowledge through written exams. The fourth pillar, speaking, is left almost entirely to chance. Almost always there are no structured platforms for students to develop verbal communication, whether in Bangla or English. The consequences of this neglect are visible on both national and international stages. For instance, Bangladeshi cricketers, despite their talent on the field, often struggle with post-match interviews, a consequence of an education system that undervalues verbal skills.\nSpeaking, like reading and writing, is a skill that improves with regular practice. Students who engage in structured speaking exercises are more likely to communicate with confidence and composure when the situation demands it. This is precisely why the education system must prioritise developing speaking skills in both Bangla and English language, as this will serve students throughout their lives. \nThis naturally leads to an important question about how such change can be effectively implemented. There is a surprisingly easy and useful way to do this and, importantly, it does not require any curriculum change. The trick is to introduce bilingual viva voce examinations, in Bangla and English, beginning with grade six and weigh them at 20 per cent of total marks. This straightforward adjustment would have a ripple effect to help students cultivate verbal proficiency from their formative years. \nIt is no secret that top-performing schools in the country are known for setting challenging question papers. This indicates that expectation of difficulty pushes students to prepare more thoroughly, ultimately enhancing their performance. Introducing an additional mode of evaluation -- the viva exam -- would have a similar effect. Students would then need to articulate answers in their own words, which means they will have to internalise knowledge as they cannot get away with simply parroting textbook content. Unlike written tests, viva requires active engagement with the subject matter, compelling students to think critically and respond spontaneously. Examiners can ask follow-up questions to clarify doubts and challenge students to justify their reasoning. Crucially, this involves direct, face-to-face interaction with their teachers. This interaction tests not just what students know, but how they apply knowledge and analyse problems. For example, explaining the 1947 Partition of Bengal aloud requires linking political, religious and economic factors into a clear and coherent narrative.\nFurthermore, regular exposure to viva exams from an early age would help reduce the anxiety typically associated with such assessments. The idea of speaking before an examiner may seem intimidating at first. But viva exams are also opportunities for examiners to support students by rephrasing questions, offering prompts and easing nerves. This interactive element makes the assessment process more humane and less mechanical. With time, students grow more comfortable and become better equipped to handle such stressful situations with composure.\nThe parental influence in this context presents a significant advantage. Parents naturally want their children to succeed and tend to focus on written exams, as these are the primary measure of academic performance. If spoken assessments were formally introduced from Class VI to Class XII, parental attention would extend to verbal skills as well. This would further enhance students' confidence and overall fluency. \nA lack of emphasis on speaking skills has economic consequences. Struggle by the Bangladeshis in speaking English is well known and it carries a tangible cost. In the Middle East, for example, Bangladeshi expatriates often work harder yet earn less than their counterparts from other South Asian nations, largely because of weaker English communication skills. Even within Bangladesh, the highest executive positions in industries such as the garment sector frequently go to Indian or Sri Lankan professionals, not necessarily because they are more skilled but because they possess superior verbal communication abilities. Despite the abundance of students achieving top grades in SSC and HSC exams, their limited ability to communicate effectively in English, or even in Bangla, acts as a barrier to career advancement. \nThe negative consequences of neglecting speaking skills are undeniable. Any education system must equip students to use words as effectively as they now use pens. It is entirely possible to build a system that encourages students to effectively articulate ideas, present arguments and persuade with clarity. All it takes is a simple adjustment to the method of assessment.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why viva voce for secondary education is needed",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-viva-voce-for-secondary-education-is-needed-1752245346",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       July 12, 2025 00:00:00  \n\nOne of the most significant outcomes of the student-led mass uprising in July last year has been the substantial improvement in the media space, providing a much-needed breathing space for the mass media and opening the window of professional journalism to a large extent. While the freedom of the press is not yet fully guaranteed since the fall of the Hasina regime on August 5 last year, the situation has undeniably improved. It has become significantly easier to express opinions or raise questions on various issues, marking a positive step forward in the journey towards press freedom. \nDuring the 15 years of the autocratic regime of Hasina, it had become gradually difficult for the Press to work independently and professionally. The regime systematically imposed various barriers to curb freedom of the Press, which drove the mass media to adopt self-censorship for their survival. Although the ousted regime allowed a large number of new newspapers and television channels in the name of media freedom, most of these were assigned to support the regime's actions and misdeeds. The rise of pro-regime mass media, backed by the state, has become a significant obstacle to a free Press. \nThe pro-Hasina media appeared as a big tool to suppress the truth and the misdeeds of the autocratic regime, which included human rights abuses, corruption, and political repression, and counter the other media that have tried to do journalism as professionally as possible. In this process, a good number of senior and leading journalists appeared as hard-loyalists of Hasina and political activists of the Bangladesh Awami League, the party in power at that time. Thus, they have contributed to distorting the media and undermining the values and ethics of journalism. \nNow, in a changed environment, it is also not easy to bring the mass media into order and restore the ethical practice of journalism. To achieve this, the Yunus-led interim government formed the Media Reform Commission in November last and the commission submitted a comprehensive report in March, this year. The commission conducted a wide range of consultations with various stakeholders and reviewed proposals presented by different parties. The commission also examined some of the best practices in other countries and attempted to align the relevant recommendations with them. Through a comprehensive review, the report assesses the current state of the newspaper and electronic media in the country, identifies various flaws and problems within the industry, and ultimately provides a set of recommendations to enhance the overall condition of the press. \nNow, the implementation of the recommendations is subject to scrutiny first. It is also understandable that the government can't implement all the recommendations. Some of the suggestions may be implemented immediately or within a short time. Again, some are subject to implementation in the medium and long run. Additionally, some will never be implemented. The interim government may move to implement the recommendations that can be implemented immediately and also initiate the process of implementing some others. Before starting the implementation, the government needs to bring the media houses on board, which is also not an easy task. \nFurthermore, it is crucial to note that the country's journalist unions, associations, and organisations have yet to comprehensively review or discuss the commission report. This lack of thorough review and knowledge-based debate among media people is contributing to some misunderstandings about the reform proposals. It is imperative that these organisations, along with those working in the media or interested in journalism, come forward to review the report. Their active involvement is essential for a successful and comprehensive reform of the media landscape.\nIf journalists lack interest in reforming the media or are content with the status quo, they will be compelled to compromise their professionalism further. Ethical values of journalism will also be damaged to a greater extent. Though any reform is a painful process, in the greater interest of the mass media, some measures are necessary as recommended by the commission. From restricting cross-ownership to abolishing repressive laws, all these measures may bear fruit in the long run, provided that media personnel feel a unified sense of urgency to move forward. Differences of opinion regarding the acceptance and implementation of the various recommendations already exist, and this is not a problem. The core challenge is the start of the reform, which involves implementing only a few of the recommendations in the first phase.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Media reform and journalism",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/media-reform-and-journalism-1752245409",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 12, 2025 00:00:00  \n\nMental health, like physical health, is an essential part of leading a good and meaningful life. Yet, it is overlooked, especially among youth at universities. At Jagannath University (JnU), mental health support centre exists only on paper. \nToday, university students face immense pressure due to academic requirements as well as personal struggles such as financial stress, family issues, housing problems, relationship difficulties, and poor exam results. These factors contribute to growing mental fatigue, leading to anxiety, depression, panic attacks, and in extreme cases, suicide. Some students become so overwhelmed that they lose motivation even to attend exams, which further complicates their academic journey.\nTragically, in just the first four months of this year, four students from Jagannath University have taken their own lives. While the university does have a mental health counselling centre, it is woefully under-resourced. There are not enough trained mental health professionals, nor is there a strong support system in place. As a result, students are often forced to seek help from costly and time-consuming private providers.\nThe problem is further deepened by social stigma. Many students are reluctant, or afraid, to speak openly about their mental health struggles. A significant number remain unaware of what mental health truly means or where to seek help.\nThis must change. The university authorities need to take meaningful, compassionate action to support students' mental well-being. Establishing a fully functional mental health centre staffed with qualified professionals, raising awareness, and encouraging open conversations on mental health should be the priorities.\nMishkatul Islam Mumu\nStudent\nDepartment of Mass Communication and Journalism\nJagannath University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Mental health centre in name only",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mental-health-centre-in-name-only-1752245443",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-07-2025"
    }
]