[
    {
        "full_article": "At 50, the G-7 — a grouping of the most advanced economies — should appear robust, cohesive and experienced in managing global conflict. Instead, the G-7 Summit and Outreach session in Kananaskis, Canada presented a disunited and ineffective force in the face of some of the most testing conflicts including an escalating Russia-Ukraine war, the Israel-Iran strife and Israel’s ceaseless bombardment of Gaza. In addition, it has been unable to deal with the biggest disruptor in global trade — that of the U.S. Trump administration’s reciprocal tariffs worldwide. This year’s G-7 was rocky from the start as host Canada saw an unexpected election just months before the summit. The government of Mark Carney was still finding its feet, which meant leaders such as Prime Minister Modi were invited just days before the summit. Upheavals in U.S. foreign and trade policy have also caught the grouping off-guard: U.S. President Donald Trump’s pivot to Russia on the Ukraine crisis, and ambiguous approach to China have been particularly noted. In Kananaskis Mr. Trump even suggested that the G-7 become the “G9, including Russia and China”, much to the chagrin of other leaders, including the Ukraine President, who was a special invitee. Mr. Trump’s volte face from proclaiming to be a “Peace-time President” to actively supporting Israel’s aggression was another issue. The U.S. refused to sign on to a draft statement by G-7 members that called for a de-escalation or any criticism of Israel, and pushed for a statement that condemned Iran. Mr. Trump’s early exit dealt another blow. Eventually, the G-7 was unable to issue a joint statement on key issues, and a Chair’s Summary was issued to deal with the crises at hand, along with statements on less divisive issues such as AI and quantum computing, critical minerals supply chains, wildfire and prevention, and transnational repression, but not on terrorism, as India had hoped.Perhaps the most productive part of Mr. Modi’s trip was his meeting with Mr. Carney, and the decisions to restore Indian and Canadian High Commissioners, and to reset ties ruptured over the Nijjar case. However, the Carney government has not demonstrated any change in its position on the case or on action against Khalistani extremism. Moreover, the G-7 statement on Transnational Repression (TNR) does not name any country, but is pointed in its reference to allegations of foreign interference and TNR made by Canada against India, as well as China, Russia and Iran. Given the outcomes, the government must review the utility of India’s participation in the G-7 process. To have the Prime Minister travel more than 11,000 kilometres to address one outreach session of a fractious summit may not be the most optimal use of India’s resources. Published - June 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        G7 summit\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        France\n                    \n                            /                      \n                        \n                        Germany\n                    \n                            /                      \n                        \n                        Italy\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Mexico\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        Ukraine\n                    \n                            /                      \n                        \n                        Artificial Intelligence\n                    \n                            /                      \n                        \n                        computing and information technology\n                    \n                            /                      \n                        \n                        critical minerals\n                    \n                            /                      \n                        \n                        fire\n                    \n                            /                      \n                        \n                        human trafficking\n                    \n                            /                      \n                        \n                        migration\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        Iran",
        "headline_1": "​Failed summit: on the G-7 summit in Canada",
        "headline_2": "India must reassess the usefulness of attending G-7 meetings",
        "link": "https://www.thehindu.com/opinion/editorial/failed-summit-on-the-g-7-summit-in-canada/article69709879.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "The Sixteenth Finance Commission (SFC), whose recommendations on financial devolution will be valid from April 1, 2026, faces a piquant situation. Its chairman Arvind Panagariya had noted last week that 22 out of 28 States, including many ruled by the Bharatiya Janata Party (BJP), had asked for a larger share of the divisible pool of tax collections, from 41% to 50% — a legitimate demand. The Union government has effectively shrunk the divisible pool by disproportionately increasing its revenue through non-shareable cesses and surcharges, whose share of the Centre’s gross tax revenue soared from 12.8% between 2015-16 to 2019-20 (pre-pandemic years) to 18.5% between 2020-21 and 2023-24 (Budget expenditure). Thus, the effective share of States in the Centre’s gross tax revenues averaged close to 31% in the 2020-21 to 2023-24 period — it was 35% in the previous corresponding period. Compounding this is the post-GST reality, where limited avenues for States to raise their revenue, make them critically dependent on central transfers. While GST collections have been fairly good in recent years, this has still not addressed the issue of the reduced avenues for States to increase their revenue. Further, the existing formula for horizontal devolution, with a heavy weightage given to population and income distance, is seen by economically progressive States (the South), as a penalty for performance and responsible governance.Keeping the status quo would go against the grain and the idea of cooperative federalism that the BJP-led government has emphasised. Mr. Panagariya also remarked that a sudden nine-point jump to 50% would “[upset] too many carts”, indicating that the Centre would be loath to lessen its share because of rising expenditure on defence and other capital-intensive projects. This means that the Finance Commission would be less inclined to engage with States’ demands, also explaining why it might keep the devolution share unchanged at 41%. Yet, doing so would be a missed opportunity to forge a new federal compact. A modest increase in the vertical devolution, meeting States’ demands half-way, would be a welcome signal. The Finance Commission must also recommend a mechanism that will rein in the arbitrary use of cesses and surcharges, maybe even capping them at a fixed percentage of the gross tax revenue of the Centre and including any surplus collection in the divisible pool, as some have suggested. It must fine-tune the horizontal distribution criteria to create a more equitable balance between a State’s needs, its area, and its performance. Crafting a formula that is fiscally prudent and one that strengthens the federal structure at its roots, the States, is imperative. Published - June 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        finance (general)\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        taxes and duties",
        "headline_1": "​A fair share: on divisible pool of tax collections",
        "headline_2": "Retaining the 41% share in the divisible pool for States will be unjust",
        "link": "https://www.thehindu.com/opinion/editorial/a-fair-share-on-divisible-pool-of-tax-collections/article69709903.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "Freedom of repression is now fundamental right\nOnly gums used to be sensitive. But people with this condition were unfortunate exceptions. Now it’s become endemic like cholera was, or dengue is. Like it or lump it, you have to live with it. In fact, if you aren’t sensitive to sensitivities you might even end up dying of it. Forget lotus, our national flower should be mimosa. With this difference. Mimosa shuts itself up to save itself from predators. In our case, perceived enemy has to shut up to prevent being eaten by self-perceived victim, who then transmutes into an inhuman Venus fly trap. And, like an assassin’s instruction, proceeds to ‘terminate with extreme prejudice’.\nClinical sensitivities can be identified through trial and error or lab tests. Once you know the trigger, you avoid it. However, our national malaise is idiopathic, unleashed by random causes. It has created a whole new paradigm. Formerly people said, ‘Today I’m going to be patient, whatever the provocation.’ Or ‘Today I’m going on a diet, whatever the provocation.’ Now this idiot condition makes them say, ‘Today I’m going to be sensitive, whatever the provocation.’ It’s a bit like ‘He’s discovered the foolproof cure, now he’s looking for the disease.’ Fool!\nIt’s not that people were all all-accepting in the past. But they simply dashed off a Letter to the Editor. They didn’t dash off to the police station to file an FIR. Seriously, if cops weren’t so busy chasing these absurd criminal cases, they might catch real criminals. Instead of restoring a sense of balance, the scales of justice seem to be tipping in favour of hypersensitive offendees. Like the honourable judge who, in the Kamal Hasan case, inadvertently opened the floodgates by saying, “There are three things people are very emotional about: jala, nela, bhasha, (water, land, language).’ Surprisingly, or maybe wisely, he left out today’s main offendee, religion. Hey, that used to be more feely than touchy – sensitive to others. Now it’s only about Mine. Even if many of the ‘mine’ on whose behalf these senselessly sensitive guys shriek and sue are, excuse us, quite happily unoffended.\n                                        ***\nAlec Smart said: “Now Pune. Bodies fall; no heads roll.”\n\n",
        "headline_1": "Touch-me-not nation",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/touch-me-not-nation/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "Tata’s airline faces many serious questions, even if DGCA has cleared its Boeing 787 fleet\nDGCA’s clean chit to Air India’s Boeing 787 fleet will partly soothe nerves strained by last Thursday’s AI 171 crash. India’s worst aviation disaster this century killed 241 fliers and at least 29 people on the ground. As old whistleblower concerns about the 787 ‘Dreamliner’ resurfaced, the crash seemed like a chronicle of deaths foretold. But the aviation watchdog’s scrutiny of AI’s 787 fleet has not found “any major safety concerns”. That said, AI’s numerous Dreamliner flight cancellations – 66 in the first five days after the crash – raise questions. While some were on account of airspace restrictions, technical problems were blamed in the rest. Coming so soon after the crash, each new snag is one too many. It’s also a reality check for CEO Campbell Wilson, who claimed in an interview two weeks ago: “The heavy lifting is done.”\nIn the airline business, ‘heavy lifting’ isn’t merely about getting people from point A to point B. AI in its state-owned avatar did that, with bumps and scowls on the way, and accumulated debt of over 60,000cr. The whole point of the Tata takeover was to make the airline friendlier, safer and profitable. It’s been 41 months since, but AI is still beset with “teething troubles”. DGCA data for Jan-Aug 2024 showed AI had 12x more complaints than rival IndiGo, per 10,000 passengers.\nAnd headlines this year haven’t been encouraging either. A minister stuck in a sagging seat, passengers stranded in a plane without air conditioning in 41°C heat, choked toilets on a Chicago-Delhi flight, and now a picture of a door sealed with paper napkins on a Delhi-Hong Kong flight. None of these suggest the “top-class airline” that group chairman N Chandrasekaran talked about in Jan.\nSome of this is down to poor crew training – recall how DGCA pulled up AI in 2023 for failing to report a drunk passenger who urinated on another. Some issues can be pinned on inadequate maintenance, given the demand for seats and shortage of planes. But who can say whether delayed service will shut down in-flight entertainment or a turbine? There are growing murmurs about too many ‘MEL (minimum equipment list) releases’ – flying with some equipment out of order, which should be an exception, not the norm. And questions have also been raised about the quality of AI’s periodic pilot training. Nobody doubts AI’s growth potential. In a duopoly, in the fastest growing major aviation market, growth is inevitable. But pursuit of the inevitable is not ambition – excellence is. \n\n",
        "headline_1": "Eye on AI",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/eye-on-ai/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "Why can’t India fix its medical education so that youngsters aren’t forced to go overseas\nIt’s a sad replay of events in Ukraine – 1,500-2,000 Indian students studying medicine in Iran are caught in a warzone. Evacuation has begun. Another 1,200 to 1,500 students are in Israel. Every year, around 25,000 Indian medical students go abroad. Why? Because it’s easier, and the courses cost less. Now that there have been two demonstrations of how geopolitics can upend medical students’ studies abroad, and given that conflicts seem to be the flavour of these times, we must ask whether India’s medical education system is impossible to fix.\nMismanaged | NEET was to bring uniformity and transparency to medical admissions. Set aside debates on whether NEET introduced new problems. The exam spawned another set of coaching factories. The integrity of the test itself was compromised by impersonation of examinees and paper leaks.\nMismatched | On average, 22L – more than the population of Paris – appear for NEET. Around 12L qualified for about 90,000 medical seats. These include about 20,000 management quota seats in private colleges, and NRI seats. That leaves lakhs who have cleared NEET but don’t get admission anywhere. So, they go to Iran, Israel…\nMoneywise | Fees for management/NRI seats can go up to Rs 1.4cr for the 4.5-year MBBS course. Tuition fees in an average private medical college range upwards of Rs 45L-Rs 55L. Contrast this with the 35L expenditure – including on living expenses – for a 6-year MBBS course in a good college in Ukraine, Russia or China. Private colleges have replaced need with greed, making a windfall, as has the NEET coaching industry. The smartest solution is a big jump in govt medical colleges. But govts seem uninterested. How many evacuations will it take for this to change?\n\n",
        "headline_1": "Kyiv to Tehran",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/kyiv-to-tehran/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "DNA tech means remains of AI crash victims will reach their kin. It has also changed the world\nWhen Garuda Airways flight 152 crashed on Sept 26, 1997, many of the 234 fliers were mutilated beyond recognition. Eventually, 48 were interred in a mass grave. Thanks to advancements in DNA matching since then, kin of the Air India crash victims have been spared this pain. At least 135 of the 270 victims – many of them completely charred – have already been identified. Officials hope to complete the task by Wednesday.\nIt’s a measure of technology’s march since scientist Alec Jeffreys found the first genetic fingerprint on Sept 10, 1984. He didn’t discover DNA – that honour goes to Swiss scientist Friedrich Miescher, who made the discovery in 1869, the year Mahatma Gandhi was born. But then, not much happened for the next 115 years. Yes, Watson and Crick figured out DNA’s structure and won a Nobel in 1962, but DNA didn’t have practical uses until Jeffreys’ eureka moment. Within a year, he had helped a boy get British citizenship by establishing a DNA link between him and his parents. The year after, he helped nail the culprit in a double rape and murder case. US caught on in 1986, and by 2013 its Department of Justice was collecting and analysing DNA samples for $40 a pop.\nNow, you can order a DNA paternity test online. Sequencing machines have become tiny – the smallest ones weigh less than a smartphone and cost around $3,000. US troops used one to identify IS leader Baghdadi on their chopper in 2019. Meanwhile, over 40mn people have given DNA samples to private firms to trace their ancestry. In recent weeks, DNA has revealed mix-ups that happened in hospitals in 1940s when newborns weren’t tagged. It’s solved decades-old crimes, and freed innocents who lost their youth in jail. It’s a gift that keeps on giving. \n\n",
        "headline_1": "Connecting people",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/connecting-people/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "The continued intensification of the Israel-Iran conflict since Israel's attack on Iran on June 13 is extremely alarming. One would have hoped that cooler heads would have prevailed by now, and that the international community—particularly the more influential countries—would have united to de-escalate the situation. But far from it, the two countries have continued to exchange attacks, with the use of increasingly sophisticated and destructive weaponry. Meanwhile, not only has the West lent its full and unwavering support to Israel, but there are rumours that the US may become directly involved in Israel's attacks on Iran, further increasing the risk of drawing other powers into the conflict.\nBeyond the deaths and destructions on the grounds, the conflict has already begun to exact a far wider regional and global toll. Oil and energy prices have shown significant volatility, and supply chain disruptions may soon have further negative impacts on an already weakened global economy. On top of that, with US President Donald Trump warning people to evacuate Iran's capital, Tehran, and Israel intensifying its targeting of the city, foreign nationals—including diplomats—have been put in harm's way. Among them are about 400 Bangladeshis, including embassy officials, staff members, and their families. Reportedly, amid growing threats of targeted strikes, Bangladesh's ambassador to Iran has been forced to leave his residence in Tehran and take shelter in a more secure location. And after the residence of at least one Bangladeshi embassy official was destroyed, all Bangladeshi nationals have left their previous locations and taken shelter in various parts of the city.\nDespite this relocation, it is clear that Bangladeshi nationals in Iran, numbering around 2,000, continue to face grave threats. India has already managed to relocate its citizens to safer areas within Iran. Pakistan has opened its border with Iran, giving Pakistanis wishing to leave a way out. China, too, has successfully evacuated its nationals. Therefore, our government also needs to consider the best course of action to ensure the safety of Bangladeshis there. If necessary, it should reach out to other governments or actors that can either help ensure their safety or assist in evacuating them.\nBut until this conflict is brought to an end, its impact will continue to escalate, with increasingly dire consequences not only for the region but for the world as a whole. Recognising this, all other countries must refrain from engaging in any acts of aggression, and must also engage with Iran and Israel and convince them to cease all attacks against each other. The international community must not allow this conflict to spiral any further.\n",
        "headline_1": "Bangladesh must act swiftly to protect its citizens in Iran",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/bangladesh-must-act-swiftly-protect-its-citizens-iran-3920201",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "The Middle East has seen its share of flashpoints. But what unfolded on June 13—when Israeli forces carried out sweeping airstrikes against Iranian nuclear sites—marked something else entirely. It was not just an exchange of fire but a shift in the architecture of power in the region. Iran was hit hard. Israel doubled down. And through the dust, Russia didn't flinch. It didn't intervene either—at least not visibly. But that doesn't mean it was passive, far from it.\nMoscow's moves these days aren't meant to draw headlines. They're designed for the long haul. And if there's a central thread running through the Kremlin's posture on the Iran-Israel standoff, it's this: the conflict may be regional, but the stakes aren't.\nBack in January, well before missiles flew, Russia and Iran signed a sweeping 20-year pact. Not just symbolic—not some dusty memorandum left unread in a drawer. This was a clear statement of alignment. Trade. Defense. Energy. Technology. Even cultural exchange. Almost everything was on the table.\nNeither side needed to spell it out, but the subtext was loud enough: both countries, boxed in by Western sanctions, were done playing inside a system built without them. Putin called it a \"breakthrough,\" though he kept the delivery calm. Tehran was equally deliberate. This wasn't about noise. It was about building something that could last, not just to weather pressure, but to bypass it altogether.\nAnd it's working, at least economically. It's not headline-grabbing by global standards, but that misses the point. The shift is in the direction, not the scale. Two countries once on the defensive are now crafting their own rules.\nIf Russia's relationship with Iran is growing deeper, its approach to Israel remains layered. The Kremlin has worked with Tel Aviv for years—in Syria, in arms coordination, in quiet backchannels. That hasn't changed. What's changed is the tightrope.\nAfter the strikes, Putin made two phone calls. To Iran, he offered condemnation. To Israel, he emphasised restraint. He wasn't exactly splitting the difference; it was more nuanced than that. Russia doesn't want a full-scale blowup between two of its most watched partners. Not now. Not with Ukraine still burning resources at home.\nThe calculus is pragmatic. Conflict in the Middle East distracts Washington and stretches NATO's bandwidth. But too much instability? That's bad for business—and for Russia's limited reach. So, the game is to keep the pot simmering, not boiling over.\nSince 2022, military ties between Russia and Iran have expanded. Missiles, drones, and artillery—the volume and sophistication have increased. Iran's Shahed drones, in particular, have become a staple in Russia's toolbox, enough so that Moscow now manufactures its modified versions.\nBut it's not just about equipment. The partnership is about shared design, production logistics, even maritime coordination. Joint naval drills are now a regular feature, not a novelty. These aren't exercises in solidarity—they're part of a strategy. One that challenges the traditional US-led security framework without necessarily confronting it head-on.\nBoth countries know sanctions aren't going away. So instead of pleading for relief, they're creating workarounds. Direct bank ties. Local-currency trade deals. Integration into regional blocs. Earlier this year, Iran officially joined a free trade agreement with the Eurasian Economic Union, a move that doesn't just lower tariffs, but also signals which way the winds are blowing.\nIn this emerging order, the dollar matters less. So does Society for Worldwide Interbank Financial Telecommunication (SWIFT). What matters more are bilateral mechanisms that reduce friction and signal permanence, especially for other states considering similar paths.\nIt's not flawless. Black markets and barter systems come with risk and inefficiencies. But for countries looking to operate outside Washington's financial shadow, the alternative model—pioneered by Russia and Iran—is starting to take shape.\nThis isn't just about two sanctioned states finding comfort in each other's company. It's about the kind of global order they want.\nIn theory, it's appealing to many, especially those frustrated with what they see as Western double standards. But ideals aside, this strategy is also a hedge. A way to insulate Moscow and Tehran from isolation, while positioning them as leaders of an alternative club.\nNone of this means Russia is invincible in the region. The recent strikes showed that, clearly. Moscow couldn't stop them. Couldn't de-escalate them. And couldn't leverage the moment for gains. Its influence, while wide, has ceilings.\nThe Ukraine war is also draining more than just tanks and ammunition. It's limiting Russia's ability to invest elsewhere and complicating every foreign policy calculation.\nThe Russia-Iran partnership is likely to deepen. The tools are in place. The incentives align. And the shared sense of being kept at arm's length by the West remains a binding force.\nBut staying the course will require more than shared grievances. It will take results—economic, technological, and strategic—that justify the risk. Both countries know this. And both are betting that their alliance, however unconventional, can deliver something the Western order can't: room to manoeuvre on their own terms.\nThat's the bet. The stakes, though, aren't just theirs.\nMd. Ibrahim Khalilullah is vice-president of Bangladesh Law Alliance. He can be reached at [email protected]. \n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Iran-Israel conflict: Russia isn’t just watching, it’s playing the long game",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/iran-israel-conflict-russia-isnt-just-watching-its-playing-the-long-game-3920021",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "We are alarmed by the level of microplastic contamination in our aquatic ecosystems. A recent study has found microplastic particles—smaller than 5 millimetres—in the intestines, liver, and even muscle tissue of hilsa fish. Heavy metals such as cadmium, lead, mercury, and arsenic have also been detected in the fish's body. These particles, originating from plastic bags, bottles, synthetic fabrics, tyres, and cosmetics, are ingested by fish as they make their way into rivers and oceans. This raises serious concerns about food safety in the country as hilsa is a widely consumed fish here.\nPlastic pollution, especially microplastic contamination, has now become a global issue, and Bangladesh seems to be in a more vulnerable state in this regard. Reportedly, between 2005 and 2014, Bangladesh experienced a 169 percent surge in plastic production, which is significantly higher than the global average growth rate of 25 percent. The presence of microplastics is higher in our coastal areas, where fishing boats and cargo ships dispose of plastic waste. Household waste disposal also contributes to this. So, fish in this area tend to ingest a higher amount of microplastics. Several studies have estimated that 10 to 30 billion microplastic particles are discharged into the Bay of Bengal daily through the Ganges River and its tributaries. The impact of this contamination is clearly visible at the Meghna estuary, which is the most important habitat and breeding ground of hilsa fish.\nPrevious research also found the presence of microplastics and heavy metals in hilsa fish from the Meghna basin and the Bay of Bengal. Not only hilsa, other fish and aquatic creatures are also vulnerable to plastic pollution. A 2022 study revealed that 17 species of fish and three species of shellfish from three key rivers in the Sundarbans were contaminated with microplastics. The study estimated that an adult consuming 300g of microplastic-contaminated fish muscle per week would ingest 74,282 microplastic particles annually, while a child eating 50g weekly would absorb 12,380 particles a year. These findings underscore the severity of plastic pollution in our aquatic ecosystems and the risks it poses to both marine life and human health. We need drastic action to reverse the trend.\nUnfortunately, despite the ban on single-use plastic, the authorities are failing to prevent its use or discharge into rivers, and they are also failing to enforce the ban on polythene bags. We therefore urge the government to take strict action to ensure enforcement, raise public awareness, and make alternatives to plastic products widely available for a greater effect.\n",
        "headline_1": "Microplastic contamination of hilsa was inevitable",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/microplastic-contamination-hilsa-was-inevitable-3919986",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "The slow progress of cases filed under the Women and Children Repression Prevention Act is concerning. Reportedly, as of March 31 this year, the total number of pending cases under this Act stood at 1,48,314. Among them, 35,262 cases have remained unresolved in courts across the country for over five years. While according to the law, the trials of such cases should be completed within 180 days, this rarely happens. Legal experts attribute the failure to meet the stipulated timeframe to multiple factors, including the prosecution's lack of sincerity in pursuing trials, witnesses refusing to appear in court due to fear or intimidation, and accused individuals moving to the High Court to stay trial proceedings. It goes without saying that such inefficiencies within our justice system will only increase gender-based violence in the country.\nReportedly, a special cell was established in accordance with a 2016 High Court directive around four years ago to monitor cases filed under the Act. As per the directive, the cell is supposed to be led by the Supreme Court registrar general or the registrar of the High Court Division, who would oversee trial timeframes and periodically submit reports to the authorities for appropriate action. Unfortunately, the cell is currently non-operational. An alarming example of delays in case proceedings is the case involving the rape of a nine-year-old schoolgirl in Dhaka's Khilkhet area, which was filed more than nine years ago. Reportedly, the tribunal dealing with the case is yet to complete the trial even after holding 96 hearings. The key reason behind this is that six of the 10 prosecution witnesses in the case did not appear before the court to testify. Not only in this case, witnesses failing to appear before courts leads to unnecessary delays in resolving numerous cases. To ensure justice for victims of rape and other forms of gender-based violence, authorities must take immediate steps to provide protection to witnesses, as their testimony is crucial in securing fair and timely trials.\nAfter assuming office, the interim government pledged to expedite rape case trials by amending relevant laws. We would like to know the update on this. Currently, 101 tribunals are dealing with the cases under the Women and Children Repression Prevention Act, which is not enough given the staggering number of cases being filed and remaining pending with the courts. We therefore urge the government to set up more tribunals to speed up the trials. Legal experts advocate for a separate secretariat under the Supreme Court to ensure effective implementation of directives from the Appellate Division and the High Court. In rape trials, forensic examination results must promptly reach investigation officers, for which more forensic labs should be set up urgently. The authorities must also overhaul the entire investigation process to ensure quick case disposal. Meanwhile, the existing laws should be properly enforced to effectively protect women and children from gender-based violence.\n",
        "headline_1": "Justice delayed is justice denied",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/justice-delayed-justice-denied-3918166",
        "news_paper_name": "The Daily Star",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 19, 2025 00:00:00  \nCompanies, whether local or foreign, require a sufficient and smooth inflow of working capital to continue their operations. Restrictions imposed by authorities to regulate capital flow and maintain financial balance can sometimes hinder the growth of business entities. Therefore, it is crucial to periodically review existing regulations and revise them as necessary to meet the needs of business entities and facilitate investments. The government's move to relax the current rigidity of maintaining a 50:50 debt-equity ratio for foreign companies operating in Bangladesh, providing more room for accessing term loans in local currency, is a step in this direction. A report in the FE, published this week, mentions that the Bangladesh Investment Development Authority (BIDA) is going to request the central bank formally to withdraw the obligation of the debt-equity ratio. \nAccording to the current foreign exchange regulations, any foreign company is allowed to obtain term loans in local currency, specifically in Bangladeshi Taka, provided that it maintains a 50:50 debt-equity ratio. In other words, foreign entities in the manufacturing and services sectors can get loans from the local financial market as long as the entities' total debt does not exceed the 50:50 ratio. Other conditions, like being in operation for at least three years in the country and the use of term loans in local currency for capacity expansion, are also in place. Now, relaxing the debt-equity ratio rigidity by enhancing the ratio of debt or entirely abolishing the restriction will help firms obtain more local financing. At present, foreign-owned or controlled firms are, however, free to access local banks for working capital on the basis of normal bank-customer relationships.\nStatistics available from Bangladesh Bank showed that the outstanding amount of industrial term loans in the country stood at Tk 3.74 trillion at the end of last year, whereas financing for working capital stood at Tk 3.30 trillion. The share of term loans and working capital financing in total private credit was recorded at 22.85 per cent and 20.20 per cent, respectively, at the end of December last year. It means that these two types of industrial credits are the major drivers of overall advances to the private sector by the banks. Now, allowing foreign commercial entities to get more term loans in local currency is likely to increase the demand for the loan. It may also spark some competition among banks to attract foreign companies, and as a result, interest rates may decline modestly. Generally, foreign companies are considered more compliant compared to many local commercial entities. Therefore, banks may do more business with those companies to reduce the risk of loan defaults. Currently, the total amount of classified loans stands at Tk 4.20 trillion, equivalent to approximately one-fourth of the country's banking sector's total outstanding loans. \nSome cautions are, however, necessary for the potential risks of relaxing the debt-equity ratio for foreign firms. Taking advantage of the relaxation, some firms may abstain from injecting fresh equity in foreign currency, which will not help to enhance FDI. Again, if the debt-equity ratio requirement is fully abolished, analysing the credit risks may be difficult for the banks. Banks will also not take the risk of providing unsecured loans, regardless of how reputable a foreign company is. There are some other issues also. All these need to be taken into consideration before entirely abolishing the 50:50 debt-equity ratio requirement. Instead, it may be relaxed to some extent and observed for the market response in the meantime. The status of the terms of loans so far availed by the existing foreign companies also needs to be reviewed before taking any decision.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Foreign firms' term loans in taka",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/foreign-firms-term-loans-in-taka-1750258837",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       June 19, 2025 00:00:00  \n\nThe hilsa is a gourmet's delight for its unique taste, distinctive flavour and high nutritional value. It is not just a great delicacy but a symbol of national pride, feted as the national fish. Bangladesh takes pride as the world's largest hilsa-producing country, with this aquatic treasure largely being exclusive to the region's rivers and coastal waters. But how would you feel if this most sought-after and beloved fish species falls victim to pollution? Deeply shocked and dismayed? Well, that's precisely what has happened. Researchers from the University of Dhaka and Shahjalal University of Science and Technology found microplastic particles in hilsa caught at river mouths in Bangladesh. Moreover, they also detected harmful heavy metals like cadmium, lead, mercury, and arsenic in the fish. This poses not only a serious existential threat to the hilsa population but also a grave risk to human health and national food security.\nLed by Professor Gawsia Wahidunnessa Chowdhury of Dhaka University, the study found plastic particles smaller than 5 millimetres - known as microplastics - lodged in the intestines, liver, and even muscle tissues of the fish. These particles originate from common plastic waste such as bags, bottles, synthetic clothing fibres, tyre residue, and even cosmetics. Once they enter rivers and oceans, fish ingest them either directly or through the food chain.\nContamination of hilsa lends credence to the United Nation's warning that without urgent action microplastics will infiltrate every ecosystem on Earth, including the human body. Currently, the world produces approximately 350 million tonnes of plastic waste each year, and an estimated 12 million tonnes of this plastic ends up in the ocean. And the UN warns that without immediate action, the amount of plastic entering the ocean annually could reach 37 million metric tonnes by 2040. So, apart from climate change, plastic pollution is considered the worst form of environmental threat globally. Considering the gravity of the problem, this year the World Environment Day was observed with the theme of \"Ending Plastic Pollution.\"\nIn Bangladesh, plastic pollution is growing fast driven by factors such as population growth, urbanisation, and changes in consumer behaviour. According to World Bank study in 2021, Bangladesh's annual per capita plastic consumption in urban areas has tripled from 3.0 kg in 2005 to 9.0 kg in 2020. The rising use of plastic contributes to increased plastic waste, including single-use plastics (SUPs), which easily break down into microplastics and are often dumped into drains, canals, and rivers. This not only blocks drainage systems and causes flooding or waterlogging, but also poses a significant risk to aquatic ecosystems and biodiversity.\nTo tackle the growing plastic pollution, polythene and polypropylene bags were banned over two decades ago. However, the ban was never strictly enforced. Stakeholders have often cited the lack of alternatives, public unawareness, black-market activity, and weak regulatory enforcement as key reasons for the failure to ban single-use plastic. The interim government has made a renewed attempt to impose a ban on polythene bags in supermarkets from October 1, 2024, and set a phased target to eliminate other single-use plastics. While the government's initiative is commendable, enforcement remains a critical challenge. Laws alone cannot solve the problem. What is urgently needed is the large-scale production and marketing of alternative jute and paper bags, along with efforts to bring about behavioural change among the public.\nIn this regard, BRAC University's ambitious initiative to eliminate single-use plastic is not only worth-mentioning but highly commendable. The university aims to transform itself into a zero-waste, plastic-free campus through enhanced recycling programmes, the elimination of single-use plastics, and the promotion of sustainable alternatives. This proactive step by an educational institution serves as a powerful example. Other universities, as well as various public and private institutions, would do well to follow suit. They can promote a plastic-free work environment by banning single-use plastics and replacing them with sustainable alternatives such as glass, metal, or paper products. Chief Adviser's office has already adopted such practice, setting a positive example for others to follow.\nHowever, the solution does not solely rest on individual or institutional goodwill. The government should effect a paradigm shift in its approach to waste management, recycling infrastructure, and the production of sustainable alternatives. Institutional capacity in these areas will significantly influence the broader economy, investor confidence, and consumer habits.\nAt present, only a small fraction of plastic waste is properly disposed of or recycled owing to inadequate collection systems, poor waste segregation, and insufficient recycling facilities. Experts are of the view that segregation at the source must be made mandatory, particularly in rapidly growing urban centres like Dhaka and Chattogram. Smart recycling hubs with integrated systems for collection, sorting, and reuse should be developed. Here, government policy, private innovation, and civic participation must go hand in hand.\nThen, the financial institutions have a critical role to play to help accelerate the transition towards environmental sustainability. According to Bangladesh Bank, banks and financial institutions disbursed approximately Tk 1.17 trillion in sustainable financing during the April-June quarter of 2024, which is significantly more than what was disbursed in the previous quarter. If such financing is strategically channelled into eco-friendly, technology-driven, and plastic-alternative ventures, it could yield enormous social and environmental benefits. Here it is noteworthy that Small Industries Development Bank of India (SIDBI) provides easy access to finance for small entrepreneurs engaged in producing biodegradable products. Bangladesh could implement similar incentives through the SME Foundation and SME units of commercial banks.\nIn a word, individuals, families, communities, businesses, and governments all have a role to play in the fight against pollution. Failure to act will allow it to continue choking our rivers, endangering marine life, and threatening public health, where even the treasured national symbols, like the hilsa, become a casualty.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Hilsa threatened by microplastics",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hilsa-threatened-by-microplastics-1750258889",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 19, 2025 00:00:00  \n\n\"Digital Bangladesh\" once inspired a generation with the promise of a smart, tech-powered nation. But in 2025-after a major political transition, a banned ruling party, and rising global automation-we must ask: has that dream stalled, or can it still be revived?\nArtificial intelligence is rewriting the global job market. Tasks such as data entry, report generation, or even basic programming are now performed by AI in seconds. Yet our education system continues to produce graduates trained for yesterday's world. Each year, over two million young people enter Bangladesh's job market-many armed with outdated skills-only to face frustration and underemployment.\nWe cannot build a digital nation while neglecting its foundations: modern education, innovation support, and future-proof job training. Schools and universities must urgently incorporate AI awareness, tech ethics, critical thinking, and human creativity as core learning objectives. At the same time, our industries must prioritise re-skilling, not just automation.\nThis is not merely a tech issue-it is a national survival issue. Bangladesh is undergoing a historic reset. If ever there was a right moment to reform, it is now.\nLet us not allow \"Digital Bangladesh\" to become a forgotten buzzword. Let us rebuild it-stronger, smarter, and truly inclusive.\nHafsha Islam Alif\nStudent\nNorth South University, Dhaka\nhafsha.alif@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is 'Digital Bangladesh' dream alive?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-digital-bangladesh-dream-alive-1750258916",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 19, 2025 00:00:00  \n\nJust when it felt like small businesses in Bangladesh were finding their rhythm again, talk of a possible new COVID wave has naturally stirred concern.\nFor our small and medium enterprises (SMEs), the past few years have been anything but easy. From lockdowns to supply chain chaos, these businesses-contributing about 25 per cent to our GDP and employing the majority of our industrial workforce-have had to fight hard just to stay afloat. Now, with health alerts coming in from neighbouring countries like India and China, people are asking: Could another wave knock us back again?\nThe good news is we are not where we were in 2020. Not even close.\nOver 88 per cent of adults in Bangladesh have received at least one dose of the COVID vaccine. Most people have returned to normal life and work, and businesses have adapted in impressive ways. Many shop owners now sell through platforms like Daraz, Facebook Marketplace, or even WhatsApp. Some restaurants that once relied on crowded dine-ins now thrive through delivery apps and online orders. \nBut it is not all smooth sailing.\nIf global supply chains take another hit-say, if factories in China slow down or ports become congested-it could mean delays and price hikes for local businesses. And let's be honest: even a rumour of restrictions can scare customers away. Remember how quickly foot traffic dried up last time?\nStill, the government appears more prepared this time. There's talk of low-interest loans and emergency credit through services like bKash and Nagad, should the situation worsen. Programmes like Meta's \"SheMeansBusiness\" and support from the SME Foundation are also helping owners boost their digital capacity.\nSo, what should SME owners do now?\nStay alert. Strengthen online sales channels. Build a small emergency fund, if possible. Talk to suppliers about backup options. And don't wait for a crisis to start planning-start now.\nAnother COVID surge would be tough-but it wouldn't be the same disaster it was last time. If there is one thing Bangladeshi entrepreneurs have proven, it is that they are incredibly resilient. This time, with the right mindset and a few smart moves, SMEs might not just survive-they might actually grow.\nH.M. Ashik Ferdous \nStudent \nSBE, North South University \nashik.ferdous@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "COVID surge and SMEs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/covid-surge-and-smes-1750258947",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-06-2025"
    }
]