[
    {
        "full_article": "The 30th edition of the Conference of Parties (COP) has begun in Brazil’s Belém. Coming 10 years after the historic Paris Agreement, when all signatory members of the United Nations Framework Convention on Climate Change (UNFCCC) committed to a common goal of keeping temperatures below 2°C and “as far as possible below 1.5C”, this would have been an ideal platform to take stock of the achievements so far and ramp up ambition. Instead, there is a visible sense of disarray. The United States has, yet again, withdrawn from the Paris Agreement (though not the UNFCCC) and from 2017, this break seems decisively more hostile. Wielding threats on tariffs and brinkmanship, the U.S. Administration seems actively committed to derail steps toward emission cuts, newer ways to fund adaptation and adopting clean technology. For instance, it has played a major role in recent months in scuttling a resolution by members of the International Maritime Organization (IMO) into transitioning the shipping industry away from fossil fuel use. Following Bill Gates’s shift from being a vocal advocate of curbing emissions to one who no longer sees climate change as an existential threat, Mr. Trump announced it as a “vindication” of his position. There is a case that the U.S.’s isolationist policy is of diminishing relevance in an era when global investments in clean energy outpace fossil fuel investment and that businesses globally have seen the writing on the wall. But as the IMO example states, the U.S.’s abilities as a destabilising force remain formidable. That must be at the back of negotiators’ minds when they began the 12-day deliberative sprint.This COP is one of ‘implementation’, as the Brazil Presidency has emphasised. While the world’s collective action is far short of what the Paris goals require, there is palpable optimism that the tenor of discussions from now on will visibly shift toward ironing out financial mechanisms for adaptation, preserving forests and strengthening carbon credit markets. It is likely that there will be a renewed discussion on how to make the United Nations’ multilateral process more effective at delivering decisive outcomes and, perhaps, a debate on the creation of a ‘climate council’, as Brazil proposed earlier this year. All of this promises fresh energy and verve to a process that has come to be seen as ineffective in addressing the climate crisis. However, this is also an opportunity for the large developing economies — India, China, Brazil, and South Africa in particular — to stake claim to leadership. This might require a greater display of ambition and recalibration of past positions, particularly on financial contributions. Sans fireworks, India must begin an internal dialogue to place itself favourably for this nebulous future. Published - November 11, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        climate change\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        Paris Climate Summit COP21\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        carbon emissions\n                    \n                            /                      \n                        \n                        shipping service\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        green technologies\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        economy (general)",
        "headline_1": "New horizons: On COP30 in Brazil",
        "headline_2": "Developing countries must take the lead in addressing the climate crisis",
        "link": "https://www.thehindu.com/opinion/editorial/new-horizons-on-cop30-in-brazil/article70263039.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "Sudan is no stranger to violence by paramilitary forces. Yet, the rape, pillage and mass killings carried out by the Rapid Support Forces (RSF) in El-Fasher, after their capture of the city in the Darfur region in late October, were shocking even by Sudan’s grim standards. The RSF, a predominantly Arab militia, known for its brutality against Sudan’s African communities, unleashed a wave of atrocities, including a massacre at a maternity hospital. The RSF now controls five of Darfur’s capitals, tightening its grip over the famine-stricken region. In a chilling demonstration of impunity, RSF militants posted footage of some of their crimes on social media. Born from the Arab supremacist Janjaweed militia in the early 2000s, the group had faced accusations of ethnic cleansing and genocide against non-Arab communities in Darfur. It laid siege to El-Fasher, the Sudanese army’s last major stronghold in Darfur, 18 months ago, a blockade that triggered a famine in the region. More than 12 million people have been displaced since Sudan’s civil war broke out in April 2023, and tens of thousands killed. According to UN experts, the country is now facing the world’s worst humanitarian crisis. While both the army and the RSF have been accused of war crimes, the atrocities by the paramilitary force have increasingly been described as genocidal.When the regime of dictator Omar al-Bashir fell in 2019, many hoped that Sudan was on the cusp of a new dawn. But hopes for a democratic transition were short lived as the military and the RSF jointly staged a coup in 2021. Mr. Bashir had raised the RSF out of the ranks of the Janjaweed and treated the group as his personal army. He used it to neutralise domestic opposition and as a parallel structure to the military. Yet, when the roots of the Bashir regime were shaken by public protests in 2019, the RSF turned against him. But once the military consolidated power in 2021 and insisted that the RSF integrate with the regular army, the alliance between the army and the RSF fell apart, plunging Sudan into civil war. Today, the military government, backed by Egypt, controls most of Sudan, while the RSF, supported by the UAE, dominates Darfur. Earlier this year, the army pushed the RSF out of Khartoum, the capital. But the fall of El-Fasher confirms that the militia remains entrenched in its stronghold. If the fighting continues, Sudan risks more death, destruction, and even a state collapse. The atrocities in El-Fasher should serve as a wake-up call for the international community. The war must be brought to an end. For that, the backers of both the military and the militia should press for talks instead of sending more weapons into Sudan. Published - November 11, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Sudan\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        famine\n                    \n                            /                      \n                        \n                        crime\n                    \n                            /                      \n                        \n                        media\n                    \n                            /                      \n                        \n                        gangs & organised crime\n                    \n                            /                      \n                        \n                        Egypt\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        armed conflict",
        "headline_1": "In free fall: On violence-hit Sudan",
        "headline_2": "Sudan’s hopes for a return to democracy look dim",
        "link": "https://www.thehindu.com/opinion/editorial/in-free-fall-on-violence-hit-sudan/article70263019.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "But all too often, none is forthcoming \nI walked back from the park with a posse of neighbourhood ladies, all giggling and talking to me simultaneously like the panelists on a news hour debate. Kamala was at the gate glaring at me for the cardinal sin of being popular. So I followed the trend and issued an official apology. I had been doing this ever since I was married – but apparently it’s now a viral trend. Every brand from Skoda to Volkswagen and from Vadilal to Ambuja Cements is apologising for being irresistible. \nWe were just discussing politics, I explained sincerely. Can I help it if I’m up-to-date with the latest news? After their morning coffee, the ladies like me to spill the tea. We discussed Zohran Mamdani becoming mayor and added our own Mississippi Masala to the mix. Mrs Natarajan remembered that she once shopped for saris with Mira Nair and planned a Monsoon Wedding for her daughter. Babita Bhabhi wanted someone to explain the term Democratic Socialist to her. We were completely clueless and instead chose to change the topic deftly and discuss his wife instead. Deflect, distract and deny – those are the strategies used by most politicians nowadays. \nNobody is clearing the air about the pollution in Delhi. No official or unofficial apology. Instead we try to skew the numbers by spraying water or attempting cloud seeding. We distract from the real issue by threatening to remove street dogs from public places like bus stands and railway stations. Nobody is apologising for rail accidents or potholes on the road. We do not apologise for our women sportspersons being trolled or groped – we distract with controversies about the number of missing stanzas in Vande Mataram that celebrate the divine feminine force. We do not apologise for body shaming a young actress by asking for her weight at a press conference, but we celebrate the fact that India’s market for anti-obesity drugs is expanding. We do not apologise for Seema, Sweety or Saraswati – instead we spend time wondering how a Brazilian model could have painted a sorry picture of an electoral process in a democracy.\nKamala was not impressed with my official apology that took no responsibility for being an incorrigible flirt. Am I the only one apologising sincerely for the sorry state of affairs in the world? Apology accepted or must I stand for elections?\n\n",
        "headline_1": "Apology accepted",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/apology-accepted/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "After the Delhi car blast, govt’s priority should be to make people feel safe\nIf the deadly blast outside Red Fort yesterday evening turns out to have a terrorist’s hand behind it, it will be the bloodiest such act in India’s capital in over 17 years. At the time of writing, we don’t know the cause, and whether there was a motive. But we have seen the devastation – burnt and mangled shells of cars and rickshaws – and we are still counting bodies. The reported toll rose from one, when the reports started coming in shortly after 7pm, to eight, then ten and, by some accounts, thirteen. There will be clarity on the human loss by daybreak. It’s reassuring to see police and special investigative agencies on the ground, and PM and home minister monitoring developments.\nThe truth will be known, but because this matter concerns the capital – the world is watching – we would like to get to the bottom of it at the earliest. Was it a terror strike? That’s the question uppermost on every mind. First reports said it might have been a CNG tank explosion in a car. Tragic, but reassuring due to the absence of malafide intent. However, late night, when the ownership of the car had been ascertained, the terror angle seemed to gain heft. That the blast followed close on the heels of the arrest of doctors with alleged terror links feeds the apprehension. \nThis involved a joint operation between Faridabad and Jammu and Kashmir police, where around 350 kg of explosives were also found. The case needs urgent answering even apart from the Delhi blast. Undoubtedly, nobody needs these answers more than govt and its security agencies, to keep all of us safe. But quelling people’s fears is equally important, because that has a bearing on the national mood and commerce. \nThere was a 30-year period from the 1980s to the 2000s when terror, if not striking Delhi, was never far from it. But in the period of quiet since the 2008 serial blasts, a whole generation has grown up without knowing terror. Govt must do everything to ensure they remain unacquainted with it. If Monday evening’s blast was a premeditated act, the guilty must be brought to book speedily. This govt has always talked tough on security – it must ensure that terror doesn’t take root in the capital again. \n\n",
        "headline_1": "Capital Questions",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/capital-questions/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "The Tirupati fake ghee case is a scary tale of how ‘milk’ suppliers cream public\nThat a cheat in Uttarakhand passed off a synthetic concoction as ghee to one of India’s most venerated temples in Andhra for five years is more than a mere adulteration crisis. It’s a breakdown of social contract. When the Tirupati laddoo ‘contamination’ came to light last year, official statements stated the ‘ghee’ had failed Tirupati’s own checks. Now it appears the supplier was allegedly so corrupt he re-supplied the same product with tweaks via another fraud dairy in Tirupati itself. Food inspector FSSAI has been investigating alongside the CBI team.\nYet, it is FSSAI itself that must be held to account for being oblivious to such an extensive high-profile fraud that has continued for so long. Milk and ghee adulteration has been on FSSAI’s radar for at least 20 years. Five nationwide surveys on milk and milk products have been carried out since its 2011 survey, all revealing a broken unorganised sector. Even in 2019 it said “Your milk is largely safe”. Results from the 2023 survey were not made public. But we know contamination is widespread using urea and detergents, heavy metals, pesticide residue and so on.\nQuestion is what is being done about it? Cases of fake milk and milk products could fill a month’s newsprint. The ‘strict action’ FSSAI keeps promising is but a news snippet. How long after every crackdown on fake ghee, paneer and khoya etc do the very same units swing right back into action, unperturbed, the crackdown but a blip in their criminal activity. The Tirupati fraud is a scary case where there is no milk in the mix at all. Ghee is all chemicals – 68L kilos worth 250cr. What were food inspectors in Uttarakhand and Andhra doing? Truth is, there is no real deterrent. One wonders, really, if we at all know what in the name of milk are we feeding children.\n\n",
        "headline_1": "No Deterrent, All Detergent",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/no-deterrent-all-detergent/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "Chairman of Adani Group, writing on the Google-Adani project to build an AI and data centre complex in Visakhapatnam, argues India will benefit at multiple levels & all data will be kept here\nThe $15bn partnership between Google and the Adani Group to develop India’s largest AI and data centre hub in Visakhapatnam represents a fundamental shift in how we think about national infrastructure. This is not simply an investment, it is a strategic move to position India at the centre of the global AI economy.\n\nNew pillars of sovereignty | In the 20th century, nations built their power on ports, railways and electricity grids. These remain essential, but the 21st century demands a new foundation: energy, data, and ‘compute’. Control over these resources is no longer optional, it is fundamental to economic independence and technological self-reliance.\nRead Full Story on TOI+\n\n",
        "headline_1": "‘Making India global AI hub’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/making-india-global-ai-hub/",
        "news_paper_name": "The Times of India",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "The decline of groundwater in the Barind rice-growing region and its impact on marginal farmers, as reported in this daily, is a lesson in how the environment, the economy, and human desperation are inextricably linked. The report comes as world leaders fly into the Brazilian city of Belém for the COP30 climate summit, to discuss and agree on a global path on carbon reduction, climate adaptation, and finance. Against this backdrop, the plight of farmers in the Barind region is a microcosm of the convergent crises of climate change and resource management.\nThe Rajshahi region, once known as a comparatively barren area, was transformed into the \"rice bowl\" of Bangladesh by a technological miracle: the deep tubewell. Since the 1990s, the authorities have enabled farmers to tap groundwater, cultivating three crops a year and banishing the spectre of famine. But this region is now water-stressed, its groundwater table in freefall. What appears at first glance to be a lush landscape of crops and fruit orchards is an illusion sustained \"at the cost of groundwater.\" The very solution of the past has sown the seeds of the present crisis.\nThis crisis is twofold. The first element is a changing climate. A study by the Bangladesh Meteorological Department reveals that rainfall in Rajshahi is declining by 54mm per decade, while temperatures are rising at the country's steepest rate: 0.5 degrees Celsius per decade. The monsoon, the lifeblood of traditional agriculture, is becoming less reliable, replaced by torrential downpours that the hard clay of the Barind region cannot absorb. This disrupts not only groundwater recharge but also the delicate balance of agriculture. The second element is the overexploitation of a finite resource. As farmers are forced to dig ever deeper—from 30 feet a decade ago to 80 feet today—they are just mining precious water, an unsustainable practice.\nThe story of Rajshahi is a cautionary tale for Bangladesh and, indeed, the rest of the world. It demonstrates that development models built on the intensive use of a single resource are perilously fragile in the face of climate change. Although the government is preparing guidelines to limit the use of water in the area, such reactionary measures will not do much to address the crisis in the long run. Therefore, the lesson for the delegates in Belém is that the agenda cannot be neatly divided into silos of \"carbon reduction,\" \"adaptation,\" and \"finance.\" Rajshahi shows they are one and the same. Financing must be directed not just at clean energy, but at climate-resilient water management and agriculture. The silent killer of climate change does not announce itself with a cataclysm, but with a creeping drought, a falling water table, and the quiet despair of a farmer staring at his sterile field.\n",
        "headline_1": "Water-stressed Barind, a cautionary tale for the world",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/water-stressed-barind-cautionary-tale-the-world-4031661",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "It is quite concerning that 59 percent of drug-related cases in Bangladesh cannot be proven in court. The daily Prothom Alo analysed the verdicts of 500 drug cases resolved across 26 districts, including Dhaka, between January 2021 and June 2025, and found that in 296 cases all the accused were acquitted, while convictions were made in only 204 cases. The review also revealed that investigations in such cases rarely went beyond the primarily arrested individuals. No new information was uncovered beyond initial reports, and charge sheets contained no details about any patrons, protectors, or financiers, leaving main offenders beyond law enforcement's reach. This is deeply alarming.\nIn short, the Prothom Alo investigation has found 16 major shortcomings preventing drug-related crimes from being proven in court. These include faulty FIRs, weak investigations, lack of witnesses, inaccurate seizure lists, contradictory statements by law enforcement officers, questionable chemical test reports, failure of the complainant or investigating officer to testify, other procedural errors, and negligence by both investigators and the prosecution.\nIn 237 of the 296 acquitted drug cases, the absence or unreliability of neutral witnesses was a key reason, while flaws in searches, FIRs, and investigations contributed to 48 more acquittals. Investigating officers failed to testify in 126 cases, complainants in 79, and in 66 cases, neither appeared in court. The problems are further highlighted in a research report by the Department of Criminology and Police Science at Mawlana Bhashani Science and Technology University that found that in five drug-related cases in Sylhet, a single police informant was repeatedly used as a witness, merely signing seizure documents when called. Moreover, chemical testing, crucial for verifying the substance and determining punishments, was mishandled in 23 cases, leading to full acquittals. These patterns reveal systemic negligence and malpractice in investigations and prosecutions.\nIn 2020, both the Police Headquarters and the Dhaka Metropolitan Police (DMP) issued directives instructing officers to identify full drug networks and trace money flows in drug seizure cases. However, an analysis of 20 DMP case reports by Prothom Alo found that these directives were not followed. Investigators only charged the carriers, without uncovering the sources, destinations, or wider networks involved.\nClearly, the current police/legal approach to dealing with drug cases is deeply flawed, focusing only on low-level offenders and ignoring the main networks. If the success of law enforcement operations is measured by the quantity of drugs seized and the number of cases filed, rather than the effectiveness of targeting the entire drug trafficking network, nothing will change. Only through rigorous, well-supervised investigations, active prosecution, and a strong governmental commitment to enforce the law can we hope to stop the spread of drugs and bring the kingpins of the trade to justice.\n",
        "headline_1": "Investigate the drug cases seriously",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/investigate-the-drug-cases-seriously-4031016",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "Roushan Jahan, one of the pioneer researchers on women's empowerment, passed away on Tuesday, November 4, 2025. She was my sister, four years older than me, and the firstborn amongst six siblings. She was a born teacher, and when I was growing up, I completely relied on her to give answers to all my questions on any subject! My younger brother Kabir and I had problems pronouncing some Bangla syllables when we were children. Though she was barely eight or nine herself, Roushan managed to teach us how to move our tongue to pronounce correctly. Later in life, Roushan and I shared a common passion for doing research and writing on women's empowerment.\nShe was an exceptionally bright student, curious to read everything from the age of four. Roushan was especially fond of literature. She was articulate, made friends easily, and her teachers in school, college and university recognised and appreciated her many talents. Though I was four years younger, and she could have easily chosen to spend time with friends of her own age group, she devoted an enormous amount of time to me, telling me stories, playing with me, and teaching me Bangla and English grammar and literature. We were inseparable as children and all through our school and college years till she left for her higher studies in English literature at the University of Chicago on a Fulbright scholarship in 1961.\nRoushan not only excelled in her studies. She participated in school theatres and learnt music from Ustad Ayet Ali Khan in Cumilla. She was interested in films and sports. I remember, when Calcutta Mohammedan Sporting Club came to Dhaka to play football, Roushan and I went to the stadium to watch the game, only two girls in a sea of men! She was quite fearless in taking these bold decisions.\nRoushan was a favourite student of both Dr Syed Sajjad Hussain and Dr Khan Sarwar Murshid in the English Department at Dhaka University (DU), which was quite an achievement! After passing her MA in English literature, she taught briefly at Eden College and then joined the teaching faculty of the English Department at DU.\nAt the University of Chicago, again, she was a favourite student of Professor Edward C. Dimock. She helped him in his translation work and taught Bangla to US students, many of whom still remember her fondly. At age 92, Professor Ralph Nicholas, also from the University of Chicago, remains grateful to Roushan for teaching him Bangla. The recordings of her teaching were used for years at the university. At Chicago, she also met Muzaffar Ahmed, who was then a PhD student in the economics department. They later got married when Roushan returned to Dhaka in 1966. I missed her wedding because I was doing my PhD at Harvard University during that time.\nRoushan never got back to her teaching career at DU after marriage. I always considered this a great loss to the nation because she could have produced so many great scholars in both English and Bangla literatures and linguistics. She had a special skill in teaching people. Generations of students were deprived of learning from a great teacher!\nHowever, when I started my own initiative of doing research on women in 1973 and requested her to join our study group, which used to meet once a week at our house, she readily agreed. I wrote my first article on \"Women in Bangladesh\" in English in 1973 and Roushan translated it into Bangla for wider dissemination. Ahmed Sofa organised a large lecture at DU, where I presented my article in Bangla. Razia Khan Amin and Suraiya Khanam were the other two discussants. Many young people participated in the lecture.\nIn 1975, we registered our study group as an NGO titled \"Women for Women,\" and published a book with the same title, where Roushan contributed an article \"Women in Bangla Literature.\" She later became the president of Women for Women and kept this voluntary organisation alive for the next two decades through her research and writings. Throughout the 1980s and 1990s, she did pioneering research on many issues and published many books. Though a student of literature, she did research and wrote on wide-ranging subjects such as education, health, human rights, environment, politics, workers' conditions and violence against women. Her noteworthy publications include Hidden Danger, where she presented data on domestic violence, and No Better Options, co-authored with Hameeda Hossain and Salma Sobhan, where she analysed the working conditions of women industrial workers, based on findings of survey research. Both were pioneering research studies. Her most famous work was an edited version of Rokeya Sakhawat Hossain's Sultana's Dream, which was published by the Feminist Press in New York and was widely used as a textbook in women and gender studies courses in US universities. The book is still much in demand. She translated into English parts of Rokeya's Oborodh Bashini and also Ahmed Sofa's Onkar.\nIn addition to research and writing, Roushan was actively involved with other women's and civil society organisations such as Bangladesh Mahila Parishad, Ain o Salish Kendra, Campaign for Popular Education (CAMPE), Education Watch and Bangla-German Shampriti (BGS). She worked on a voluntary basis in all these organisations for decades with commitment and dedication. She was always a behind-the-scene worker, never trying to promote herself as a leader. She wrote or edited the reports of many of these organisations.\nRoushan also actively participated in many regional and international conferences. We both attended the UN Women's Conference in Nairobi in 1985, and we three sisters Roushan, Nilufar and I attended the fourth UN Women's Conference in Beijing in 1995. Roushan and Nilufar were not only my sisters, but we all became comrades fighting a common cause. Now, Roushan's daughter Sohela Nazneen has joined the same good fight.\nRoushan and my close bonding might have come as a surprise to many, as we had very different personalities. Roushan was a truly kind and humble person, never hurting anybody, never pushing herself forward, almost a saint-like figure. I was the total opposite! But we never quarrelled, largely because Roushan was always so very loving and forgiving. She has left a void in my life that will never be filled. I will miss her every day of my remaining days, but will always rejoice remembering our happy memories together, walking in the garden where Roushan could identify every tree and flower, looking at the stars as she named them all, reading a book or a poem where she could recite every line, or listening to a song where she could sing along. She enjoyed the simple things of life. She was my first teacher, who opened my eyes to the wide vista of a world beyond me. I thank my lucky stars that such an exceptional human being appeared in my life and kept me company for so many years.\nRounaq Jahan is a political scientist, author and distinguished fellow at the Centre for Policy Dialogue (CPD).\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Remembering Roushan Jahan: My sister, teacher, comrade",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/remembering-roushan-jahan-my-sister-teacher-comrade-4031011",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "Recent media reports have revealed how illegal razing of hills continues unabated across the country, stripping it of its natural defences and ecological balance. Despite clear legal prohibitions under Sections 6(a) and 6(b) of the Bangladesh Environment Conservation Act, 1995, state agencies and private actors alike are destroying hills, often without clearance from the authorities and in full public view. A recent report by this daily revealed that the Roads and Highways Department (RHD) flattened nine hills and removed over 10.14 lakh cubic feet of soil in the Ramgarh-Sitakunda reserve forest to expand a 38-kilometre road, without obtaining the environmental clearance. By the time the Department of Environment (DoE) intervened, 40 percent of the Tk 1,107 crore project was already complete. The project, occupying 90 acres of reserve forest land, is part of an initiative to facilitate cross-border trade, easing transport of goods from Chattogram port to India via the Ramgarh land port in Khagrachhari. However, it has come at the expense of a forest that shelters more than 120 species of birds and 25 species of mammals.\nSimilar disregard was found in Cox's Bazar's Ukhiya, where the Local Government Engineering Department (LGED) allegedly razed several hills for roadwork, and in Bandarban, where hill cutting near a primary school endangered students and residents alike. Furthermore, the private sector's role in environmental degradation is no less alarming. A Prothom Alo report found rampant hill cutting across Sylhet, with 45 percent of the district's hills now fully or partially razed. The surge is linked to administrative inaction following the political transition of August 2024, when local enforcement effectively collapsed. Another report detailed how Chattogram's Ruposhi Hill was cut and divided into plots, sold for up to Tk 30 lakh per katha.\nSuch activities have caused severe soil erosion, loss of biodiversity, disrupted rainfall patterns, and frequent landslides that have claimed at least 15 lives since 2022. Meanwhile, local politicians and influential businessmen, shielded by bureaucratic loopholes and shifting land classifications, have turned hill cutting into a profitable enterprise. This crisis reflects not just environmental degradation but a deep nexus of power, profit, and impunity. Without strong political will and accountability, mere legal provisions mean little.\nThe DoE and local administrations must halt all ongoing hill cutting, prosecute violators, and restore damaged sites through reforestation. Land classification loopholes allowing \"shankhola\" (barren land) misuse must be reformed, and receipt of environmental clearance must be made mandatory and publicly accessible. Bangladesh must treat hill conservation as a national priority. Satellite monitoring, inter-agency coordination, community reporting, and exemplary punishment for offenders are essential. Without enforcement and ecological restoration, the cost of each razed hill will continue to be paid in loss of living beings and the environment.\n",
        "headline_1": "Razing of hills in Ctg and elsewhere must stop",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/razing-hills-ctg-and-elsewhere-must-stop-4029941",
        "news_paper_name": "The Daily Star",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 11, 2025 00:00:00  \nThe dichotomy between the prospect of artificial intelligence (AI) and human resources could not be sharper anywhere save Bangladesh. Given the option for going whole hog for exploring AI prospect, should the country take the chance? Or, can the country afford the luxury of promoting AI at any cost to the neglect of its huge army of unemployed population? The dilemma is quite clear: overemphasis on either the AI or unemployment of the people for its curtailment makes no sense. New technologies have always catapulted nations from one stage to the next big stage. So the question about adoption of AI is, how much is too much? That AI has come to transform means of production, supply and distribution is a reality. It is true that the country is yet to be prepared for wide application of AI. If it does not ready its infrastructure, manpower skills through educational reform and domestic digital capacity, it is sure to fall behind other nations including its neighbours.\nThe views thus expressed by local experts in the field of information and communication technology (ICT) corroborate the contention of the World Bank report on 'Jobs, AI, and Trade in South Asia'. One area that hardly receives attention from the policy makers as also from deliberations on development at seminars and workshops is local innovation. Happily, experts this time have made home-grown innovation a salient point. What happens usually is that technologies innovated abroad get transferred to countries poor and lacking in research and development a decade later. In the digital era, any such gap in technical and technological knowledge and skills can be disastrous. Appropriate policies, strategies and digital environment can not only bridge the skill and innovation gap but also turn the sector into the number one foreign exchange earner. There is no dearth of tech-savvies in this country. The only problem is with the right environment for them to work and give their best.\nSo the important point is not only to invest in education, infrastructure development and enhancement of digital capacity --- where power supply is not disrupted, internet connection and speed are undisturbed---but also develop digital skills of mid-ranking employees who can maintain connection between lower ranked ones and the top grade computer geeks. But preparing such a collaborative digital regime will call for educational reform. This cannot be done overnight. Time is crucial here. There is no scope for taking too long a time to strike a balance between the urgency and obtaining reality.\nWhen education is considered a subject of repeated experiments and no pragmatic solution to the problem is in sight, the objective of streamlining education in alignment with the digital need recedes in the distant horizon. This interim government has sidestepped from making education the right tool. If the next elected government urgently highlights this aspect of alignment between education and digital innovation, the country still have a chance to make the transformation happen. To do so, the overriding priority has to be recognised first and strategically accomplish the job under a comprehensive plan. The country's readiness to embrace digital wonders has to be completed as soon as possible in order to reap dividends from the 4th industrial revolution.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Exploring AI prospect",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/exploring-ai-prospect-1762784967",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       November 11, 2025 00:00:00  \nThe global trading system is undergoing a profound transformation. What was once a relatively predictable, rules-based order -- governed by multilateral disciplines and anchored in the assumption of gradual liberalization -- has given way to a far more volatile, transactional reality. Tariffs, once applied within known parameters, are increasingly deployed as political leverage, bargaining chips, or punitive tools. This weaponisation of tariffs marks a structural rupture in the international economic environment, and countries like Bangladesh -- deeply reliant on a narrow export portfolio and concentrated markets -- stand to lose the most if they fail to adapt.\nThe shift is neither cyclical nor temporary. Major economies have normalised the use of tariffs as instruments of geopolitical pressure, strategic competition, and domestic political signalling. The aftershocks of the tariff escalations initiated in the late 2010s continue to reverberate across supply chains. What many dismissed at the time as tactical disruptions have consolidated into durable policy frameworks. Even changes in political leadership have proved insufficient to reverse the broader protectionist logic now embedded in global trade governance.\nBangladesh must therefore prepare for a world in which tariff exposure is not a risk at the margins, but a central axis of economic vulnerability. Addressing this challenge demands not just defensive measures, but a structural repositioning of the economy and its institutions.\nBangladesh's export-led growth model has delivered impressive outcomes over several decades, but its foundations remain fragile. The country is highly dependent on a single sector -- ready-made garments -- which accounts for more than four-fifths of merchandise exports. Its market concentration in the EU and North America further magnifies vulnerability. In a world of tariff unpredictability, such concentration is a liability.\nMoreover, Bangladesh's accession to lower-middle-income status and its impending graduation from LDC status mean that several preferential market access schemes will be curtailed. The combination of reduced preferences and rising tariff weaponisation creates a risk exposure that cannot be mitigated by incremental reforms alone.\nStructural weaknesses exacerbate these vulnerabilities. High logistics costs, congested ports, and an energy system marked by unreliability and high import dependence erode competitiveness. Standards compliance remains inconsistent across industries, making exporters susceptible not only to tariff shifts but also to the growing arsenal of non-tariff barriers that major markets deploy.\nWithout a strategic intervention, Bangladesh may find itself navigating an external environment characterised by rising compliance costs, shifting tariff differentials, and sudden market disruptions -- while contending with domestic limitations that reduce its responsiveness.\nBangladesh urgently needs a coherent, forward-looking trade strategy that recognises the end of the old order. The new framework must rest on three core principles: diversification, resilience, and strategic alignment.\nFirst, export diversification must become a national priority, not a recurrent policy slogan. Diversification is often discussed in sectoral terms, but in the era of tariff weaponisation, market diversification is equally critical. Expanding beyond traditional partners into Asia, Africa, and Latin America is no longer optional. Markets such as Japan, Korea, ASEAN economies, the Middle East, and parts of Africa offer opportunities for risk-spreading.\nSectoral diversification requires targeted industrial policies that identify specific value chains where Bangladesh can realistically compete. Electronics assembly, pharmaceuticals, medical devices, light engineering, agricultural processing, and IT-enabled services are viable candidates. But diversification will not occur spontaneously; it requires coordinated policy support, investment incentives, skills development, and infrastructure tailored to sectoral needs.\nSecond, Bangladesh must build systemic resilience against external shocks.\nThis means streamlining customs procedures, lowering logistics costs, investing in modern ports, and upgrading energy infrastructure to ensure reliability and cost predictability. The ability to pivot quickly in response to tariff changes will depend on removing bottlenecks and building institutions that can anticipate and respond to evolving trade risks.\nA credible regulatory overhaul is essential. Standards and quality assurance systems must be strengthened to meet increasingly stringent global rules. Weak compliance capacity can expose Bangladeshi exporters to de facto barriers that function much like tariffs. Modernising testing labs, accreditation bodies, and regulatory agencies should be treated as strategic investments rather than administrative reform.\nThird, strategic alignment with key economic partners is critical.\nIn a fragmented global landscape, bilateral and regional economic partnerships will play a central role. Bangladesh needs to negotiate trade agreements not simply to secure tariff concessions, but to integrate into supply chains strategically. Well-designed CEPA or FTA frameworks can provide stability, reduce uncertainty, and open pathways to technology transfer and market diversification.\nTariffs are only one part of the emerging landscape. Major economies now deploy a wide array of non-tariff instruments -- environmental standards, labour requirements, carbon border adjustments, digital trade rules -- that function as sophisticated tools of strategic influence. For Bangladesh, the implications are profound.\nThe coming enforcement of climate-linked trade mechanisms, such as the EU's Carbon Border Adjustment Mechanism (CBAM), will increase compliance costs for carbon-intensive exports. Labour-related conditionalities in major markets will introduce new layers of scrutiny. Sustainability reporting requirements will become more complex.\nMeeting these standards will require industrial transformation rather than cosmetic adjustments. Energy efficiency, renewable energy adoption, waste reduction, circular economy practices, and traceability systems must be built into production processes. Exporters will need digital platforms to track environmental and social compliance across supply chains.\nBangladesh's regulatory institutions must evolve to provide guidance, enforce compliance, and support firms during the transition. Without such evolution, the country risks being squeezed out of high-value markets -- not by tariff hikes alone, but by regulatory exclusion.\nAddressing tariff weaponisation requires more than technical reforms; it demands policy credibility. Uncertainty stemming from political instability or inconsistent economic policies undermines investor confidence and deters long-term planning. A modern trade strategy cannot function without predictable governance.\nBangladesh needs institutional mechanisms that insulate trade policy from short-term political cycles. A permanent trade policy council -- comprised of policymakers, economists, private-sector leaders, and regulatory bodies -- could help provide continuity, conduct risk assessments, and coordinate responses to global shifts.\nTransparent policymaking, unified regulatory structures, and improved data systems are essential for building the credibility needed to attract investment into high-value sectors.\nWhile tariff weaponisation poses considerable risks, it also presents an opportunity for Bangladesh to accelerate long-delayed reforms and reposition its economy. The country's favourable demographics, strategic location, and competitive labour force provide a strong foundation. But without structural transformation, these advantages will be insufficient.\nBy adopting a forward-looking strategy -- diversifying exports and markets, improving infrastructure and compliance, entering strategic trade partnerships, modernising institutions, and rebuilding policy credibility -- Bangladesh can shift from passive vulnerability to purposeful resilience.\nThe time to act is now. The global trading order that once sheltered Bangladesh is fading. A new, more volatile era has begun -- one in which preparedness, agility, and strategic vision will determine which economies thrive and which fall behind. Bangladesh must choose its path with clarity and urgency, for the cost of delay will only grow in a world where tariffs and regulations have become weapons of geopolitical competition.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing the challenges of new global trading system",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-the-challenges-of-new-global-trading-system-1762785001",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       November 11, 2025 00:00:00  \nThe story of how a 13-year-old adolescent girl, Juliana Paratha, of Colorado in USA, committed suicide following long conversations with an AI chatbot, as reported by BBC shocked many. The girl shared her most private emotional experiences with the chatbot. In fact, the chatbot set up a manipulative, sexually abusive relationship with the girl and at a point isolated her from her family and friends. After Juliana's death, her mother, Cynthia Paratha, finally discovered to her utter dismay the relationship that Juliana had developed with a particular chatbot launched by a company unknown to her. The website app of the company called, Character.AI, allows its users to create customized AI personalities with whom they can converse. Initially, the chats with Juliana were innocuous which gradually turned sexual. The chatbot won't let her go even when she wanted to quit and finally led her to take her own life. Notably, Juliana was a very bright student and athlete, but within months of her acquaintance with the chatbots of Character.AI, she lost her way finally leading to the tragic end. Juliana's family filed lawsuit against Character.AI. \nClearly, this is the kind of danger that AI chatbots pose to people who want to use them as their mental therapist. Those most at risk are the adolescent boys and girls who are fond of the new technology and, more so, because unlike humans, the AI chatbots are not judgmental. Rather they are too eager to validate the young users' views and opinions about themselves. And it is exactly here that the danger lies. Imagine an AI chatbot that uncritically supports whatever opinion an emotionally disturbed teenage boy may have about himself. In case, the boy shares self-destructive views with the chatbot, it, unlike a human therapist, would extend instant support to his dangerous thoughts. Juliana committed the same mistake by believing the sycophant chatbots. In truth, the AI platforms are designed in such a way that the users would remain glued to it as long as possible. In this connection, the American Psychological Association (APA) has claimed that AI chatbot companies and their products are using 'deceptive practices' by passing themselves as trained mental health providers.\" \nC. Vaile Wright, a licensed psychologist and senior director of APA's Office of Health Care Innovation, said, \"The level of sophistication of the technology, even relative to six to 12 months ago, is pretty staggering. And I can appreciate how people kind of fall down a rabbit hole.\" What psychologist Wright suggests is indeed scary. The speed at which AI is evolving, a time may come when the machine might surpass humans even in its understanding of human mind. Small wonder that Geoffrey Hinton, who is called the Godfather of AI and winner of Nobel prize in Physics for his foundational work in deep learning and artificial neural networks, left Google in 2023 so he could speak freely about the dangers of AI. His main concerns, however, were misuse of AI by malicious actors, job displacement, regulation and AI safety issues. So, the real fear is not exactly about a future controlled by superintelligent machines as depicted in science fiction novels. Clearly, it is about what damage future AI chatbots might do to other Julianas unless the companies producing them are brought under strict regulatory control. \nUnable to access support from therapeutic service providers, people with mental health conditions often look for low-cost AI therapy chatbots. But new research by the Stanford University has shown that these tools can introduce biases and failures that could result in dangerous consequences. An experiment with AI chatbots as mental therapists showed that the chatbots were more prone to stigmatize certain conditions like alcohol dependence and schizophrenia than depression. Such inherent biases of AI therapists is something concerning.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is an AI therapist dependable?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-an-ai-therapist-dependable-1762785072",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 11, 2025 00:00:00  \n\nFor Generation Z, trolling someone online has become a source of amusement-a form of digital entertainment that often masks real cruelty. Whether on the streets, in offices, or in neighbourhoods, any unusual or awkward incident is instantly captured on video and shared online \"for fun.\" People proudly say, \"I made it viral,\" as if it were a badge of honour. But if we pause and ask our conscience, is trolling really funny? Is it even right?\nTrolling, in simple terms, involves intentionally posting offensive or provocative comments about someone online, or sharing their photos or videos without consent to make them a target of public ridicule. On the surface, it may seem harmless or humorous, but in reality, it is both morally wrong and legally punishable.\nFrom a moral standpoint, everyone has the right to freedom of expression, but no one has the right to humiliate another person. When we troll someone online, we rarely consider the consequences. Yet the person being mocked may suffer deep psychological trauma, face social humiliation, or encounter backlash from family and community.\nLegally, sharing another person's image or video without their permission violates privacy and can constitute defamation or cyber harassment under existing laws. Sadly, many in today's digital generation seem oblivious of it. They record and upload others' private moments without consent, celebrating viral attention while ignoring both the legal and ethical implications.\nEntertainment has its rightful place in movies, games, and art-not in mocking real people's pain. What seems like a joke to one person can cause lifelong distress to another. A single \"funny\" clip can destroy someone's reputation, confidence, or even their will to live.\nIn an age where virality is often valued over virtue, empathy is not outdated. The internet was built to connect us, not humiliate each other. It's time to laugh with people, not at them.\nLaboni Akter Kobita \nDepartment of Public Administration \nJagannath University \nlaboniakterkobita6@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Troll culture: Cruelty behind laughter",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/troll-culture-cruelty-behind-laughter-1762785095",
        "news_paper_name": "The Financial Express",
        "publish_date": "11-11-2025"
    }
]