[
    {
        "full_article": "An explosion in a moving car near Red Fort in Delhi on the evening of November 10, 2025, which killed 13 people and injured several others, has led to the police invoking the Unlawful Activities (Prevention) Act (UAPA) and the Explosives Act. The suggestion is that the incident is being investigated as an act of terrorism. The National Investigation Agency is in charge of the investigation. Prime Minister Narendra Modi and Home Minister Amit Shah have vowed to bring the culprits to justice while the Opposition has sought accountability from the government. The suspect linked to the vehicle has been identified as Umar-un-Nabi, a doctor from Pulwama district in Kashmir. The pattern of developments in recent days suggest that the suspect, who died in the blast, was linked to a ring of other people who were allegedly plotting terror strikes in the country. The public will have to wait for greater clarity until investigators are in a position to reveal more information. At this juncture, speculation and rhetoric must be avoided, and no effort should be spared by the government, the Opposition and the media to promote peace and calm in India in the face of this deeply troubling incident. Mindless violence targeting innocent civilians has long been a scourge for India. However, organised incidents of terrorism have been confined to conflict zones in recent years. The blast in the national capital is, therefore, alarming.Counterterrorism has been a topic of polarising debates in India and around the world. In the Indian context, the idea that an allegedly ‘soft state’ allows terrorism has been popularised by the Bharatiya Janata Party, which has been in power since 2014. The Centre has tweaked laws in order to empower investigators, and making it difficult for any accused to defend against terror charges. Hard laws have been accompanied by sweeping security measures by central and State forces. And a smart and effective security policy is indicated by the absence of incidents, that go unnoticed, even as a single lapse can cause a major event and public outcry. It is notable that a potentially more dangerous conspiracy of a chemical terror strike may have been averted with the arrests of several people across States, as well as the recovery of arms, explosives and other material. That said, it is reasonable to assume that policing is only one component of any comprehensive national security approach. A rapid and transparent investigation should be followed by proactive political measures by the government to reassure the citizenry. Terrorist strategy universally is to trigger social chaos and undermine the legitimacy of the state. An effective counterterrorism strategy must also promote social harmony and reinforce the legitimacy of the state.  Published - November 12, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        New Delhi\n                    \n                            /                      \n                        \n                        explosion\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        arrest\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        investigation",
        "headline_1": "​Act of evil: On the Delhi blast",
        "headline_2": "Promoting social harmony is integral to any counterterrorism strategy",
        "link": "https://www.thehindu.com/opinion/editorial/act-of-evil-on-the-delhi-blast/article70267454.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "12-11-2025"
    },
    {
        "full_article": "Trump declares war on a city for something that took place 269 years ago \nDonald Trump in the Oval Office. Enter secretary of war, Pete Hegseth. \nTrump: Wassup Pete? You’re looking as grouchy as a grizzly with a sore butt. \nPete: Well, boss, you make me secretary of war but then you say you’re making peace break out all over the world and aiming to get a Nobel Prize for doing that. Makes me feel sorta dumb. \nTrump: Cheer up. I got a nice war comin’ up for you in Nigeria. \nPete: Nigeria? Where’s that? \nTrump: Someplace in Asia or somethin’. Whatever, I hear they’re killin’ Christians, so we’ll have to go to war with ’em to stop that.\nPete: Oh goody, I can’t wait to go fight Nigeria, wherever it is. \nTrump: And there’s more good news. In a place called Calcutta 146 good Christian folk were put into somethin’ called a Black Hole and 123 of ’em died. \nPete: Golly. When did that happen? \nTrump: In 1756, I think. But it took a while to track it down because the sneaky Calcutta guys went and changed their name to Kolkata to throw everybody off the scent. Those guys are sneakier than those ratfink Commies called Democrats, who want America to be a Democracy! \nPete: So along with Nigeria, we get to go fight those Black Hole bozos as well! I’m rarin’ to go! But say, boss, what is a Black Hole? \nTrump: Dunno. Some science thing.  \nPete: Maybe we can ask one of our scientists.\nTrump: Can’t. All our scientists have emigrated to Canada. But I heard that Black Holes are darn tricky, and once something gets into ’em, it can’t get out, not even light. An’ Black Holes can be anywhere. \nPete: There could be a Black Hole here? \nTrump: No siree! I shone a flashlight through my right ear an’ the beam came outta my left ear, no Black Hole – just empty space!\n\n",
        "headline_1": "Woe, Calcutta!",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/woe-calcutta/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-11-2025"
    },
    {
        "full_article": "Voting done, the state shows again its high political awareness despite its low per capita income & underdevelopment\nFor a state that has seen 23 politicians become CM over 37 tenures – central rule and Nitish’s multiple oath-taking since 2015 aside – who becomes CM this time hasn’t appeared to have been a big deal for Bihar as voting came to a close. Which is interesting, because while all reports suggest ‘loyalty’ to Nitish is near-intact, Bihar voters are equally conscious of some concerns that have swirled throughout the campaign. To the point that NDA did not play on the front foot with a CM-face. MGB went with Tejashwi, but not without adding a deputy CM in Sahani, opposition’s EBC face as counterweight to Team Yadav, whom NDA brands as problematic for state’s law & order and many pundits have said this is one of RJD’s handicaps. Of course, this being politics, JDU and RJD were also in govt together. \nHigh turnout was inevitable given new voter rolls – some 65L names deleted and 22L names added. SIR has had its impact also in jolting voters to view their vote as more than just ‘habit’, a renewed interest in ‘making the vote count’ especially since the majority in Bihar relies on govt dole and migrant income for everyday survival. So what mattered to the Bihari voter this time who, it is said with contempt by city-based pundits, votes his caste? Nitish loyalists have long defended his flip-flops between NDA and MGB as the veteran having done what he deems best for his ‘people’. So caste remains key yet a non-issue in a way, since both alliances stitched up candidacy in step with 2023’s caste survey. \nBut 2025 has been a new ballgame in the generational shift in both electorate and party brass. With this, the question of jobs became critical. The enduring thing about Bihar is that the state that hugs poverty, like an infant its mother, shows itself, time and again, as so acutely politically aware. \n\n",
        "headline_1": "Bihar’s The Boss",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/bihars-the-boss/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-11-2025"
    },
    {
        "full_article": "Emerging link of doctors from J&K to Delhi blast points to indoctrination of white collar professionals\nMore than a day has passed since a car blew up outside Delhi’s Red Fort in the evening rush hour. Some answers have become clear, but some questions have become more tangled. We now know that at least 13 people were killed and 30 injured in the explosion, which is the highest toll in Delhi since the 2008 serial blasts that claimed 30 lives. We’ve been told that a mixture of ammonium nitrate and fuel oil – perhaps not RDX or some other sophisticated explosive – likely caused the mayhem. We know the car that exploded was sold and re-sold several times in the past few weeks. Circumstantially, this looks like a terrorist attack, and govt has asked National Investigation Agency to get to its root. But since govt had not termed it a “terror incident” till the time of going to press, we will proceed with the same restraint.\nTwo questions uppermost on everyone’s mind are why, and how. The answers that are emerging are hazy in detail, but indicate a “conspiracy” – the exact word PM used on Tuesday. Going by reports, the blast was precipitated by the unravelling of a larger conspiracy. J&K Police’s probe into pro-Jaish posters led it to a doctor and his 350kg stash of ammonium nitrate in Faridabad, Haryana. This doctor named another in Saharanpur, UP. A third doctor, known to both and a J&K native like them, is believed to have been driving the explosive-laden car and triggered the blast. DNA samples from his kin might confirm this in the next few days. A woman doctor, who is allegedly part of this conspiracy, has also been arrested. To come back to ‘how’, the sudden arrests and seizure of ammonium nitrate over the weekend, might have urged one of the remaining plotters to the fatal step.\nWhy is a much bigger question, however. Why would doctors with clear career paths before them choose to kill innocents? But it’s not altogether so surprising because the Indian Mujahideen terror wave of the 2000s was led by engineers like Riyaz Bhatkal and Abdul Subhan Qureshi. So, white collars aren’t a shield against indoctrination. Post-Op Sindoor, it was expected that Pakistan would step up efforts to radicalise youth. Was Monday’s blast a result of its strategy? The fact that J&K and Haryana police have unearthed some 3,000kg of ammonium nitrate in recent days makes one wonder whether the conspirators were aiming for just one blast. We need more answers, and we need them fast.\n\n",
        "headline_1": "Plot Thickens",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/plot-thickens/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-11-2025"
    },
    {
        "full_article": "65% of households have a migrant. Their remittances are 50% of a household’s income. Outmigration tripled Bihar’s rural wages, ended exploitative relations. Manufacturing employs just 5%. And it’s impossible for the state to create enough jobs for its growing youth population. In 2025, 12.8L completed secondary school. Also 27% of the population is below 15\nPolitical parties call for a halt to outmigration every assembly election. Much debate follows.\nAll of it is oblivious to Bihar’s historical development experience and reality.\n\nMigration from Bihar dates to colonial times, when the British sent peasants and workers as indentured labour to Fiji, Mauritius and Caribbean countries.\nMany Biharis also moved to Calcutta and Assam’s tea gardens.\nRead the full story on TOI+.\n\n",
        "headline_1": "Bihar & its migration model",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihar-its-migration-model/",
        "news_paper_name": "The Times of India",
        "publish_date": "12-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 12, 2025 00:00:00  \nOne of the conditions Bangladesh was to meet for utilising the multilateral lender IMF's US$4.7 billion loan package has been improvement in the country's tax-to-GDP ratio, one of the lowest in the world. Currently, the ratio is 6.6 per cent, which the IMF wants to be raised to 8.4 per cent within this year. \nAchieving that target would require the tax regulator, the National Board of Revenue (NBR), to mobilise an increased amount of revenue by way of widening the tax net and doing away with the various facilities and incentives in the form of slashing tax, outright waivers, incentives, discounts and various other benefits it has been awarding to businesses both small and big. In this connection, the multilateral lender has urged the NBR to impose new taxes on the businesses as well as withdraw the tax exemptions they have already been enjoying under the NBR's previous commitment. But the tax regulator during its recent meeting with the IMF team, which had been on a visit to spot-check the progress on the utilisation of its tied loan package, did, reportedly, expressed its inability to suddenly withdraw all tax exemption measures before their expiry dates. The NBR's position is quite understandable. For whatever decisions the tax regulator might make, businesses plan their investments and expansion policies based on those.\nMoreover, the slapping of a uniform 15 per cent VAT on all goods and services, as suggested by IMF, runs the risk of fuelling inflation as well as hurting the essential goods and services sectors including basic foods, poultry, fisheries and vital healthcare services. Similarly, any abrupt withdrawal of the tax exemptions or imposition of new taxes midway is apt to send a wrong signal to investors about the government's overall business policy, particularly when it looks hostile to investment in general. Worse, it might raise questions about the very predictability of the government's policy stances. Reportedly, following the IMF's recommendations in December and January last, the NBR withdrew income tax benefits for oceangoing vessels, though those provisions were valid till 2030. In a similar vein, the 'reduced 10 per cent corporate tax-benefit' for the local electrical goods manufacturers who were entitled to enjoy it till 2032, was not only revoked, but a fresh tax of 20 per cent was also imposed on them. As expected, in either case, seeking redress, the aggrieved parties went to law through filing writ petitions with the High Court, which stayed the government's orders. This is undoubtedly embarrassing for the government, or tax regulator for that matter. Worse, the example might encourage other investors similarly taxed also to seek the court's intervention to resolve their issues. \nAs the tax regulator is confronted with such challenges while implementing the multilateral lender's recommendations in the case of shipping and electrical goods industries, the removal of the tax waivers being enjoyed by other sectors including the country's vital foreign investment earning sectors like the Export Processing Zones (EPZs) and Economic Zones (EZs) may not also go unchallenged. If common sense is any guide, the government's tax policy should be rational and predictable so that those already in business may duly accommodate it, while the would-be ones might plan accordingly. Under any circumstances, the tax policy should not frighten off investors which goes against the basic premise of the tax regulator. The premise is to increase revenue. Under the circumstances, to meet the IMF's obligations, the government would be well-advised to take a rational approach to cancellation of tax exemptions, preferably in a phased manner without adversely affecting investments.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Tax incentives vs IMF conditionalities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tax-incentives-vs-imf-conditionalities-1762870640",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       November 12, 2025 00:00:00  \nNow that the dust has begun to settle after Zohran Mamdani's decisive victory in the New York mayoral election, the question that looms large is whether he can deliver on his ambitious promises as a self-declared democratic socialist. His victory, though confined to one of the world's most diverse and complex cities, resonates far beyond its borders - symbolising both a resurgence of left-wing populism and a moment of reckoning for American politics.\nSince Mamdani's sweeping primary win in June this year, the term 'democratic socialism' has surged into mainstream public discourse across the United States. For many, it embodies a renewed moral and political challenge to the country's widening inequality and corporate-dominated capitalism. Yet for others, it remains a misunderstood, even threatening concept - one that political opponents have eagerly weaponised.\nIn the final months of the campaign, President Donald Trump repeatedly derided Mamdani as a 'communist', reviving Cold War-era rhetoric in an attempt to undermine his credibility. Mamdani, however, retorted firmly. Appearing on NBC's Meet the Press in June, he rejected the accusation saying: \"I am not.\" He then went on to define what his politics truly stands for - an ethos inspired less by ideology and more by empathy and justice.\n \"When we talk about my politics,\" Mamdani explained, \"I call myself a democratic socialist in many ways inspired by the words of Dr. Martin Luther King Jr., who said, \"Call it democracy or call it democratic socialism, there has to be a better distribution of wealth for all of God's children in this country.\" Drawing from King's 1961 speech, Mamdani highlighted the irony that while national income inequality has declined modestly in recent years, it has grown sharply in New York City - a city of immense prosperity but also of deep poverty. \"What we need,\" he concluded, \"is a city where every single person can thrive.\"\nDefining democratic socialism, however, remains a bit tricky. There is no single doctrinal statement that encapsulates it. In essence, democratic socialists advocate for collective ownership or public control of essential services - such as health care, housing, energy, and transportation - to ensure that the basic needs of all citizens are met equitably. The goal is not to abolish markets, but to democratise them; not to suppress enterprise, but to subordinate profit motives to public welfare.\n Mamdani's ideas align closely with the principles of the Democratic Socialists of America (DSA), an organisation that has, since the 1980s, been working to reshape the American left. The DSA describes its mission as promoting \"a humane social order based on democratic planning and market mechanisms,\" rejecting an economic system \"sustained by private profit, discrimination, and violence.\" With over 80,000 members across all 50 states, the DSA has become the largest socialist organisaation in the country, claiming a broad base of young activists drawn to causes like climate justice, affordable housing and labour rights.\nUnsurprisingly, the DSA's New York chapter has celebrated Mamdani's triumph as a watershed moment. Yet, Mamdani has been careful not to become the organisation's proxy. While sympathetic to many of its ideals, he has deliberately positioned himself as an independent-minded reformer rather than a doctrinaire socialist. His stance on contentious issues such as policing, misdemeanour offences and urban development has often been more moderate than the DSA's, reflecting his pragmatic understanding of governing a city as complex as New York.\nThis balancing act - between idealism and realism - could define Mamdani's mayorship. Democratic socialists often argue that systemic change cannot be achieved overnight; it must be pursued incrementally within existing institutions. As such, they rely on tools like organising, advocacy, and legislative reform. Mamdani's challenge will be to translate those ideals into policy outcomes that tangibly improve lives - cleaner neighbourhoods, affordable homes, better public transit, and fairer wages.\nImportantly, democratic socialists today are at pains to differentiate their philosophy from the discredited forms of socialism and communism that once dominated the 20th century. Those historical models, characterised by state control and authoritarianism, left deep scars on the term 'socialism' itself. The movement Mamdani represents seeks to reclaim the term as an expression of democratic renewal - a call for participatory politics, economic fairness, and social inclusion.\nStill, questions remain about how far Mamdani's model can travel beyond New York City's progressive landscape. Political analysts caution that the blend of moral idealism and municipal pragmatism that underpinned his success may not easily resonate in more conservative parts of the country. The urban electorate that propelled him to victory is, after all, markedly different from the heartland voters who remain wary of anything branded \"socialist.\"\nYet even sceptics acknowledge that Mamdani's leadership could reshape perceptions. If he succeeds in delivering efficient, equitable governance without alienating business or middle-class voters, he might well redefine socialism - transforming it from a taboo into a tangible promise of fairness.\nIn many ways, Zohran Mamdani's mayoralty will serve as a litmus test for the viability of democratic socialism within the framework of American democracy. For now, much of the world will be watching to see whether his \"New York experiment\" can reconcile lofty ideals with practical governance. \nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Mamdani's democratic socialism: A test case for US governance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/mamdanis-democratic-socialism-a-test-case-for-us-governance-1762870688",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 12, 2025 00:00:00  \nBangladesh has made significant progress in areas such as economic growth, education and digital services. However, one big problem still holds us back: the struggle to build a strong ethical culture and enforce genuine accountability across institutions and everyday life. This struggle is not because Bangladeshis lack values or morality; rather, it stems from a combination of entrenched systemic flaws, socio-economic pressures, cultural practices and weak institutional enforcement. \nIn many cases, unethical behaviour yields faster rewards than honest effort, creating a mindset where bending rules feels practical rather than shameful. In a system where influence can bypass procedure, public services often require \"managing,\" exam cheating is normalised and influential individuals rarely face consequences; as a result, citizens begin to internalise the notion that success comes from shortcuts rather than integrity. Economic insecurity magnifies this issue: when many families face financial uncertainty and lack reliable social safety nets, survival instincts sometimes override ethical standards.\nAdditionally, our education system places a heavy emphasis on academic performance and memorisation, while offering minimal attention to civic values, ethical reasoning and moral leadership. Young people grow up observing that honesty often goes unrewarded. At the same time, political networks, favouritism and informal influence can fast-track careers and privileges, gradually shaping a social mindset that normalises manipulation over merit. \nThe truth is, ethical culture cannot thrive in a vacuum; it must be supported by laws that apply equally to all, strong institutions that resist political interference, digital systems that minimise points of human corruption, and public recognition of integrity rather than wealth or power alone. Countries that successfully transformed their ethical landscape such as Singapore, South Korea, and Japan did so through consistent enforcement of rules, revised curricula, independent oversight bodies and cultural reorientation driven by leaders who modelled integrity. Bangladesh can follow a similar path by strengthening the rule of law, modernising public administration, digitalising services to reduce direct contact and opportunities for bribery, reforming education to include moral and civic training and promoting a national narrative that celebrates honesty, discipline and public responsibility.\nMaruful Hasan\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why can't we strengthen ethical culture?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-cant-we-strengthen-ethical-culture-1762870718",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 12, 2025 00:00:00  \n\nBangladesh's universities are often celebrated as beacons of knowledge, incubators of talent and gateways to the nation's future. Yet beneath this educational light lies an invisible and growing challenge: the spread of drug abuse.\nDrug use on campus is no longer an isolated phenomenon. Peer pressure, mental stress, and loneliness often push young people towards vaping, prescription drugs, cannabis, ecstasy, and other stronger stimulants. Residential halls, off-campus hostels, and social gatherings frequently act as entry points. The easy availability of these substances through friends and online networks has accelerated this culture.\nSimilarly, sexual behaviour among students is increasingly visible. Curiosity, peer influence and exposure to online content are shaping student behaviour. Reports indicate that irregular relationships, digital sexual exchanges and risky sexual practices are on the rise among unmarried students.\nWhile university administrations enforce rules and security measures, students often bypass them through social media, secluded areas, and off-campus spaces. Campus parties, social events, and nightlife culture further accelerate these unofficial activities.\nBangladesh's universities thus reflect a dual reality: remarkable academic achievements coexist with a largely unseen social dynamic that quietly shapes student behaviour, relationships, and experiences. Addressing this requires not only strict enforcement of rules but also awareness programmes, counselling, and open dialogue to guide students towards responsible choices.\nIbrahim Khalil \nStudent\nPatuakhali Science and Technology University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Easy availability of drugs on campus",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/easy-availability-of-drugs-on-campus-1762870746",
        "news_paper_name": "The Financial Express",
        "publish_date": "12-11-2025"
    }
]