[
    {
        "full_article": "The initiative by the newly appointed commissioners of the Election Commission of India (ECI) to invite political party representatives and leaders for an interaction to “strengthen electoral processes” is a welcome move. The move was precipitated by the rising complaints and grievances raised by the Opposition relating to voter registration and turnout, and other matters concerning the conduct of elections. The ECI has also asked parties to submit suggestions on issues concerned besides instructing provincial officials to interact with party representatives on a regular basis. In the recent past, the ECI had taken an unusually aggressive posture in responding to the Opposition’s complaints, which included being dismissive of genuine grievances such as undue delays in publishing voter turnout figures and even going on to admonish its critics. Such gestures only deepened distrust among political parties. While the Opposition has sown so much doubt on issues such as the functioning of the Electronic Voting Machine, resulting in an atmosphere of scepticism seeping into the minds of a majority of voters, the ECI could also have done more to reassure voters about the robustness of the electoral process related to electronic voting. Other legitimate issues, which include regulation of campaigns, action against hate speech, and the timing of elections at various levels also need a thoroughgoing review, and the ECI must be receptive to the critique of its functioning on these issues. There is also the question of the constitution of the ECI and the appointment of the Chief Election Commissioner, but that is a matter now in the hands of the Supreme Court.One of Indian democracy’s most salient features since Independence has been the ECI’s evolution and its autonomous role in the conduct of periodic elections, leading to increased voter participation and more faith in electoral democracy. This conduct, as the processes evolved, has emphasised transparency, accountability, and the clear and robust release of relevant and verifiable information related to elections. While the Electors Photo Identification Card issue related to duplicate numbers for voters across States is largely trivial — as the ECI has averred — the more serious issues related to voters being registered in different polling locations require to be rectified. The ECI must also ensure a level playing field during campaigns so that there is no undue advantage for the ruling party — a grievance widely expressed by Opposition forces across States. Regular interactions with political party representatives and a clear release of verifiable information will go a long way in allaying fears about the tried and tested electoral process in the country. Published - March 13, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "​Welcome gesture: On the ECI and interaction with political parties",
        "headline_2": "The Election Commission of India’s changed approach to engaging with critics is a good move",
        "link": "https://www.thehindu.com/opinion/editorial/welcome-gesture-on-the-eci-and-interaction-with-political-parties/article69322549.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "Ukraine’s decision to accept an ‘immediate, interim’ 30-day ceasefire with Russia, which can be extended upon mutual agreements, is an important first step towards shutting down the three-year-long war. The decision, announced in a joint statement issued by the U.S. and Ukraine, after senior-level talks in Jeddah, Saudi Arabia, also shows that U.S. President Donald Trump’s heavy-pressure tactics seem to be working on Kyiv, at least for now. Until recently, Ukraine had ruled out any ceasefire, arguing that Moscow would use a truce to rearm itself. Ukraine, which had demanded a complete Russian withdrawal from all the territories it had captured, including Crimea, as a pre-condition for talks, had floated the idea of freezing the conflict on the current line of contact in return for NATO membership. Later, Kyiv’s demand shifted to security guarantees from the West. But the Trump administration ratcheted up the pressure by halting all military assistance and intelligence sharing. Up against the wall in Jeddah, Ukraine accepted the American proposal and agreed to sign a mineral deal “to expand Ukraine’s economy” and guarantee its “long-term prosperity and security”. The U.S. immediately resumed military and intelligence assistance for Kyiv.But more complicated is the next step. The ball is now “in Russia’s court”, said Marco Rubio, the U.S. Secretary of State, after the Jeddah talks. U.S. officials are expected to travel to Moscow to discuss the proposal. If there is a ceasefire, Russia and Ukraine are expected to begin direct talks, to bring the war to a definite end. But, both sides have escalated their air war. Last week, Russia launched massive missile and air strikes on Ukraine, targeting its energy infrastructure. On Tuesday, hours before the Jeddah talks began, Ukraine unleashed its largest drone strike on several parts of Russia, including Moscow. Russia is also making dramatic advances in its Kursk region, where Ukraine still holds on to some territory. If Mr. Trump had leverage over Ukraine with which he forced Kyiv into accepting his proposal, he has very little influence over the Kremlin. But Russia should see the tilt in Washington and the U-turn in Kyiv as an opportunity. It has also suffered huge losses and its relationship with the West, in particular with Europe, has been badly damaged. Its economy is under heavy sanctions. The U.S. has already accepted some of Vladimir Putin’s demands, such as ruling out NATO membership for Ukraine. Instead of continuing this disastrous, illegal war, which has claimed tens of thousands of lives on both sides, the Kremlin should respond positively to the offer for truce and start direct talks with Ukraine to find a lasting solution to the conflict. Published - March 13, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Ukraine\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        minerals\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        economic sanction",
        "headline_1": "Time for truce: On the Russia-Ukraine conflict",
        "headline_2": "Russia should use the ceasefire opportunity to end the war",
        "link": "https://www.thehindu.com/opinion/editorial/time-for-truce-on-the-russia-ukraine-conflict/article69322058.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "It worked for so many greats. Ask Mr Birla \nThey have all the Deewar-appointed swag, but like Shashi Kapoor’s character these guys put mater above material goods. Kumara Mangalam Birla didn’t quote the now-iconic ‘Mere paas maa hai’ line, but came close at the ET Awards for Corporate Excellence  last Saturday. Accepting the Business Leader of the Year trophy, he rewound to Class 1 when he was called on stage to receive the Best Student prize from the Chief Guest – but forgot to thank that worthie. The next day the Principal severely berated him for this inexcusable lapse . The six-year-old heard out the tirade, and then said, ‘Sir, I didn’t remember to do this because I was busy looking at the shining eyes of my proud parents in the audience.’ Mr Birla, now 57, then added, ‘Today, I’m again holding a valued award, but looking at the shining eyes of my proud mother in the first row.”   \nAll other eyes in the power-packed theatre glistened too.\nThanking everyone  bar  pet pooch and part-time help is mandatory at all  award ceremonies, but this was the choke-up moment. My mind spiralled to two other tycoons, Rai Bahadur M.S Oberoi and Captain CP Krishnan Nair. While researching their biographies, I was constantly reminded that both owed first debt to their mother — indigent women far from ‘Tata-Birla’ shorthand for immeasurable wealth. \nBhagwanti Oberoi was a doughty Sardarni who, widowed at 18 and hating the taunts,  had simply picked up her one-year-old and walked to her maternal home in Bhaun, now in Pakistan. She didn’t stick to the parathas, but instead learnt from her moneylender father, all the while pushing little Mohan along on her intrepid drive. How else would a callow youth have found the audacitiy to waylay the English manager to ask for a job at The Cecil Hotel, Raj Simla’s snootiest? Years later, he could mop up funds to buy his own first hotel there thanks to Bhagwanti’s network of Punjab fief lords; even princes get strapped for ready cash. \nMadhavi Amma lived in even more obscure Kunnavil in Kerala’s Kannaur district, tirelessly drying coconuts for copra, oil and husk. She forced ambition down the throat of her  little ‘kochukrishnan’ along with the meagre breakfast of fermented rice-water spiked with lime pickle – and nightly tales of mythic Malabar warriors. She badgered a local politician to get him into Raja High School instead of  dropping out after  Oorpozhassikavu Elementary like his poor, Vaniya peers. Madhavi Amma’s instilling of self-worth gave our Dalit lad the gumption  to  stride to the dais and deliver a spontaneous paean to chief guest, Valiya Chirrakal Raja himself — who, as impressed as flattered, paid his  fees right through college. Next, Madhavi Amma astutely used a humble prawn pickle to push Krishnan on the radar  of  powerful VP Menon, who would become mentor and door opener.  \nTo their dying day, both legendary hoteliers said ‘mum’s the word’. Loud, clear and gratefully.\n                                             ***\nAlec Smart said: “Yes, we need delimitation – on boundaryless politicking.”\n\n",
        "headline_1": "The ‘Maa’ paas-word",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/247615/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "Industry promises megabucks at sarkari biz summits ‘cos the point is headlines, not bottom lines \nNext time, dear reader, you see a headline saying MoUs worth xx lakh crores signed in a state’s business summit, tell yourself this: what you’ve just read is mostly fiction. Maha CM Fadnavis signed 61 MoUs in Davos in Jan, worth Rs 15.7L cr. Less than three months into the year, investor summits have already generated other fairy tale MoUs: Kerala Rs 1.5L cr, Assam Rs 2.5L cr, Chhattisgarh Rs 3L cr, Bengal Rs 4.4L cr, Karnataka Rs 10.6L cr, Odisha Rs 16.7L cr, and MP, a staggering Rs 30.8L cr. Most states don’t have the capacity to absorb this much investment over even a longish period of time. No state gets more than a tiny fraction of what’s MoUed, some not even that. So, what’s going on?\nFirst thing to know is that it’s been going on for a while. CPM’s Somnath Chatterjee did such energetic investor wooing for Bengal, getting those inevitable newspaper headlines, that he earned the moniker, ‘MoU dada’. The gentle mockery behind that was completely lost on politicians, of course. Decades later, Mamata’s biz summits do the same. Perhaps, we can call her ‘MoU Didi’.\nBut if MoUs are barely worth the official letter-headed paper they are printed on, why go through all the effort? For one, in India, since all states and GOI are in on it, nobody will call out anyone else. But more important, the point is to get the headlines. Leaders feel good seeing newspapers print investment promises with many zeroes. Captains of industry feel good, in part because they have made leaders feel good. And it’s not just here. Trump has had billionaires stand next to him and promise the moon and Mars, because super rich guys know the quickest way to his good books is the promise of big dosh. Softbank, Oracle, OpenAI got big headlines by promising $500bn for Trump’s AI infra project, Stargate. Per Trump, Saudi’s boss, MBS, has trumped everyone – by apparently promising one trillion dollars investment in US, just to try and get Trump to visit Riyadh.\nIs failure to invest a MoUed amount, even over a long period, a breach of promise? Not at all. This ain’t a matter of bottom lines, it’s about headlines. Leaders and industry captains will stay happily MoUed. You know what they say for those, mostly fictional, happily married couples – till death do them apart. \n\n",
        "headline_1": "Happily MoUed",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/happily-moued/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "Bengal BJP neta’s comments are a new low in incendiary rhetoric. Does it even help in polls?\nThat Bengal LoP Suvendu Adhikari said BJP would physically throw out Muslim MLAs from the House after the party “forms the next govt” – in a speech he made inside the house – is jaw-dropping. That miles away, his party colleague UP MLA Ketakee Singh, called for a “separate hospital wing for Muslims” in a proposed medical college in Ballia is almost equally terrible.\nPerhaps, the strategy behind such statements is to normalise anti-minority rhetoric. But the thing is, communal talk has an electoral cost. Bengal polls are in 2026. Mamata has wasted no time accusing BJP of “targeting Muslims during Ramzan to divert attention from economic and trade issues.” Anti-minority rhetoric flowed ahead of 2024 LS elections. In Bengal, Trinamool won 29 seats with 46% vote share. BJP won 12, down from 18 (2019), with 39% vote share. In UP too, Akhilesh Yadav’s SP won 37 seats with 34% vote; BJP crashed to 33 from 62, with 42% of the vote. We have to see whether and how BJP central leadership addresses the two MLAs’, particularly Adhikari’s, rhetoric. But electoral evidence suggests inflammatory chatter may be producing diminishing returns. Even in Haryana, BJP lost 5 LS seats from its earlier 10-seat haul – part of it, fallout of the Nuh violence and bulldozer politics the year before. Bottom line: rival parties often gain from legislators’ incendiary remarks. That’s why, in state polls following LS, there was a noticeable absence of sharp communal rhetoric.\nThe real danger of religion-based provocative statements from elected representatives is that they spur goon elements who’re ever ready to get violent. Also, it encourages parts of the executive in some states to maintain a low hum of harassment in day-to-day lives of those targeted. That’s a truly sad commentary on politics.\n\n",
        "headline_1": "Words that hurt",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/words-that-hurt/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "By Narayani Ganesh\nWhen your mind is resting, your body is probably doing a routine chore. Sometimes when your body is resting, your mind is super active, plotting and planning or simply mulling over past events, or worrying about the future. There is no complete rest because mind and body are not at rest together, there is no synergetic rest. Even during sleep, the mind may dream, so it is not really at rest, even though the body is completely relaxed. Vietnamese Zen Buddhist master Thich Nhat Hanh remarked, “Not many of us know how to allow our body and mind to rest. We are always struggling. We cannot resist being active, struggling all the time. We struggle even during our sleep.”\nHow can one achieve complete rest of both mind and body, at the same time? Let’s not say, when you die, both are at rest. The body at death, is dead. The mind, we have no idea what happens to it – whether it transmigrates via soul along with memories and vasanas (past karmas). That is an entirely different domain.\nDuring meditation, you try to calm both body and mind. Perhaps in some kinds of meditation that do not require you to chant, listen to music, or focus on an object, the mind is truly resting, yet, some thoughts do come and go. Body and mind are closely interrelated; what happens in one, affects the other, whether good or bad. Medical science has proven that negative emotions that play on one’s mind tend to adversely affect bodily functions and can even aggravate existing ill health or at times cause new diseases, leading to high blood pressure, heart conditions, diabetes and skin disorders. Once the body is compromised, the mind finds it difficult to stay centred, unless of course one puts in superhuman effort and is consistent in practice. But as always, prevention is better than cure, so why not find ways to overcome negativities and nip them in the bud before they cause havoc in body and mind?\nSister Chan Khong points out that the practice of deep relaxation is based on a teaching called mindfulness of the body in the body, as stated in Kayagata-sati sutta, Majjhima Nikaya 119 “in which the Buddha advises us to visit every part of our body so we know what is going on in our body. In the same way that we practice being aware of every state of our mind – accepting, understanding, then releasing each state that arises – we practice this way with our body, visiting every part with awareness, acceptance, care and without judgment.”\nWill Johnson quotes from Vajrayana Buddhism, from Tilopa’s ‘Song of Mahamudra’:\nDo nothing with the body but relax.\nLet the mind rest in its natural unformed state.\nBecome like a hollow bamboo.\nA cost-effective, soothing way to relax both body and mind is to soak in a warm bath as opposed to hurriedly taking a shower before dashing off to work or going to bed. An unhurried soak in the bathtub can work wonders – it relaxes your muscles, banishes aches and pains, opens your pores. And your mind embraces happy thoughts and vistas that, together with a relaxed body, create a wonderful, restful symphony. You are now a hollow bamboo…\nganeshnarayani@yahoo.com\n\n",
        "headline_1": "Tilopa says relax, become a hollow bamboo",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/tilopa-says-relax-become-a-hollow-bamboo/",
        "news_paper_name": "The Times of India",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "Child marriage, early pregnancy, and sexual harassment and violence are among the most persistent challenges plaguing the lives of adolescent girls in Bangladesh. While resistance to these trends has grown over the years, recent studies suggest that progress has been minimal, if not entirely stagnant. For instance, child marriage, often caused by a combination of poverty, entrenched social norms, and legal enforcement gaps, remains a blot on the country's otherwise positive records in some socioeconomic aspects. A UNICEF report, released on International Women's Day, reveals that Bangladesh has the highest child marriage rate in Asia, with 51.4 percent of women aged 20-24 married before they turned 18. This is quite alarming.\nFurther details from the report—such as that 24 percent of young women give birth before 18, and 28 percent of girls aged 15-19 have experienced physical or sexual violence from their partners—show how widespread and devastating the impact of child marriage has been. Moreover, only 47 percent of married teenage girls have autonomy over reproductive health decisions. According to the report, Bangladesh is also one of seven countries with less than two percent of adolescent girls having digital literacy. Girls aged 15-24 are twice as likely as boys to be out of education, employment, or training, making them more vulnerable to poverty and exploitation.\nThese findings show how the stakes remain heavily stacked against adolescent girls, especially if married early. The question is, why are we failing to do anything about it? This is not just about how barriers to girls' education and personal autonomy are hindering their life prospects; it's also about how their lack of agency and social empowerment is putting them in life-threatening situations. As well as risky pregnancies, intimate partner violence, or violence by husbands, remains another serious concern. In a climate where, according to a recent study by the Bangladesh Bureau of Statistics, 54 percent of women experience physical and/or sexual abuse by husbands at some point, young wives are more vulnerable. The fact that this threat is rarely acknowledged by society reeks of the still-pervasive patriarchy that justifies or covers up such violence citing family reputation and children's well-being.\nThe reality is, child brides are children, too, and we need to be able to protect them from this scourge at any cost. Two persistent obstacles to ending child marriage are financial hardships and weak law enforcement—problems that transcend gender issues but which must be addressed precisely because of such devastating impacts. We urge the authorities to adopt a zero-tolerance approach to child marriage, regardless of the reason behind it, and address the issues that continue to fuel it.\n",
        "headline_1": "Why are so many girls still married early?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/why-are-so-many-girls-still-married-early-3846746",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "Waterlogging in our port city in recent years has caused enormous suffering and economic loss. The government of Bangladesh has recently initiated efforts to find sustainable solutions to this problem. This hydro-climatic disaster occurs when the amount of source water exceeds what the sinks can accommodate. A better understanding of the sources and sinks of water will foster sustainable solutions to this issue.\nWaterlogging primarily occurs during the monsoon season, characterised by heavy rainfall. A practical solution entails—(i) identifying the sinks and (ii) enhancing their capacity to ensure that the volume of water from the source does not surpass it. Furthermore, we must tackle the factors that diminish the capacity of sinks, such as landfilling, the removal of hills, and eutrophication, among others.\nThe most easily accessible water sink is the inland water bodies, which include ponds, lakes, canals, and drainage networks. To get a rapid solution to waterlogging, we must increase the water-retention capacity of these inland water bodies. Dredging is a proven method to enhance the volume of water that reservoirs can hold. Additionally, dredging boosts interactions between lake water and groundwater. However, it is vital to manage the dredged materials properly, as mismanagement can cause them to return to the water bodies shortly thereafter.\nDuring heavy rainfall on certain days in the rainy season, a significant volume of water rapidly accumulates on the surface. This extra water necessitates enhanced drainage systems to keep the city free from flooding. Expanding and deepening the canals could increase their capacity to handle excess water. Furthermore, we could construct new lakes and drainage systems within the city, particularly in the areas most affected; this approach could significantly enhance the water retention capacity.\nAlongside enhancing the capacity of the sinks, it is equally crucial to mitigate factors that restrict the volume of sinks—(i) landfilling in any form must cease immediately; (ii) hill-cutting should be halted as it generates a large volume of clastic sediment, much of it ends up at the bottom of inland water bodies; (iii) strict solid waste management must be enforced to prevent any forms of solid waste, such as non-degradable plastics and household materials, from entering the drainage system as solid waste can restrict flow velocity and reduce the water retention capacity of reservoirs; and (iv) chemical and bio-waste from domestic and industrial sources should be segregated and disposed of separately since inland water bodies gradually lose volume due to harmful algal blooms and eutrophication, exacerbated by increased nutrient levels from such waste.\nGroundwater is a crucial destination for rainwater through the process of infiltration. Unfortunately, this aspect is often overlooked when planning to eliminate waterlogging. The reduction of open land restricts the infiltration process. Consequently, a substantial volume of water overflows that should ideally transfer into the groundwater; an increase in surface water heightens the likelihood of waterlogging. A research paper published by the Department of Geography and Environmental Studies at the University of Chittagong finds that between 1989 and 2011, approximately 15 percent of the exposed land in the Sholakbahar ward of the city was converted into various types of built-up areas. The situation is presumably similar in other wards of the city corporation. Reducing such a significant amount of open space presents a serious risk of waterlogging.\nIncreasing the amount of open space is a potential measure to ensure accelerated infiltration. Additionally, we could construct tiny artificial ponds throughout the city, designed with coarser rocks at the bottom, as fine-grained particles limit infiltration. The ponds need not be large; they could be situated along the streets in a manner that also contributes to the city's beautification. Furthermore, we can plan to establish recharge wells and soak pits to enhance infiltration into the groundwater.\nImpermeable streets also impede groundwater recharge. Permeable city roads can be constructed to facilitate the percolation of more water from the lane into the ground.\nBy implementing the aforementioned sink-based solutions, the city's waterlogging problems can be eased. In addition to tackling waterlogging, these measures will enhance functional hydrology and foster a clean aquatic environment that aligns with biodiversity.\nMohib Billah is doctoral researcher in the Department of Geography and Geology at the University of Turku in Finland.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Sink-based solutions can ease Chattogram's waterlogging",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/sink-based-solutions-can-ease-chattograms-waterlogging-3846021",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "I grew up reading many Greek myths—whether it was about Sisyphus's exercise in futility, Prometheus's gift of fire to humanity, or Orpheus's fatal mistake of looking back at his beloved in the underworld. Those myths may be far-fetched, but what felt real enough to touch were the myths around the fabled fabric—Dhaka muslin. Something about living in the world's largest delta through which the Meghna River flows made it so. The river being shrouded by fog, young women with nimble hands weaving away and singing sweet melodies, and the supple softness of the fabric that was believed to be made under water—all these made for perfect conditions for any passerby to spin the myth of mermaids melodising in the mist.  \nThe entire process of its production, from extracting the cotton fibre from a yellow flowering plant, Phuti karpas, that grew along the Meghna River to the fabric adorning royalty, involved 16 very elaborate steps that were carried out in different areas around Dhaka. The fibre was carefully cleaned using boal fish teeth attached to its jawbone. Bowls of water were scattered around during the process of spinning as it aided in the moistening of the air-humidity being a key ingredient to stretch it. The spinning would often take place in boats when humidity was at its peak, in early mornings and late afternoons. Young women carried out this task with their supple fingers and enviable eyesight. The fabric travelled the rich lands of Bengal and the hands of both the old and young before travelling the world. The Mughals refused to have their portraits drawn adorned in anything else but muslin. To the East, it went to Java and China, where in the early 14th century, the traveller Ibn Battuta wrote that it was highly prized. This fabric was what members of high society in Europe wore and scandalised entire courts by being accused of indecency in public. As such a fine fabric was unheard of and seldom seen in the West—it captivated the likes of Queen Marie Antoinette, Empress Joséphine Bonaparte, and the esteemed author Jane Austen. However, as quickly as the fabric took the aristocrats of the East and West by storm, it also disappeared in a blink of an eye.\nMy experience of seeing pieces of Dhaka muslin in the Victoria and Albert Museum in London was a conflicted one. A part of me was glad to see the fabled fabric so beautifully preserved. So many wonderful epithets given to muslin by historians played in my head, like \"vapours of dawn,\" and \"woven wind.\" But another part of me was pained, thinking about the \"kothis,\" the Mughals put muslin artisans into that subjected them to extremely harsh conditions, and the unrelenting greed of British colonialism that made this pride of Bengal go extinct. I have heard from disgruntled uncles sipping their late afternoon tea saying that the British cut off the thumbs of the muslin workers to ascertain the production of muslin dried up sooner than their blood spilled to the ground. Aunties discussed, while chopping vegetables, that acres of this fabric could be tucked into their less-than-modestly sized engagement rings. \nThe capitalist East India Company had no regard for the convoluted nature of how the muslin was made, it only cared that the demand was met. Hence, pressure was put on the artisans of muslin till they cracked. Moreover, the British took advantage of the demand for muslin and hard launched the discount \"muslin\" produced in the cotton mills of dreary England.\nUnfortunately, the cheaper prices they could offer far outweighed the need for the finesse of the real deal. This resulted in the cotton industry of Bengal coming to a screeching halt, and muslin artisans sought employment elsewhere. Fuel was added to the ravaging fire with the famines orchestrated by the terrible policies of the British colonisers in Bengal, which killed off many of these talented artisans. With their death, the intricate technique of weaving muslin was buried. Perhaps to mourn such a misfortune, Phuti karpas went extinct along the banks of Meghna. \nThe fabled fabric reached up to 1200 thread counts and today's rendition of \"muslin\" comes nowhere close—like an underachieving son making a mockery of the family name. However, there have been noteworthy efforts to revive the lost art of muslin weaving, which serves as a glimmer of hope for us to perhaps one day be adorned by this \"woven wind,\" which has been a favourite topic of every textile historian. Moreover, Dhaka and its surrounding areas later developed the traditional art of \"jamdani\" weaving fortunately, which has been protected as a form of intangible cultural heritage in 2013 by UNESCO.\nAs is quite evident, the success of the Bangladeshi garment industry, which is worth $47 billion today is not without precedence. But perhaps the rise and fall of muslin serves as a cautionary tale of artisans being squeezed to their limits and also that the extreme industrialisation of any product will result in those crafts being endangered and ultimately going extinct. \nRaina Sabanta is a barrister.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The rise and fall of Dhaka muslin ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-rise-and-fall-dhaka-muslin-3846006",
        "news_paper_name": "The Daily Star",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "A new healthcare destination for BD patients",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-new-healthcare-destination-for-bd-patients-1741792131",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Building social resistance against women's oppression",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/building-social-resistance-against-womens-oppression-1741792184",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Take action against pirates",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/take-action-against-pirates-1741792213",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Inclusion of street children in society",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/inclusion-of-street-children-in-society-1741792300",
        "news_paper_name": "The Financial Express",
        "publish_date": "13-03-2025"
    }
]