[
    {
        "full_article": "By staying the operation of Tamil Nadu’s multiple amended Acts — to the extent that they empower the government to appoint Vice-Chancellors (V-Cs) of 18 State universities — the Madras High Court has effectively halted the momentum that followed last month’s landmark Supreme Court verdict, which granted deemed assent to 10 Bills on which the Tamil Nadu Governor had inordinately delayed action. The interim order, delivered by Justices G.R. Swaminathan and V. Lakshminarayanan, effectively restores to the Governor-Chancellor, the powers of appointing V-Cs, which those very Bills had sought to divest. The result is a continuing stalemate: nearly a dozen universities remain headless, with appointments frozen until further judicial intervention. The Vacation Bench, acting on a petition by a lawyer, held that interim relief was justified because the impugned Acts “fall foul of the law” laid down by the Supreme Court in prior rulings on V-C appointments. These include Professor (Dr.) Sreejith P.S. vs Dr. Rajasree M.S. (APJ Abdul Kalam Technological University) and Gambhirdan K. Gadhvi vs The State Of Gujarat (Sardar Patel University). In both cases, the appointment of V-Cs was quashed for violating Regulation 7.3 of the University Grants Commission (UGC) Regulations, 2018, which govern the composition of search committees and procedures for V-C appointments. The High Court rejected the State’s argument that it had adopted the UGC Regulations in 2021 with a caveat excluding Regulation 7.3. The judges held that stripping the Chancellor of appointment powers was plainly unconstitutional — “... is so glaring and obvious that we cannot shut our eyes,” they wrote.What is equally glaring, however, is the misplaced urgency with which the Bench moved to deprive the amended Acts of legal effect. The High Court overlooked the Higher Education Department counsel’s submission that the State had mentioned before the Supreme Court seeking urgent listing of a petition to transfer the instant case to itself; and that the Supreme Court had indicated that the High Court may be apprised of this fact. Judicial propriety would suggest that a lower court must exercise restraint in such cases. Moreover, the interim order was passed without affording the State adequate time to file its counter affidavit. In any case, while the current impasse on V-C appointments in Tamil Nadu persists, given the conflicting case precedents — Kalyani Mathivanan and Jagdish Prasad Sharma among them — the Supreme Court, should it hear the case, must settle, once and for all, the critical question: can UGC Regulations issued by a subordinate authority override State legislation enacted under constitutional authority?\r Published - May 23, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        university\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Governor\n                    \n                            /                      \n                        \n                        laws",
        "headline_1": "​Misplaced urgency: On the Madras High Court interim order",
        "headline_2": "The Madras High Court has in effect undermined a Supreme Court ruling",
        "link": "https://www.thehindu.com/opinion/editorial/misplaced-urgency-on-the-madras-high-court-interim-order/article69606414.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "Ukrainian and Russian officials met up in Istanbul, Türkiye, last week, their first direct meeting since March 2022, the year when Russia invaded Ukraine. Little was achieved except for one agreement on swapping 1,000 prisoners of war each. The Ukrainian delegation rightfully complained that Moscow had made “new and unacceptable demands”. Russia’s posturing, however, seems to be a consequence of the dithering by Kyiv’s key ally, the U.S. In the run-up to the meeting, Kyiv, which has been on the back foot in the conflict, losing substantial territory in the east and reeling under failures such as the retreat from the Kursk offensive, had sought a 30-day ceasefire — an outcome that the U.S. was also pushing. While the U.S. has been discernibly less enthusiastic about continuing to arm and support the Ukrainians, during Donald Trump’s second term in the White House, Kyiv’s European allies had urged Moscow to agree to the ceasefire, or face increased sanctions and the transfer of weapons to Ukraine. After pushing Kyiv to the meeting without the ceasefire as a precondition, Mr. Trump had said on the eve of the Istanbul meet that it would not yield anything until he met directly with Russian President Vladimir Putin. True to his mercurial nature, he went on to say that the conditions of a peace deal — which he has been pushing as a means for the U.S. to exit the conflict — could only be negotiated between Russia and Ukraine, with possible help from the Pope.Amid this diplomatic uncertainty from Washington, the Russians have shown no inclination to back down from their maximalist demands on rejecting security guarantees for Ukraine in the event of a truce, and for its demilitarisation. This week, Russia continued to launch a barrage of attacks. Kyiv did manage to rally its European allies to support it militarily while imposing fresh sanctions on Russia. But the Ukrainian regime’s precarity in its eastern regions is evident with Russia continuing to hold on to significant territory and gaining ground in fresh incursions from the east. With Mr. Trump showing scant regard towards taking a consistent position, and seemingly staking out a line that is different from that of the Europeans, Kyiv might be left with a Hobson’s choice — accommodate some of Russia’s territorial demands to begin the process of peace or endure the attritional war with limited support. Mr. Putin might have seized the upper hand in the geopolitical dynamics of the war, but its effects have been devastating for Moscow as well. Reason suggests that peace would yield greater dividends than continuing an illegal invasion and this should allow for a fresh impetus for talks leading to a ceasefire. The ball is in the Kremlin’s court.\r Published - May 23, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Ukraine\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Turkey\n                    \n                            /                      \n                        \n                        prison\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        peace negotiations",
        "headline_1": "​No ceasefire: On the Russia-Ukraine war",
        "headline_2": "Russia is utilising the deepening chasm among Ukraine’s key allies",
        "link": "https://www.thehindu.com/opinion/editorial/no-ceasefire-on-the-russia-ukraine-war/article69606529.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "Murder of Israeli diplomats in US should make America understand what India says about terrorism \nElias Rodriguez shot two young Israeli diplomats in a high-security part of Washington, DC, on Wednesday, claiming he was doing it “for Gaza”. He shouted “Free, free Palestine” as police led him away. It’s the kind of diseased thinking that all terrorists, be they in Berlin, New Orleans or Kashmir, exhibit. Ron Halber, a Jewish community leader in Washington, summed up the dreadful absurdity of Rodriguez’s act: “(thinking) that shooting down two innocent young Jewish people…was somehow going to accomplish an objective 6,000 miles away is just horrible.”\nIf anything, Rodriguez did a great disservice to the people of Gaza who have been squeezed between Hamas and Israel for 19 months now, and whose plight – over 53,000 killed, and 2.1mn at risk of famine – is finally being acknowledged by the West. Canada, France and UK have even threatened Israel with sanctions. But the Washington killings, at least for a while, will switch the focus from Gaza’s famine to antisemitism. Netanyahu’s already painted it as “the terrible cost of antisemitism and the wild incitement against the State of Israel.” Just last week, Hamas’s praise for unidentified shooters who killed an Israeli woman in West Bank had made life hard for ordinary Palestinians, with Israeli far-right leaders demanding the destruction of their “terror nest” villages.\nAs a nation that has suffered terrorist attacks for decades – most recently in Pahalgam on April 22 – India has strongly condemned the killing of Israeli diplomats. So has the West, with Trump posting: “These horrible DC killings, based obviously on antisemitism, must end, NOW!” And there’s no doubt US will stand by Israel, but when it comes to terrorism in India, the West’s actions have not always matched its words. Take 2019’s Pulwama attack, for example. The White House’s statement at the time had called on Pakistan “to end immediately the support and safe haven provided to all terrorist groups operating on its soil”. Yet, in 2022, US under Biden went ahead with its $450mn F-16 fighter jet deal with Pakistan. Antony Blinken, US secretary of state at the time, had defended the deal without a hint of irony: “(it) bolsters its (Pakistan’s) capability to deal with terrorist threats emanating from Pakistan or from the region”. In 2023, UK placed an order for 200,000 rockets with Pakistan for Ukraine – providing a fillip to a terror-sponsoring nation’s ordnance industry. \nIndia’s position has always been clear – there are no good terrorists. You can’t run with them one day, and hunt them another time. The West is still to get this though.\n\n",
        "headline_1": "Pahalgam, Washington",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/pahalgam-washington/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "A Booker Prize winner’s lost luggage is a tale that will resonate with flyers around the world\nThe smile on Banu Mushtaq’s face as she held up her International Booker Prize trophy was lovely, and so was her sari. Except, it wasn’t the one she had planned to wear. In a tale that will touch readers no less than the ones she has written, her suitcase was lost as she flew to London – along with essential medicines and the silk sari she had chosen for the prize ceremony. The more we travel the greater the odds of finding ourselves in this situation, arriving at our destination without everything we had packed to match it. What to do then? Buy, beg, borrow, don’t steal. \nNot everyone simply moves on, though. A techbro mad at an airline losing his girlfriend’s luggage has set up LuggageLosers.com. It scrapes internet chatter 24/7 to publish live lost luggage data, which airlines don’t publish. Bad news for us? Indian airlines regularly feature at the top of this global ranking. The zen types say, every trial is an opportunity. If you have arrived in a strange land without your belongings, without the comfort and confidence that comes from those, it’s time to start finding out who you really are. Of course, for non-zen types, such advice turns unease into a throbbing headache. They have to restrain themselves from violence.\nWhat about the lost luggage itself though? Sometimes it is never reunited with its parents but finds new ones at ‘unclaimed baggage’ vents. Airlines and airports seem to find this setup quite satisfactory. As imagery from baggage handling across the world shows, treating our luggage with respect isn’t a priority at all. This is why many travellers have changed their packing habits altogether. What doesn’t suffice for others for five days, they can travel to five countries with. Their carry-on packing is a mastery of art, physics and chemistry. Now, it’s fingers crossed that Banu’s Booker trophy makes it safely to India, with her.\n\n",
        "headline_1": "Who moved my suitcase?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/who-moved-my-suitcase/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "Why foreign pipples cutting jokes about how we are telling like that only?\nNo doubt one foreigner putting up in Amsterdam itself, having a desi missus who has learnt him about how we are doing gupshup, put it on social media like a bullet to cut jokes about us for timepass. \nMind it, we can also cut jokes about foreign pipples. Like Britishers, who are not knowing even to call themselves Britishers, which is their good name, but call themselves British, which everyone knows is only a country that we call Bilayat. What to tell? If we were Britishers our heads would be eating circles and circles. \nThis foreign mister with desi missus has made listi of what we are telling. Starting starting, the listi has ‘Do one thing’. Too very true. We are always telling, ‘Do one thing’. If we were to tell ‘Do two things’, reply would come, ‘Why I do two things? You do one thing, I do one thing.’ Scientists telling it is division of labour.\nNext to next on listi is, ‘There is too less salt in food’. It is right to say there is too less salt in food, because all are knowing that food having not too less salt is bad for BP, which will make you admit to hospital. \nBut why on listi there is item, ‘He is my real brother’? Should we tell ‘He is not my real brother but fake brother, a fraudster, who by order of higher-ups, and big-big officers should be put under digital arrest today itself’. So what goes it of anyone’s father if we tell, he is my real brother? \nLast to last on listi, it is telling that we are too much telling ‘In India, I can get it for 100 rupees’. We are not mad, okay? Which is also on listi. Why for we are to tell, I can get this for 100 rupees in India? Just goes to showing that these foreign pipples even having desi missus are having too less sense. They are not knowing about one thing called inflation. \nOof, oh! What we are telling is I can get this in India for two hundred rupees only…\n\n",
        "headline_1": "Doing gupshup",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/doing-gupshup/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "Killing top Maoists like Basavaraju will hobble extremism, increasing prosperity will finish it  \nThe killing of top Maoist leader Basavaraju in Chhattisgarh on Wednesday is a morale booster for security forces and leaves Naxals on the backfoot. Basavaraju, as Amit Shah pointed out on X, is the highest ranking Naxal neutralised in over three decades of operations. He was allegedly the mastermind of the April 2010 Dantewada ambush in which 75 CRPF personnel were killed, and also the 2013 Jhiram Ghati massacre in which most of Chhattisgarh Congress’s top leadership was wiped out. Since 2017-18, he had led CPI(Maoist) as its general secretary, and carried a ₹1cr bounty on his head. \nBy eliminating Basavaraju, GOI has taken a giant stride towards its goal of ridding the country of Naxalism by March 31 next year. The fact that this successful operation – in which 26 other Maoists were killed – was carried out close on the heels of the 21-day Operation Black Forest that resulted in the arrest of 54 Naxals and the surrender of 84 others, shows the increasing momentum of govt’s assault on the last strongholds of Naxals. Last month, Shah had said the total number of Naxal-affected districts had reduced to 18 across seven states, from 38 in nine states earlier. And almost 90% of Naxal violence is now concentrated in six districts across four states.\nFor years, Naxal or ‘Left Wing Extremist’ (LWE) violence has been considered as India’s biggest internal security challenge – bigger than Kashmir – and Shah had acknowledged this in an interview to India Today recently. Back in 2006, Manmohan Singh had also said as much: “It would not be an exaggeration to say that the problem of Naxalism is the single biggest internal security challenge ever faced by our country.” At that time, the number of Naxal-affected districts was 160. It had blocked investments and held up development, perpetuating the backwardness of these regions. Now, as the threat abates, govt must fast-track development to ensure Maoists find no takers for their violent ideology.\nWhile Shah recently said, “Disgruntlement over the lack of development could be seen as a cause of Naxalism”, Singh’s diagnosis was similar: “Exploitation…iniquitous socio-political circumstances, inadequate employment opportunities…lack of land reforms – all contribute significantly to the growth of the Naxalite movement.” It’s not surprising that Naxalism’s retreat has coincided with India’s rapid economic growth. While guns will silence old ideologues, only prosperity will shut down the nursery of violence.\n\n",
        "headline_1": "Red star waning",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/red-star-waning/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "We are concerned by the continued turmoil at the National Board of Revenue (NBR) which puts a question mark not only on the viability of any tax reforms but also the future of proposed institutional reforms in other sectors. According to a report by this daily, the turmoil deepened on Wednesday as disgruntled tax, customs, and VAT officials launched a fresh five-day protest demanding the NBR chairman's removal and the repeal of the May 12 ordinance that split the NBR into separate entities for tax policy and revenue collection. The protests were triggered in particular by a clause in the ordinance that allows officers from the general admin cadre to lead the new divisions, raising fears of marginalisation of revenue cadre officers.\nThe government argues that the structural overhaul is aimed at preventing conflicts of interest between policymaking and implementation, but revenue officials say some provisions of the ordinance are discriminatory. However, while their grievances seem to have a point, their methods of expression—an initial five-day pen-down strike, and the subsequent escalation of protests after a failed talk with higher authorities on Tuesday—are unacceptable considering their disruptive effects across the tax administration. Reportedly, the protests have considerably hampered customs clearance and trade operations, leading to delays in tariff assessments and goods release, which in turn is disrupting supply chains and affecting businesses. The unrest also threatens the government's ability to meet its revenue collection target of Tk 463,500 crore, with Tk 178,500 crore still to be collected in the final two months of the current fiscal year.\n\nThe protesters, organised under the banner of NBR Reform Unity Council, insist they are not opposed to NBR reform or the separation itself, but want transparency, fairness, and proper inclusion of experienced revenue officers in the restructured framework. But if their protests escalate into a full work stoppage as planned, it would have a disturbing effect on trade, revenue collection, and public finance overall. Clearly, there can be no justification for the way the protesters chose to make their point.\nThe protesters, organised under the banner of NBR Reform Unity Council, insist they are not opposed to NBR reform or the separation itself, but want transparency, fairness, and proper inclusion of experienced revenue officers in the restructured framework. But if their protests escalate into a full work stoppage as planned, it would have a disturbing effect on trade, revenue collection, and public finance overall. Clearly, there can be no justification for the way the protesters chose to make their point, exploiting their privileged position as government employees to bring vital public services to a halt. But the government also must take responsibility for failing to anticipate this crisis, and urgently initiate meaningful dialogue to resolve it.\nGiven the objections raised by the protesters, we think it is only fair that a comprehensive review of the ordinance is conducted, incorporating inputs from the NBR reform committee's report as well as international best practices. It is also crucial that institutional reforms like this do not become a battleground for bureaucratic turf wars. Nor should they create an environment in which vested interests can resist necessary change. Given that Bangladesh has one of the lowest tax-GDP ratios in the world, it is extremely important that the long-overdue reform of its tax administration goes on uninterrupted.\n",
        "headline_1": "Resolve the NBR reform crisis without delay",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/resolve-the-nbr-reform-crisis-without-delay-3900976",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "We are concerned about the rising incidents of bird strikes at Dhaka's Hazrat Shahjalal International Airport (HSIA) that have often resulted in flight cancellations, aircraft damage, and even crash landings. On May 20, a Turkish Airlines flight was forced to make an emergency landing after a bird strike ignited its second engine shortly after takeoff. Thankfully, all 11 crew members and 280 passengers aboard the Istanbul-bound flight remained unharmed. Reportedly, the dense bushes in the airport area are good habitats for grasshoppers and butterflies, which attract different types of birds. The presence of waste collection centres and landfills near the airport also attracts birds, particularly black kites, posing significant risks to flight safety.\nUnfortunately, while flight safety officials from various airlines have called on the authorities to take proper action to address the threat, the latter have been unable to do so effectively. Bird strikes are a common phenomenon at airports around the world, but HSIA seems particularly prone to it. In 2023, a Biman Bangladesh Airlines flight on the Dhaka-Bangkok route had to abandon takeoff after a bird strike caused one of its tyres to burst. The same year, a Fly Dubai flight aborted takeoff after a bird strike on its left engine damaged three propeller blades.\n\nSuch incidents continue to happen. According to a research paper presented at a recent workshop, 10 major bird strike incidents occurred at HSIA between May 2023 and May 2024. International Air Transport Association data shows that from January 2023 to October 2024, HSIA recorded 1.73 bird strikes per 1,000 flights, compared to just 0.5 at other international airports.\nSuch incidents continue to happen. According to a research paper presented at a recent workshop, 10 major bird strike incidents occurred at HSIA between May 2023 and May 2024. International Air Transport Association data shows that from January 2023 to October 2024, HSIA recorded 1.73 bird strikes per 1,000 flights, compared to just 0.5 at other international airports. The situation is clearly concerning, and must be addressed before a major accident occurs.\nWe urge the authorities to take all necessary measures to deter birds in and around the airport. Airports across the globe use both modern and conventional technologies to drive birds away from key aviation installations. Our airport authorities must learn from their experiences. Reportedly, HSIA has two bird shooters and some equipment—machines that emit certain frequencies to deter birds, as well as gas cannons—which should be properly utilised. Most importantly, the hundreds of open garbage spots surrounding the airport must be removed. Airport authorities must coordinate with relevant agencies to encourage birds to seek alternative nesting and feeding grounds to ensure flight safety.\n",
        "headline_1": "CAAB must prevent bird strikes to ensure flight safety",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/caab-must-prevent-bird-strikes-ensure-flight-safety-3900631",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "The UN's warning on the state of Gaza on Tuesday—that two million people face starvation and 14,000 babies face death within 48 hours if aid doesn't reach them on time—paints a picture that is not just dire; it is the epitome of distress. These people are being subjected to a war they had no part in making. World leadership has failed to put a stop to this blatant disregard for human lives in a largely one-sided war that has violated all international conventions on armed conflict and human rights. The current situation should have a sobering effect on world leaders, and from recent reports, it seems it has, at least on the surface. However, whether they can capitalise on that and come together to restrain Israel from causing further damage remains to be seen.\nAccording to reports, Israel on Monday allowed humanitarian aid to enter the Gaza Strip, which it had blocked for more than two and a half months, letting five aid-carrying trucks through. But this happened not because Israeli leadership decided to uphold human rights; its prime minister explained to supporters that preventing a famine in Gaza was necessary for \"diplomatic reasons\" as \"images of mass starvation\" could delegitimise their war efforts. Just a few days ago, however, he launched a fresh military offensive in Gaza—a move Israel's war cabinet approved earlier this month, aimed at \"taking control\" of the entire strip.\n\nCountries and people worldwide have been criticising Israel's genocidal actions in Gaza since the beginning of its military offensive in retaliation to the Hamas attack on October 7, 2023. That has made no difference whatsoever, as their concern has never translated into effective action to stop Israel from indiscriminately killing innocent civilians. Israel continues to do as it pleases, having killed more than 53,000 people in over 20 months now.\nThe lack of empathy in Israel's leadership for the starving residents of Gaza boggles the mind. Its actions, including blocking aids, have drawn widespread condemnation, including from some of its allies. On Monday, the UK, France, and Canada warned of \"concrete actions\" against the country if it continued its operations in Gaza. But this is nothing new. Countries and people worldwide have been criticising Israel's genocidal actions in Gaza since the beginning of its military offensive in retaliation to the Hamas attack on October 7, 2023. That has made no difference whatsoever, as their concern has never translated into effective action to stop Israel from indiscriminately killing innocent civilians. The ceasefire deal finalised in January this year fell through in less than two months. Israel continues to do as it pleases, having killed more than 53,000 people in over 20 months now.\nEvidently, mere warnings will no longer cut it. The time has come for Israel's friends to force its hand through stern measures. If that means imposing targeted sanctions to make it follow international laws and allow humanitarian efforts in Gaza—without any conditions—then so be it. There is absolutely no time to waste when people, including babies, are starving to death.\n",
        "headline_1": "Don’t let babies become war casualties ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dont-let-babies-become-war-casualties-3900121",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "A recent roundtable discussion on the public procurement process in Bangladesh has again brought to light issues that have long been raised but sadly remain unresolved. The event, attended by local industrialists, procurement experts, and government officials, highlighted how the existing procurement framework sidelines local manufacturers in favour of foreign experts and companies, limiting their ability to compete for government contracts. Some participants called the procurement rules \"discriminatory,\" as they allegedly lock out well-established local companies from a government spending pool worth $30 billion.\n\nThey also pointed out that the existing rules neither ensure full transparency nor guarantee fair competition. There were instances where domestic bidders were reportedly rejected for invalid reasons. This lack of competitiveness has been an issue for long, with a recent Transparency International Bangladesh (TIB) study revealing that over the last 12 years, more than 62 percent of tenders went to just five percent of contractors. The introduction of the electronic government procurement (e-GP) system—which was intended to address such irregularities and promote fair bidding—has failed to make a difference. In 2023, TIB found that public contracts worth Tk 60,069 crore were awarded based on single bids through the e-GP system. How is that possible if the system isn't being manipulated? The role of Bangladesh Competition Commission in addressing such malpractice has been questionable, to say the least.\n\nOver the years, Bangladesh's manufacturing base has grown significantly in several sectors. We now have multibillion-dollar industries that have successfully expanded operations in multiple countries. This should give them ample expertise to participate in domestic projects—provided the process is transparent, competitive, and merit-based. The engagement of local companies also helps boost domestic expertise and revenue. In the process, local manufacturing can receive a strong push, creating jobs, saving valuable foreign currency currently spent on hiring foreign firms, and making meaningful contributions to the national economy.\n\nUnfortunately, corruption in public projects remains a grave concern that needs urgent intervention. According to TIB, around 27 percent of government contracts involve corruption. Overinflated cost estimates regularly make headlines. For instance, in 2023, the state-run Power Grid Company of Bangladesh Ltd (PGCBL) reportedly imported 68 kg of tower bolts, nuts, and washers from India for $239,695, when the actual price should have been a mere $148! Examples like this are far too common.\n\nClearly, the public procurement system is in urgent need of an overhaul. We hope the interim government will take necessary steps to introduce long-overdue reforms to make public procurement fair, transparent, efficient, and corruption-free.\n",
        "headline_1": "Public procurement process must be fair and competitive ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/public-procurement-process-must-be-fair-and-competitive-3898771",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 23, 2025 00:00:00  \nThe collapse of law and order in the aftermath of the July uprising was not entirely unexpected. What is deeply troubling, however, is its persistent and escalating nature even after nine months. The current state of public security is, by all accounts, deteriorating at an alarming rate. What began as a reaction to systemic misrule under the former regime has spiralled into a full-blown crisis. The unresolved issues now continue to manifest through relentless protests, demonstrations, strikes and blockades that have disrupted everyday life across the country, particularly in Dhaka, which remains the epicentre of the turmoil. The capital is routinely paralysed with roads blocked for hours and traffic thrown into utter chaos. Alongside this, rising incidents of robbery and even killings have compounded the crisis. What was once civil agitation is fast turning into lawlessness, generating fear and frustration among the general public.\nLaw enforcement agencies appear overwhelmed and underprepared. Following the uprising, many police stations across the country were attacked, largely in retaliation for the previous regime's heavy-handed suppression of dissent. In the immediate aftermath, the police were largely inactive, either out of fear or lack of direction. Although they have since returned to the streets, their response lacks the vigour and coordination the situation urgently demands. The deployment of the Border Guard Bangladesh (BGB) and army personnel-the latter given magisterial powers-has done little to contain the widespread unrest. Despite their presence, the disorder is growing more entrenched by the day.\n In a bid to tackle the escalating crisis, the Chief Adviser of the interim government recently convened a high-level meeting, attended by, among others, the Chiefs of the three defence services. The meeting reportedly reviewed the nationwide law-and-order situation, with the Chief Adviser stressing the importance of restoring stability in Dhaka and beyond. However, it remains unclear whether any concrete or decisive steps were agreed upon to deal with the unfolding chaos. Public confidence continues to erode in the absence of visible action or clear communication from the top leadership.\nIt is evident that the interim government, in a conscious attempt to distance itself from the past regime's notoriety for police brutality, has adopted an overly cautious stance. While this tolerance may stem from a desire to uphold democratic norms and avoid repeating past mistakes, it has inadvertently emboldened disorder and created a perception of weakness. This reluctance to act decisively is proving costly, as the unrest continues to permeate nearly every aspect of daily life, inflicting both economic and psychological stresses on citizens. Left unchecked, this drift into disorder could lead to long-term consequences for governance, investor confidence, and the democratic process itself. The situation calls for a strong, lawful and coordinated response-one that upholds civil liberties but also draws clear lines against anarchy. This descent into chaos must be halted-urgently and resolutely. The government must move beyond mere appeals and rhetoric. A firm but just approach is now essential to restore public order, reassure citizens, and safeguard national stability.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Persistent crisis of  law and order",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/persistent-crisis-of-law-and-order-1747928889",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       May 23, 2025 00:00:00  \n\nThe Bangladesh Bank (BB) carried out a study on five kinds of essential agricultural produce in 14 districts of the country in January this year to know about the reason behind the atrocious price gaps between farm and consumer levels. Even without any study, the reasons are common knowledge. But the BB study has only confirmed what common people know from experience. The demand-supply theory is not applicable for Bangladesh because the process is deliberately distorted by means fair and foul in order to maximise coterie interests.\nUsually commodity market ought to be dictated by production and supply. If there is a glut of any produce particularly a perishable one, its price is sure to fall because of supply superseding demand. But not all countries pride themselves on producing all the essential commodities---or if they do, not in sufficient quantities--- their peoples need. Yet an importing country can maintain steady supply of imported goods if it has authentic data at hand and make arrangement for procuring those essentials well in time. In a market economy, a government has to be smart enough to keep a tab on domestic production, storage, transportation and timely release from warehouses. \nOn all such counts, successive governments in Bangladesh have given a poor account of themselves. The interim government is no exception to this. Although it took over at a crucial time following a violent political changeover and had to be busy with more pressing issues, it got the signal of what were to be expected of businesses. Business syndicates have been reigning supreme for long in this country. Additionally, immediately after the interim administration was installed, the country faced severe floods in its north-eastern and south-eastern zones, which caused devastation not only to homesteads, livestock, and other moveable and immoveable property but also to the standing Aman crop. \nThe government took a long time to reduce import duty and issue licences for import of rice when it was cheaper in the international market. Rice importers also adopted a go-slow policy to import rice. The upshot of all these is that rice price went up abnormally by that time. Similar things happened before with potato, onion and other essentials. But what is particularly concerning is that produce the country at times grows more than it requires can be used or better say abused by actors other than farmers to serve their unholy interests at the cost of both growers and consumers.\nThis is exactly where Bangladesh has earned infamy by allowing the social parasites to proliferate and eat the cream. Working in cohorts with business syndicates--- the main players to distort supply chain and manipulate the market, they form a nexus of unholy business regime impenetrable by even the most honest entrepreneurs and businesspeople. The BB's study confirms this beyond doubt. Of the five commodities on which it carried out the study, rice, potato and onion have more or less the same stories. Consumers are compelled to pay twice the price or more than the production cost for the staple rice. The irony is that growers seldom enjoy the opportunity of the soaring prices of these three crops. All three important essentials registered atrocious prices last year and this year farmers are credited with reaping good harvests of those with the weather favouring cultivation. \nThere has, however, no change in the controlling mechanism the middlemen and wholesalers use. While paddy farmers are not facing losses because this crop is not as perishable as onion and potato, the growers of these two crops are incurring losses because of more yields this year. Consumers are also not the beneficiary of the lower prices at the growers' level. Potato farmers dispose it at Tk 12-18 a kilogram but it is priced at Tk25 in Dhaka. Onion fetching Tk 20-25 a kilo at farm level had a retail price of Tk 45-50 a few weeks earlier but it has already registered a hike by Tk 10-15 by this time. This means business intrigue has already come into play. \nThe BB has made a casual suggestion for stabilising potato market without going deep into the problem. It suggests for step by step release of potato from cold storages. This will be of no use because the cold storages are in the private sector which is not bound to oblige any such instruction. There has to be a comprehensive view of the entire system of production, storage, transportation and marketing. \nAuthentic data of national needs for rice, potato and onion have to be prepared and the agriculture ministry will plan for required lands to be brought under cultivation of each crop through the agriculture extension department. There is no alternative to eliminating the middlemen and other social parasites engaged in extortion. To make this happen, the government needs to build a chain of cold storages in order not only to prevent waste of potato and onion but also other kinds of perishable produce. Thus it can intervene when there is a crisis in the market. \nSimilarly, the government can develop a pool of trucks preferably under the management of the Bangladesh Road Transport Corporation (BRTC) to press into service for direct transportation of not only the essential commodities but also other perishable crops from growing areas to different urban destinations. The trucks can even be handed over to farmers by forming their cooperatives which will pay instalments over a reasonable period of time to own those vehicles after clearing the total price. This is how the outrageous price gap and profit made by business syndicates through manipulation of market can effectively be addressed\nThe other two items under BB scrutiny, egg and broiler chicken have a different problem mainly linked to feed and hatching costs. Production cost has to be lowered by study and research in this area. Until this happens, duties on import of raw materials ought to be waived.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing price gaps can arrest inflation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-price-gaps-can-arrest-inflation-1747929040",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Raman   |  \n       May 23, 2025 00:00:00  \n\nViolation of traffic law by motor vehicles has been a common phenomenon in Dhaka and other busy cities of the country. Vehicles are often driven against the designated flow of traffic or on roads they are not supposed to ply. Such violations were once an occasional act of impatience or ignorance, but now they have alarmingly turned into a routine practice for many. Public transports like buses, taxis, auto-rickshaws, and unauthorised electric tricycles are not the only culprits, private vehicles run by influential people like political leaders, government officials, and even members of law enforcement agencies flout traffic law, clogging intersections, aggravating traffic congestion, and exposing the fragile foundation of our traffic enforcement system. During any drive against traffic law violation, the authorities invariably discover cases of law infringement by senior officials or their drivers. It seems we, as a nation, have given traffic law violations an institutional shape. If it is not so, how can the police who are duty-bound to enforce law, drive vehicles without any registration. The way unregistered police vehicles - cars and motorcycles -- ply in the city will make anyone draw a conclusion that the police do not consider it any violation of law or consider them above law. Police personnel use the vehicles for official purposes and to serve people, not for personal purposes, but the fact remains that the relevant law does not permit such use. The Road Transport Act 2018, the main legislation regarding the road transport system and traffic management, has not given the police any exemption from the provision of the law concerning registration of vehicles. Section 16 of the Act stipulates that \"no person or owner of a motor vehicle shall drive or give permission to drive a motor vehicle on roads, highways or public places without a registration certificate.\" Section 72 of the same law provides for the punishment of the offence. It says, \"If any person violates the provisions of section 16, the violation shall be an offence, and for that, he shall be punished with imprisonment for a term which may extend to 6 (six) months, or with fine which may extend to 50 (fifty) thousand taka, or with both.\"\nBangladesh's record on adherence to rule of law is far from satisfactory. It is among the worst performing countries of the world in the field. The country ranks 127th among the 142 countries surveyed by the Global Justice Project, an international civil society organisation, in the rule of law index with 0.39 score on a scale of 1. Traffic law is no exception to the overall rule of law enforcement. Still members of the public sometimes face penalties for violation of traffic law, but it is rare for anyone in the government, particularly in law enforcement agencies, to face penalties for the offence. It is obvious that law enforcement agencies flouting traffic law will act as a disincentive for citizens to abide by the law. In today's world nobody will accept that some people are more equal than others in the eye of law.\nTo stop movement of unregistered vehicles, a combination of strong enforcement, policy measures, and public awareness is necessary. The government must introduce a strict, transparent, and accountable framework to this end. The Ministry of Home Affairs should issue a clear directive prohibiting all police personnel--- on or off duty ---from using unregistered or improperly registered vehicles. Police personnel found using unregistered or improperly documented vehicles must be subjected to the same fines, seizures, and legal action as private individuals \npay or face.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Keeping roads off limit to unregistered vehicles",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/keeping-roads-off-limit-to-unregistered-vehicles-1747929403",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 23, 2025 00:00:00  \n\nThe global trend towards remote work has had a big impact on Bangladesh's employment sector, and technology has been essential to making this change possible. \nRemote work became more popular as a result of the COVID-19 epidemic, which also forced businesses to use digital tools and platforms for smooth productivity and cooperation.\nSupporting remote work settings has been made possible by key innovations including project management software, cloud computing, and video conferencing.\nIn Bangladesh, platforms like Zoom, Google Workspace, and Microsoft Teams are becoming more and more common since they enable teams to remain connected regardless of their physical location. The demand for collaboration tools in Bangladesh's ICT sector increased by 15per cent during the pandemic, according to a BASIS report.\nBangladeshi professionals are now able to interact with clients around the world via freelance platforms like Upwork and Fiverr, which has increased the adoption of remote work. With almost 650,000 freelancers generating over $100 million in foreign earnings annually, Bangladesh can boast a vibrant freelancing industry. \nBut there are still challenges. Opportunities for remote employment may be hampered by unreliable power supplies and low internet penetration in rural locations. \nThe prospects of the job market in Bangladesh could be drastically changed by remote work as technology develops further. \nThe nation should take advantage of this trend to promote economic growth and build a more diverse workforce by investing in digital infrastructure and skill development.\nAfra Anjum Prapty\nStudent\nBBA in Management Information Systems\nNorth South University\nafra.prapty@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Building a remote workforce",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/building-a-remote-workforce-1747929508",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-05-2025"
    }
]