[
    {
        "full_article": "In ensuring the screening of the film Thug Life — thespian Kamal Haasan plays the lead role — in Karnataka, the Supreme Court of India has unequivocally asserted a fundamental free speech principle that certified films cannot be stifled by protests or a recourse to “hurt sentiments”. Following Mr. Haasan’s comment in a pre-launch event, that Kannada was born from Tamil (it is factually inaccurate as both languages have been known to share a proto-Dravidian ancestor), the film has faced an extra-judicial ban in Karnataka; the Karnataka High Court had suggested that he apologise. The Supreme Court’s directions however repudiate this “moral” position taken by the High Court, bringing into focus the judiciary’s role as a guardian of due process. After the film was certified by the CBFC, there should be no fetters on its release, and, therefore, the extra-judicial ban violated the rule of law. The film certification framework, governed by the Cinematograph Act, 1952 and its rules, is designed to safeguard creativity, while maintaining a balance between constitutionally mandated free speech and reasonable restrictions. The CBFC, equipped to vet films with these legal standards, is solely tasked with doing so. Amorphous groups claiming “hurt sentiments” to intimidate a film’s release have no role in this. Giving in to such claims risks violating free speech rights and hurting the livelihoods of actors, artists, technicians and workers. The top court rightly characterised extra-judicial bans as a direct infringement on film-makers’ constitutionally guaranteed right to freedom of speech and expression.By emphatically rejecting the extra-judicial ban, the Court has reiterated its positions that maintaining law and order in the face of divergent views is the state’s responsibility. It is vital to understand that certified and regulated freedom of speech, as assessed by the CBFC, is distinct from hate speech, which finds no constitutional protection and can be legally restricted. This crucial distinction underscores that legitimate artistic expression, once cleared by the designated authority, deserves state protection. Moving forward, the Court’s directions should pave the way for the state to provide institutional safeguards against unofficial bans overriding the CBFC’s certification and release. These could include holding theatre owners accountable for unwarranted cancellations of scheduled releases, policing guidelines that distinguish lawful dissent from illegal intimidation and also allowing for citizens to watch a certified film without fear.\r Published - June 21, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        film making\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        judiciary (system of justice)",
        "headline_1": "​No fetters: On Thug Life, extra-judicial bans",
        "headline_2": "In Thug Life case, Court upholds certified films against extra-judicial bans",
        "link": "https://www.thehindu.com/opinion/editorial/no-fetters-on-thug-life-extra-judicial-bans/article69718373.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "Scientists from IIT-Delhi and the DRDO recently demonstrated a key advance in quantum cybersecurity that stands to revolutionise how the world will communicate in the future. The world’s secrets are currently stored and communicated via channels that are protected by difficult mathematical problems. Over the years, an increasing amount of computing power available to certain actors has forced these problems to become difficult and nigh-uncrackable. The imminence of quantum computing requires this paradigm to change because quantum computers can (at least on paper) solve problems currently out of reach of the most powerful conventional supercomputers. Quantum cybersecurity is one prong of this change, promising to protect communication channels irrespective of the computing power available to malicious actors. The IIT-Delhi and DRDO team successfully demonstrated a quantum key-distribution scheme through one kilometre of free space on the institute’s campus. Such a technology allows two individuals (or stations) located a kilometre apart to securely access messages they send each other. If an eavesdropper tries to intercept any message, instantaneous changes in the keys the individuals use to decrypt the messages will reveal the channel has been compromised, and in a way that the eavesdropper cannot prevent. If scaled up to include satellites, the technology could allow stations anywhere in India to exchange information through a quantum network without fear of being compromised.Herein lies the rub. Quantum communications is one of the four themes of the National Quantum Mission, approved in 2023 with an outlay of ₹6,003 crore until 2031. Many of the same problems assailing fundamental research in India have already beset research under the Mission, however. A small fraction of the outlay has been disbursed thus far even as venture capital flow into startups remains trivial. Scientists have complained that just-in-time funding, absence of single-window clearances, and documentation requirements have increased the duration of projects. There are persistent foreign hardware and software dependencies: materials required for specific use-cases, such as cryostats and sensors, need to be fabricated abroad while most quantum software stacks are currently implemented by multinational companies. Government pay does not match global offers and lack of timely access to resources has forced researchers to accept short-term contracts and rent equipment. In fact, India’s commitment, itself down from the ₹8,000 crore announced in 2020, is dwarfed by those of the U.S. and China, which are five- and 20-times higher, respectively. If the demonstration at IIT-Delhi is to scale, the government cannot simply ‘clip on’ scientific talent and technological and economic opportunity to existing infrastructure. Administrative reform is essential.\r Published - June 21, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        science (general)\n                    \n                            /                      \n                        \n                        cyber crime\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        research\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        China",
        "headline_1": "Quantum challenge: On IIT-DRDO demonstration of quantum key-distribution scheme",
        "headline_2": "Administrative reform is essential for India to make advances",
        "link": "https://www.thehindu.com/opinion/editorial/quantum-challenge-on-iit-drdo-demonstration-of-quantum-key-distribution-scheme/article69717803.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "It’s likely to be another close poll. Neither NDA nor INDIA, partly because their playbooks are similar in some ways, has a winning formula yet. Smaller parties will look to cash in\nModi’s rally in Siwan yesterday showed that the build-up to the Bihar assembly polls is well and truly underway. It’s a truism that Biharis do not merely cast their vote, but vote their caste. The state has become synonymous with what the political scientist Edward Banfield termed ‘amoral familism’.\n\nIn an agrarian society defined by the Permanent Settlement, a narrow understanding of self-interest, limited to one’s nuclear family and its extensions, undermines any notion of the common good.\nRead the full story on TOI+.\n\n",
        "headline_1": "Bihar: Kings & kingmakers",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihar-kings-kingmakers/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "…But, at a concert in LA attended by screaming teens, he also learnt something about human behaviour that super-smart economists haven’t figured out\n‘Milton Friedman never met a teenage STAY’\nI had always believed in the elegance of Milton Friedman’s world, one where rational expectations prevailed, and human beings behaved as though they had all read the same economic textbooks, I once underlined in college.\n\nThat belief remained beautifully intact until the night I found myself surrounded by 27,000 screaming teenagers in sequined hoodies at a Stray Kids concert at SoFi Stadium, Los Angeles, clutching a light stick that glowed like a malfunctioning traffic signal.\nRead the full story on TOI+.\n\n",
        "headline_1": "Generation gasp: A dad gets a K-Pop culture shock…",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/generation-gasp-a-dad-gets-a-k-pop-culture-shock/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "By Gurudev Sri Sri Ravi Shankar\nWe are often told, “Live in the present moment.” But what if the present moment is unpleasant? How does one survive it then?\nThousands of years ago, Maharishi Patanjali, one of the most prolific minds, scientist and seer in the very first chapter of the Yog Sutras, gave a profound insight – Heyam Dukham Anagatam.\nThe purpose of yog is to stop the suffering before it arrives. This one line holds the essence of what yog truly is. It is not an escape from life. It prepares and strengthens your body, mind and spirit to remain unshaken, no matter what life brings.\nMaharishi Patanjali talks about the five main causes of misery. Avidya is taking the impermanent to be permanent and the permanent to be impermanent, a fundamental misunderstanding that distorts our perception of life; Asmita is identifying the Self with the intellect.\nWhen the ego masks the Higher Self, it becomes rigid and resists change, which leads to more suffering. Then comes raag, an attachment or craving for pleasant experiences.\n\nCraving for repeated pleasure keeps the mind agitated and restless, and opposite of this tendency is dwesh, which is an aversion to people or situations. It binds the mind to what is unwanted and fills it with complaints. Abhinivesh, the fifth one, is the deep-rooted fear of losing one’s existence. Even the wisest are not free from this instinctive fear.\nThese are not miseries in themselves. But when they give rise to emotions like anger, jealousy, fear, or frustration, they become seeds of suffering. The good news is, they can be transformed. Yog reorients these energies and brings us back to balance.\nHave you noticed that when you’re joyful, something within you expands? And when you’re sad, it contracts? Yog is becoming aware of this subtle expansion and contraction in your consciousness.\nIt is the art of tuning into that space within us which remains untouched by success or failure, joy or sorrow.\nIf the present moment is difficult, just accept it, digest it fully with awareness. Often, we are overwhelmed by our emotions simply because we were never taught how to handle them in schools and colleges. So, we stay stuck in resentment or sadness for days, sometimes even months.\nYog helps us see beyond the surface. Every experience whether pleasant or painful has wisdom behind it. And when we look for that wisdom, we are no longer a victim of the event. This is the secret. Yog makes you self-reliant.\nAnger, fear and mistrust don’t just hurt individuals. They tear apart relationships and communities. Yog expands your awareness to include others. It helps you feel connected with people, rather than suspicious or insecure.\nThis doesn’t mean a yogi is gullible. It simply means that you begin to act with clarity rather than being driven by irrational fears.\nCravings and greed also arise from a sense of lack.\nA person with fewer needs becomes more capable of fulfilling bigger responsibilities. A greedy mind is always dissatisfied.\nBut a content mind has energy to care, to give, and to uplift. A yogi is not someone who withdraws from life. A yogi is someone who participates fully, with depth and commitment.\n\n",
        "headline_1": "Yog prevents misery before it arrives",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/yog-prevents-misery-before-it-arrives/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "HCs and trial courts must follow SC’s line on free speech\nThe Constitution is clear – you have the right to freedom of speech and expression, subject to reasonable restrictions. But like an Ashokan edict carved in stone, the Constitution’s letter is only as good as the spirit of the institutions tasked with upholding it. In the Thug Life case, SC has once again struck a blow for free speech. While clearing the Kamal Haasan film’s release in Karnataka, it has made it abundantly clear that one person’s “hurt sentiments” are not a reasonable ground for curbing another’s right to expression: “In India…there will never be an end to the hurt sentiment phenomenon. But for that, right to free speech cannot be jeopardised…” Three months ago, in the Imran Pratapgarhi case, SC had forcefully made the same point: “Even if a large number of persons dislike the views expressed by another, the right of the person to express the views must be respected and protected.” \nAs the chief arbiter of the land, SC could not have made itself clearer in March any more than it can now. There’s no way its word can be misunderstood or misinterpreted. Yet, Calcutta HC told a 22-year-old early this month: “Look, we have freedom of speech but that doesn’t mean you will go on to hurt others.” Then, Karnataka HC told Haasan: “You or any citizen have no right to hurt sentiments of the masses…” And lower courts’ views on free speech are generally even more stifling. This divergence of opinion within the judiciary has a chilling effect on free speech because there’s only one SC above hundreds of HCs and subordinate courts. If free speech is a pillar of democracy, and a tenet of the Constitution, it shouldn’t have to run the gauntlet with the hope of eventual salvation in the apex court. \n\n",
        "headline_1": "Last word",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/last-word/",
        "news_paper_name": "The Times of India",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "We are concerned to learn of the findings of the latest survey by Bangladesh Bureau of Statistics (BBS) that paints a troubling picture of public service delivery in the country. The survey period covered both the tail end of the now-ousted Awami League regime and the first few months of the interim government, thus requiring its findings to be read with nuance. But the fact that 31.67 percent of respondents, or nearly one in three, reported having to pay bribes for essential services is a stark reminder of how entrenched corruption remains. The massive sample size—with 84,807 respondents from 45,888 households interviewed—also makes the data a fair representation of the experience of ordinary citizens. Although by now we would have appreciated a survey exclusively focused on the interim period, what has emerged still makes a case for why we should worry.\nFor that, we just need to look at some of the details. For instance, according to the BBS data, the worst offender among public service agencies was the Bangladesh Road Transport Authority (BRTA), where 63.29 percent of citizens reported being forced to pay bribes, followed closely by law enforcement agencies (61.94 percent), the Department of Immigration and Passports (57.45 percent), and the Directorate of Registration (54.92 percent). These institutions have long been synonymous with corruption, and the latest data suggests that the situation has not improved significantly despite the change in government. Another sector with a notable incidence of corruption is education where, as noted by the planning adviser at the BBS ceremony, the bribery rate for transfers is very high.\nThese findings more or less align that of other reports on corruption in Bangladesh. We may recall a December 2024 assessment of the Transparency International Bangladesh (TIB)—based on six household surveys conducted between 2010 and 2023—that an estimated Tk 1.46 lakh crore was paid in bribes for services during the rule of Awami League. According to the most recent of those surveys, covering the period between May 2023 and April 2024, some 70.9 percent of respondents had collectively paid Tk 10,902 crore in bribes while seeking services. It is no surprise that the same institutions flagged by TIB as most corruption-prone have also been named by BBS. Clearly, things have changed little.\nThe level of access and affordability in public services may have improved of late, but the quality and timeliness of service delivery still leave much to be desired. Just over half of the BBS survey respondents have expressed satisfaction with how long services take to process. While the interim government has taken some notable steps in recent weeks, such as replacing the BRTA chairman and conducting anti-corruption raids at BRTA offices, these actions are not enough to curb corruption unless systemic reforms are undertaken to support full automation of services, elimination of middlemen, de-politicisation, and rigorous trials and punishment of corrupt officials. Corruption must be confronted not with token measures but with genuine political will and long-overdue institutional changes.\n",
        "headline_1": "Governments come and go, but bribery stays on",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/governments-come-and-go-bribery-stays-3922636",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "We are dismayed and baffled by the arrest of Mahmudul Haque, an assistant professor of journalism at Begum Rokeya University in Rangpur, who is well known for marching alongside students and the general public during the July uprising in Rangpur. He was also vocal in demanding justice for the killing of Abu Sayed, a martyr of the July uprising. Mahmudul has been accused in a murder case involving the death of Samesh Uddin, a grocery shop owner in Rangpur, along with 53 others, including ousted Prime Minister Sheikh Hasina and Awami League General Secretary Obaidul Quader. Samesh died on August 2, and a report in this paper cites residents of the area saying he died of a heart attack while fleeing from his shop after police attempted to arrest a local Jamaat leader. Samesh's son has confirmed that his father had a heart condition.\nMahmudul has become a victim of the spree of false cases against people over the July-August killings by the Sheikh Hasina regime. This paper has extensively reported on and published editorials about the dangerous trend of murder cases (related to the July uprising killings) against hundreds of people. In June this year, Md Selim, a grocer, was listed as the deceased victim in a murder case over the July uprising killings. A report in this daily found that Md Selim was alive, and that he had been declared \"dead\" as part of a conspiracy by his brothers over an inheritance issue. Thus, murder cases are being filed, and sometimes the accused are imprisoned on flimsy and false grounds.\nIn many of these cases, the accused are from the hometown (not Dhaka) of the victims, even though the killings in question occurred in Dhaka. These false cases are filed not to seek justice, but rather due to personal vendettas. In most cases, those who have filed the case, usually a relative of the murdered victim, do not even know those they have accused—with the names being supplied by others.\nWe are disappointed that, despite the law adviser's assurance that no innocent persons accused in these cases would be arrested, this has continued, with Mahmudul's arrest being one of the latest examples. This indiscriminate filing of murder cases against individuals on such tenuous grounds must stop.\nApart from the trauma experienced by the accused, this trend will also hamper the legal process of securing justice for the actual victims of the July uprising killings. The government must immediately take action to ensure that nobody can file a false murder case, and that the police personnel who register such cases are held accountable. The interim government must ensure that each of these cases is assessed to determine whether it is plausible and not filed in order to settle personal scores.\n",
        "headline_1": "Identify and reject false murder cases",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/identify-and-reject-false-murder-cases-3922281",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "The idea of opening a humanitarian channel into Myanmar's Rakhine State to deliver aid directly to the Rohingya certainly carries a moral appeal. With Bangladesh having sheltered nearly one million Rohingya refugees for over six years—most of them crammed into overcrowded camps in Cox's Bazar—it's understandable that many are looking for ways to ease this burden. Aid from the international community has started to decrease, and security concerns both inside the camps and along the border are becoming more serious. But good intentions are not always enough, especially in a region so complex and fragile. Sometimes, if you rush into something that seems noble, you might unintentionally open the door to even greater instability.\nA humanitarian channel sounds simple, but history tells us it rarely is. The world has seen many such aid channels/corridors in the past, and most of them haven't ended well. In the 1990s, when the Balkans were torn apart by war, the UN declared places like Srebrenica and Gorazde as \"safe areas.\" Despite international presence, those areas became sites of horror—especially Srebrenica, where thousands of people were massacred. In Syria, corridors in Aleppo and Ghouta were frequently manipulated. Instead of delivering safety, they became tools of war used by both government and opposition forces to control populations and divert aid. Even in Ethiopia's Tigray region, where the UN tried to create access routes for aid, efforts were blocked or undermined by the warring parties, and the result was famine.\nThese experiences tell us that aid routes can go wrong—and they often do. They are vulnerable to being misused, especially in places where there is no clear control, where there are multiple armed actors, and where international trust is already thin. In such settings, what starts as a route for food and medicine can quickly turn into a passageway for weapons, fighters, or influence. In the end, the very people the aid is meant to help end up in even more danger.\nWhen we look at the current situation in Myanmar, it's important to understand how complicated things have become. This is not a simple case of a government suppressing a minority population. Over the last few years, new players have emerged on the ground. One of the most powerful among them is the Arakan Army (AA), an ethnic armed group that now controls large stretches of northern Rakhine, especially the areas close to the Bangladesh border. Ironically, while Bangladesh and most ASEAN countries maintain diplomatic relations with Myanmar's junta—the military regime that technically runs the country—it's the AA that holds power in the region where the aid channel would likely pass through.\nIf aid flows through an area controlled by the AA, it may end up strengthening them, even unintentionally. In any war, supply is as powerful as any weapon. If aid turns into a way to boost the logistics and reach of an armed group, then the humanitarian effort risks becoming a political or military act. These risks are compounded by the presence of an uncontrolled border zone, arms trafficking, insurgency, and extremist movements. These threats already exist, and a poorly managed channel could make them worse.\nIt's a bit like going in for major surgery. You don't go under the knife without knowing exactly what's being done and what the risks are. However, if—after assessing all pros and cons—the surgery is deemed necessary, it's better to pursue it with full prior diagnosis and evaluation. Similarly, before setting up any humanitarian channel into Rakhine, we need to slow down and ask some hard questions. Who controls the ground? Who guarantees the safety of aid workers? Who ensures that the aid isn't misused? And perhaps most importantly, who takes responsibility if something goes wrong?\nRather than rushing into a high-risk initiative, Bangladesh could propose something more comprehensive and stable. Of course, repatriation won't happen overnight, and it won't be easy. But this could be the real beginning of a serious, well-planned first step towards resolving a crisis that has dragged on for too long.\nFor something like this to work, though, all the key players would have to be involved. China, which has deep ties with Myanmar and major investments in the region—especially through the China-Myanmar Economic Corridor—needs to be part of the conversation. The US, already one of the largest donors to Rohingya aid, can lend global credibility to any comprehensive plan. It also helps that organisations such as Human Rights Watch, International Rescue Committee, and Refugee Council USA, all based in the US, can help monitor any irregularities and create transparency. Reports by such organisations have credibility in the international community. India, which shares borders and strategic interests, must also be tactically engaged. And Bangladesh, which has carried the weight of this crisis with resilience and dignity, should take the lead in shaping a solution that is humane, realistic, and diplomatically sound.\nInside Bangladesh, the decision should include political parties, international relations experts, academics, and defence and security intelligence experts. As this will have long-term implications, this critical decision shouldn't be made in the essence and narrative of an executive order. We have to keep in mind that certain neighbouring forces may always try to sabotage the initiatives as part of their own interest to create instability.\nIf establishing something more comprehensive proves too difficult, there is still the option of a multilateral humanitarian corridor—one overseen not by a single country, but jointly by the UN, the ICRC, and ASEAN. That way, the risks can be managed more carefully, and there would be international checks and balances in place to prevent misuse. The longer-term strategies should culminate in a stable Rakhine region where power struggles are settled and accepted by the multilateral community. Otherwise, it leaves a possibility for future power struggles and endangers the people residing there.\nWhatever direction is taken, one thing is clear: Bangladesh cannot afford to act impulsively. The country is in a sensitive position, surrounded by powerful neighbours with competing interests. China and India have very different approaches to Myanmar. The US currently says it views the Rohingya crisis through a human rights lens. And all three powers are watching the region closely. Bangladesh must navigate this carefully, without getting caught in anyone's camp while also avoiding potential sabotage.\nThe visit of UN Secretary-General António Guterres in July 2023 was a reminder that the world is still paying attention. But attention is not enough. What's needed now is leadership. Bangladesh has shown remarkable patience and generosity over the years. Now it must lead with clarity and confidence. A humanitarian channel might bring temporary relief, but unless it's part of a larger, more strategic plan, it could do more harm than good.\nThis isn't just about sending aid across a border. It's about shaping the future of an entire population and protecting the stability of an entire region. That requires more than good intentions. It requires wisdom, courage, and above all, inclusive leadership. We must be careful that this humanitarian action doesn't forget the human angle. Security and the betterment of the people in the region must be the first priority in this mission. Let us move not with haste, but with purpose.\n\nAshfaq Zaman is the founder of Dhaka Forum and a strategic international affairs expert.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Myanmar’s new realities demand a new Rohingya strategy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/myanmars-new-realities-demand-new-rohingya-strategy-3922136",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "We are concerned about the street children's persistent exclusion from social protection systems and mechanisms. According to a survey recently unveiled by Caritas Bangladesh, a staggering 94.3 percent of street children remain excluded from the government's social safety net, while 58.2 percent do not have birth certificates, preventing them from accessing formal education and state-sponsored services. Among those without birth certificates, 71.4 percent do not know their parents' national ID numbers, making their registration difficult or impossible. This shows, among other things, how the system itself can fail the vulnerable thanks to interlinked, often complicated procedures. It is no surprise that 51.6 percent of the children surveyed are not currently enrolled in any school or madrasa.\nThe Caritas survey size may be small—covering 667 street children across Dhaka, Mymensingh, and Rajshahi—but the picture that emerges from it more or less aligns with the alarming levels of exclusion, abuse, and exploitation reported by previous reports and surveys. So, not only are they being deprived of essential services but they are also being exposed to life-altering dangers including sexual abuse, physical assaults, exposure to crime and drugs, and hazardous labour. Even children growing up with parents in slums are often similarly vulnerable thanks to lack of support for the marginalised communities. These circumstances offer a reality check about the challenges facing the interim government as it tries to recast the social safety net schemes.\nIn the proposed FY2025-26 budget, the government allocated Tk 37,076 crore for 39 social safety programmes that directly benefit the poor and vulnerable, excluding unrelated components like pension, savings certificate interest, and agricultural subsidies that previously consumed much of the budget. Monthly cash benefits for marginalised groups have also been slightly increased, and the number of beneficiaries expanded. However, these efforts will fall short unless they are accompanied by systemic reforms to address inclusion and identification barriers. The fact that most street children lack identification, and thereby access to required support and protections, is a structural failure that must be fixed. No reform of the safety net can be meaningful if it leaves behind the most vulnerable.\nWe, therefore, urge the government to prioritise bringing those children into the fold and ensure that they are provided with necessary support. At its survey unveiling programme, Caritas Bangladesh made a number of recommendations which deserve to be considered. With so many children living in vulnerable conditions, we must do more—and do better—going forward.\n",
        "headline_1": "Social safety net must cover street children",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/social-safety-net-must-cover-street-children-3920681",
        "news_paper_name": "The Daily Star",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 22, 2025 00:00:00  \nThe Bangladesh Bureau of Statistics (BBS) has recently published its Citizen Perception Survey, which demonstrated no let-up in the pervasiveness of corruption faced by service-seekers in government offices. It's a disheartening reality that public servants, paid by the very people they're meant to serve, are instead compelling them to pay bribes for services. According to the survey, the Bangladesh Road Transport Authority (BRTA) has been identified as the most corrupt public office, with 63.29 per cent of respondents reporting that they were forced to pay bribes to receive services. BRTA handles essential tasks such as issuing driving and vehicle licenses and route permits. This rampant graft directly contributes to the alarming frequency of fatal road accidents, as the focus appears to be more on who can pay rather than who is qualified. Law enforcement agencies ranked second with 61.94 per cent of service-seekers reporting bribery and corruption, an indictment that undermines public trust and signals a serious breach of duty. This is a classic case of fox guarding the henhouse where those meant to protect incite fear and anxiety. Passport offices, which are supposed to facilitate services for expatriates whose remittances are vital to the economy, came in a close third. Furthermore, over 50 per cent of survey participants reported encountering corruption when dealing with land-registry offices, courts and land records offices.\nThe latest survey reveals that the same government offices previously notorious for corruption and bribery continue to perform poorly, demonstrating little improvement despite public outcry. Even the ousting of a fascist government in mass uprising and subsequent reform measures aimed at curbing corruption by the interim government failed to change their behaviour. Their corrupt ways persist, seemingly immune to accountability measures. Many public servants seem to believe that passing a civil service exam grants them unchecked authority over the public rather than an obligation to serve. At the survey report launch, planning adviser Dr Wahiduddin Mahmud observed that wealthier citizens today are increasingly offering bribes to receive quicker or better public services. This turns what should be fair and equal services into a system where money buys privilege. He noted that when the rich use bribes to skip ahead, they create an alternative service stream that runs parallel to the official one that makes corruption worse. In doing so, they share responsibility for perpetuating the very corruption they would later decry. \nPublic perceptions of law and order were also measured in the survey by asking how secure respondents feel in daily life. It found that 84.81?per cent of citizens feel safe walking alone in their neighbourhoods after dark, while 92.54?per cent feel safe inside their homes after sundown. In what should be a civilized society, it is shocking that nearly one in ten individuals don't feel safe in their own homes and two in ten feel vulnerable in their neighbourhoods. In principle, diligent policing should curb crime and strengthen the sense of safety both indoors and outdoors. Yet when 61.94?per cent respondents report being victims of law enforcement corruption, behaviour that is itself criminal, it is hardly surprising that genuine offenders grow more brazen. \nOverall picture painted by the survey is undeniably gloomy. Without strict surveillance and exemplary punishment for wrongdoing, corruption in government offices has apparently become institutionalised. This is the reason why reports like this must not be dismissed as routine data collection. Instead, it should serve as a wake-up call for the authorities to prosecute corrupt officials and ensure that accountability structures function without fear or favour. In the current political context, shaped by the fall of authoritarian Awami League government, achieving this should not be difficult, provided there is sufficient will.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Corruption culture lives on",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/corruption-culture-lives-on-1750516091",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       June 22, 2025 00:00:00  \nTwo decades ago, Bangladesh enacted a law mandating the registration of all births and deaths within 45 days of occurrence. The new law replaced the more than a century-old law administering birth and death registration. Under the new act, titled Birth and Death Registration Act 2004, local government bodies and Bangladesh Missions abroad are empowered as registrars. Later, in 2006, a set of rules also came into effect to simplify birth and death registration. In 2014, ten years after the enactment of the new act, the country achieved a milestone by completing 100 million birth registrations on the online birth registration information system (BRIS). The milestone reflected the country's gradual effort to improve the civil registration and vital statistics (CRVS) system. In the same year, countries in the Asia and Pacific region, under the auspices of the United Nations Economic and Social Commission for Asia and the Pacific (ESCAP), proclaimed 2015-2024 as the Asian and Pacific CRVS Decade. Through the proclamation, 53 members and nine associate members of ESCAP made a commitment to develop a universal and responsive civil registration and vital statistics system by 2024. They also agreed that the people of the region would use the system to ensure their rights and support for good governance, health, and development. As the deadline has already passed, it is time to review the progress made by the countries. Against the backdrop, ESCAP is going to organise Third Ministerial Conference on CRVS in Asia and the Pacific on June 24-26 in Bangkok. The conference will bring together governments and key partners to reflect on regional progress on CRVS. It will also try to identify key actions and enhance commitments towards ensuring universal registration in Asia and the Pacific. To facilitate the conference, ESCAP, last week, released a report titled 'Progress Made on Civil Registration and Vital Statistics in Asia and the Pacific after a Decade of Getting Everyone in the Picture.'\n\nIt is now widely recognised across the world that no country can afford to move ahead without having a functional system of civil registration and developing vital statistics based on registration. CRVS is a system to create a comprehensive database by registering all births and deaths in a country. Under the system, birth and death certificates are issued by the relevant authorise smoothly. These certificates are crucial civil documents. The register also compiles cause-of-death information and records marriage and divorce statuses by location, age, sex, and cause. \nUnited Nations (UN) defined civil registration as the 'continuous, permanent, compulsory and universal recording of the occurrence and characteristics of vital events pertaining to the population.' World Health Organisation (WHO) terms the CRVS system 'as the most reliable source of statistics on births, migration, life expectancy, deaths and causes of death.' In other words, the system facilitates the legal identities of the population of a country and thus provides the foundation for 'accessing essential rights and services, from healthcare and education to social protection and legal services.' CR data is also vital for evidence-based policymaking, disaster preparedness and achieving the Sustainable Development Goals (SDGs), according to the ESCAP.\nESCAP report unveiled that the number of unregistered children under five has dropped by 62 per cent in Asia and the Pacific, from 135 million in 2012 to 51 million in 2024. This means 84 million more children today have a recognised name, a legal identity and a stronger foundation for the future. Nevertheless, the report pointed out that 14 million babies are still unregistered by their first birthday each year, meaning many of them may be denied their fundamental right to education and healthcare services due to a lack of official documentation. Thus, countries need to enhance their efforts by making the civil registration process easier and more efficient.\nMany countries in the region have reached-or even exceeded-their targets for improving CRVS systems by 2024, which is a matter of celebration. However, some had fallen behind and were still struggling to make the necessary advancements. Success stories from other countries will be helpful for those who are yet to meet their targets. ESCAP reports presented a few success stories as case studies in this connection. Bangladesh is one of the countries whose achievements in the last decade are highlighted in the report. According to the report: \"When considering birth registrations within one year of occurrence, 26 out of 50 members and associate members had achieved their set target by 2024. Bangladesh, the Lao People's Democratic Republic and Nepal demonstrated major improvements.\" Despite significant improvements, Bangladesh's status is still 'in progress' on two key targets: 'birth registration within a year' and 'birth registration of children under five'. The country, however, reached the target on 'issuance of birth certificates', which is fully digitalised now. The government also did not set any target on 'population whose birth has been registered'. \nAccording to the ESCAP report, Bangladesh made better advancements in death registration-related targets. The country is 'in progress' status in 'death registration within a year', and achieved the target on 'recording of causes of death' and 'issuance of death certificates'. There is, however, insufficient data on the country's progress related to the 'reduction of ill-defined causes of death code'.\nReviewing the ESCP report made it clear that most countries began to improve their CRVS systems following the 2014 proclamation. For instance, Bangladesh's efforts to produce vital statistics from civil registration data started seriously in 2016. Almost a decade later, in February this year, the Office of the Registrar General (ORG) and the Bangladesh Bureau of Statistics (BBS) signed a Memorandum of Understanding (MoU) on a formal data-sharing mechanism between the two national agencies. \"This breakthrough helps Bangladesh to move beyond the sample vital registration system and toward the production of comprehensive, gender-disaggregated and age-specific vital statistics based on civil registration data, critical for national planning and policies,\" said the ESCAP report.\nNevertheless, many drawbacks and flaws remain, and the country needs to improve the quality of data as well as upgrade the civil registration mechanism. ESCAP report pointed out that significant inequalities in birth registration were found in Bangladesh, particularly linked to education, wealth and place of residence.\nImproving the CRVS is a continuous process and also challenging for populous countries like Bangladesh. Efforts in the last two decades have shown that the country has done well so far, although there are scopes for improvement. Bad governance, coupled with mismanagement, hindered optimal advancement. The upcoming Bangkok conference presents a unique opportunity to revitalise the effort to establish a high-quality and inclusive CRVS system in Bangladesh.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Improving the civil registration and vital statistics",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/improving-the-civil-registration-and-vital-statistics-1750516464",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       June 22, 2025 00:00:00  \nMany of the fruits and vegetables grown locally are a storehouse of rich vitamins but largely wasted. Unfortunately many are not aware of it. This is largely due to a lack of awareness and insufficient publicity of their benefits among the public. As most of these local fruits are comparatively inexpensive they also hold the key to raising the nutritional intake of the low-income people. This is a well-known fact and it was once again brought to light at the recently held three-day national fruit festival. \nWith the theme \"Let's eat more local fruits, let's plant fruit trees,\" the event, organised by the Ministry of Agriculture, sought to raise public awareness about the health, environmental, and economic advantages of consuming indigenous fruits. Speaking at the fruit festival, Agriculture and Home Affairs Adviser Lt Gen (retd) Md Jahangir Alam Chowdhury aptly remarked that local fruits often surpass imported varieties in both taste and nutritional value. He urged all to make homegrown produce a staple of their diets to support local farmers as well as reduce dependence on foreign imports and conserve much-needed foreign exchange.\nBangladesh can boast of producing as many as 72 varieties of fruits and ranks among the world's top producers of mangoes, jackfruit, and guavas. Yet, the country still imports around 60 per cent of its total fruit demand, incurring an annual cost of approximately $300 million. To reduce import dependency and ensure the nutritional security of the population, there is a pressing need to popularise local fruits, as a significant portion of their total production goes to waste due to low consumer demand and inadequate preservation facilities.\nThe value given to imported fruits like apple arises from our habit of giving undue importance to anything foreign. It is the colonial rulers who brought in their own foods, fruits, and cultural practices and popularised them. Unfortunately, a lingering colonial mindset leads many to consider imported fruits superior to native ones. As a result, imported fruits dominate the market year-round. Although the arrival of mango in summer somewhat tips the balance in favour of local fruits for a certain period, most of the other indigenous fruits receive little to no attention from consumers. So, a change in mindset will go a long way. \nNutritionally the local fruits like amloki, kamranga (star fruit), bel (wood apple) and papaya, are richer than foreign fruits. Likewise, green coconut water is far healthier than sugary carbonated drinks. Unfortunately, in the present generation love of fast food and soft drink has been growing. Guests are entertained not with the traditional lemon juice but with one of those ubiquitous well-advertised and well-marketed corporate products like bottled drinks known by various brand names, which are often devoid of any health benefits, if not outright unhealthy.\nHealth experts have long warned that excessive consumption of fast food contributes to obesity, diabetes, and other lifestyle diseases. In many Western countries where such food trends originated, there is now a growing rejection of these items by catagorising them as \"junk food.\" In contrast, in Bangladesh, fast food continues to gain ground, largely unchallenged. The common people should be steered away from such unhygienic food practices through persuasion and creation of awareness, as that is the only way to do so in a society where freedom of choice and freedom of trade are guaranteed. Besides, the authorities need to encourage the production of local fruits as much as possible. Incentives should be provided in establishing fruit orchards by extending financial and policy support, and ensure adequate storage and marketing facilities. Growers should also be trained in modern marketing techniques.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Popularising local fruits",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/popularising-local-fruits-1750516503",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 22, 2025 00:00:00  \n\nThe Annual Statistics Report 2024 of the Swiss National Bank (SNB) revealed that, after two consecutive years (2022 and 2023) of sharp decline, Bangladesh-linked deposits surged dramatically in 2024-rising by nearly 23 times. It has raised fresh questions amid ongoing concerns over illicit capital flight.\nAccording to A Financial Express report, total deposits linked with Bangladeshi account holders in Swiss Banks in 2024 increased to 598 million CHF (Swiss francs) from 26.38 million CHF in 2023 and 58.38 million CHF in 2022. While the exact nature of these deposits remains undisclosed, it is widely perceived that a significant portion comprises stashed wealth illegally transferred from various countries. Notably, only CHF 8.61 million of the total deposits were channelled through fiduciaries or wealth managers. \nThis scenario has alarmed the conscious citizens of the country, as the massive outflow of wealth represents resources that rightfully belong to the common people. Although the Swiss banking system strictly maintains the confidentiality of its depositors, it is still possible-and necessary-for the interim government to take diplomatic steps through the Central Bank to recover this illicit wealth.\nMd. Refatul Hossain\nAdditional Director (retd.)\nDepartment of Agricultural Extension (DAE)\nFaridpur Region.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bring back laundered money from Swiss banks",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bring-back-laundered-money-from-swiss-banks-1750516517",
        "news_paper_name": "The Financial Express",
        "publish_date": "22-06-2025"
    }
]