[
    {
        "full_article": "​This Deepavali, firecrackers are being burst under legal sanction in Delhi. The Supreme Court, in an order this week, modified a ban it had sanctioned since 2018, allowing the use of green crackers during the festival. While the decision comes with caveats on implementation, it underscores the continuous challenge authorities face in dealing with pressures from cultural norms and economic activity while prioritising public health and environmental safety. The re-introduction of legally sanctioned, less-polluting options marks a shift in government policy after the BJP came to power and aims to accommodate traditional celebrations while acknowledging the severe environmental impact of conventional fireworks in Delhi, which is disproportionately affected by noxious winter sir. This move recognises that for many across India, the use of fireworks is an integral cultural expression of joy during the festival of lights. Furthermore, the firecracker industry supports the livelihoods of lakhs of people, making economic considerations part of the regulatory landscape.​However, as the history of Delhi’s air pollution shows, the battle for clean air is a complex interplay of meteorology, economic structure, population, and geography. Multiple expert bodies and task forces have deployed science and widespread measurement—at a scale few cities in the world have attempted—to conclude that air quality is impacted by diverse sources: transport, industry, agriculture-waste burning, biomass burning, construction, and road dust at different periods. Evidence also suggests that intervals of extended rains often have the largest effect on improving average air quality levels. While the contribution of firecrackers to the annual pollution problem may be temporary, the data confirms that the resultant spike makes an already bad air situation worse. Allowing the use of scientifically developed ‘green’ crackers—which are estimated to be about two-thirds less noxious—is an effort to tolerate a temporary surge under controlled conditions. This approach seeks to find a middle ground between honouring tradition and minimising harm. But while green crackers represent an improvement over conventional ones, they are not zero-emission products. In legalising this less-effulgent option, governments and courts must be careful not to take the focus away from the need for public commitment to stricter environmental norms rooted in science and reason, and not in hope and faith. There is no alternative to comprehensive, consistent action against all sources of pollution. \r Published - October 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Deepavali\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        culture (general)\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        public health/community medicine\n                    \n                            /                      \n                        \n                        environmental issues\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        New Delhi\n                    \n                            /                      \n                        \n                        air pollution\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        science (general)",
        "headline_1": "Fire in the sky: on Deepavali and the battle for clean air",
        "headline_2": "Green crackers are a compromise between joyful festivities and public health",
        "link": "https://www.thehindu.com/opinion/editorial/fire-in-the-sky-on-deepavali-and-the-battle-for-clean-air/article70182571.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "That the Maoist insurgency is on the back foot has been evident for months now. The Maoist presence has been limited to 11 districts, with its core areas whittled down to three — the forested and remote districts of Bijapur, Narayanpur and Sukma in Chhattisgarh. The credit for weakening what was once termed India’s “greatest internal security threat” must be shared by security forces that adapted counter-insurgency tactics to the realities on the ground, and district administrations and successive governments since the mid-2000s which accelerated developmental work. The defeat of the Maoists in hitherto impoverished tribal regions of central India followed a similar retreat from united Andhra Pradesh, which saw the same strategy. This made it near impossible for the insurgents to build alternative governance structures, eventually encircling cities — a plan followed by the Chinese Communist Party a century ago to defeat the Nationalists. The Maoists aimed to form base areas in remote districts of central and north-central India, in Jharkhand, Chhattisgarh, eastern Maharashtra, western Odisha and northern Andhra Pradesh. They expected support from tribals, many nursing disaffection due to the absence of the state and its developmental arms.While areas such as Abujhmad in south Chhattisgarh, Gadchiroli in Maharashtra and parts of Odisha initially provided conditions for the Maoists to establish alternative institutions, over time, tribal unrest grew, with resentment over being used as pawns in militarist battles against the Indian state. This was partly because the Maoists privileged armed struggle over the economic uplift of tribals. The Maoists gained strength in the late 2000s when the Salwa Judum campaign resulted in massive displacement and brutal internecine battles, providing discontented recruits. However, the Supreme Court’s ban on the campaign and the professionalisation of anti-insurgency forces weakened the militant insurgency. Simultaneously, tribal people saw more benefits from a proactive state — despite persisting limitations — leading to growing disillusionment with the Maoist idea of a violent route towards an alternative state. This experience mirrors what transpired in Peru, Colombia, the Philippines and Malaysia. That this realisation has dawned upon senior Maoist leaders is evident when surrendered Politburo member Mallojula Venugopal Rao suggested that the only task left was to “abandon the dogmatic practice of the Chinese and Russian lines, regardless of the change in circumstances and time [in India]”. This opens the opportunity for the cadres to utilise spaces within Indian democracy for political engagement. Even if it has not convinced all the insurgents as yet, it will serve the people of the remaining districts and those committed to their uplift well if the Maoists abandon their struggle.\r Published - October 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        Philippines\n                    \n                            /                      \n                        \n                        Malaysia\n                    \n                            /                      \n                        \n                        Peru",
        "headline_1": "For a new path: on the surrender of key Maoist leaders",
        "headline_2": "With the surrender of key Maoist leaders, peace is now possible",
        "link": "https://www.thehindu.com/opinion/editorial/for-a-new-path-on-the-surrender-of-key-maoist-leaders/article70182993.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "Tinkering with I-T and GST rates is paying off, but won’t push GDP into higher orbit without deeper reforms\nBy all accounts, it’s been a happy Diwali for India Inc. White goods and cars have seen brisk sales since GST 2.0 kicked in on the first Navratra in late Sept. On Dhanteras, Maruti reportedly delivered 51,000 cars – roughly 35 every minute, and a record. Hyundai was expecting 20% sales growth over last year the same day. Cars sit near the top of the consumption pyramid, so if they’re selling, demand for mithai, groceries, furniture and clothes likely shot up too. We’ll know for sure when the numbers come in, but so far, GST 2.0 seems to be working.\nIt had to. By slashing tax rates on most goods, govt made space for price cuts. Industry wisely passed on the rebate, and the result was a timely boost to purchasing power. For a while at least, people will feel richer and buy more. In fact, GST cut is the second such stimulus this year. The first came in April with the reworked income tax slabs that left substantially more cash in people’s hands.\nIf everything runs to script, spirited festive spending – and sustained demand thereafter – will nudge industry to hire more hands. New jobs will create more demand, and growth will finally take off. Govt’s sacrifice of direct and indirect tax revenues will then pay off handsomely for the country. But what if it doesn’t? What if this market cheer turns out to be an expression of pent-up demand from Aug-Sept that tapers off post-Diwali? There isn’t much more that govt can do to put money in people’s hands now. RBI has already lowered rates this year, and sees no point in lowering them further at this stage.\nFrankly, the easy and obvious options have been exhausted. And while one hopes they will work, it’s important to get back to the drawing board for deeper reforms. For the second consecutive year, India looks set to grow at around 6.5%, which is better than any other large economy, but well below the 8% rate experts have prescribed for years, and far removed from the 12.2% rate that Morgan Stanley has calculated to address India’s problem of underemployment. Making exports competitive, finding new markets for them, increasing innovation, tackling unemployment, fixing infrastructure – there’s so much that needs doing to make next Diwali even brighter and happier.  \n\n",
        "headline_1": "For A Happier Diwali",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/for-a-happier-diwali/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "Being Gandhiji’s fourth monkey: Eat no evil \nI sat on the sofa, with a box of kaju katli comfortably resting on my paunch, reassuring myself that I was only helping to finish the last of the Diwali sweets. I was popping another delicious diamond-shaped delicacy into my mouth when I was interrupted rudely by my Bigg Boss. Kamala had my lab reports from our annual check-up in her hands and was visibly displeased with the numbers. \n‘Your sugars are shooting up like Diwali rockets. You’re going to have to go on a diet’ – she announced her fatwa against my pleasantly plump proportions with less niceties than some recent young contestants on KBC.  ‘The less you eat and the less you talk, the better it is for you and those around you. Just keep your mouth tightly shut.’  I sulked in a corner like the unwanted box of Soan Papdi that is left ignored in a corner of the kitchen every Diwali. Then I covered my mouth with both my hands to indicate clearly to the world that I was determined to be Gandhiji’s fourth monkey – eat no evil. \nKamala was not done with her TED talk – ‘India is often referred to as the Diabetes Capital of the World, because it accounts for 17% percent of the total number of diabetes patients in the world. There are currently close to 80mn people with diabetes in India.’ I pretended to be listening as I reached out for a syrupy sweet warm jalebi. But Kamala slapped me on the wrist and grabbed the box away from me. \nThen she continued whispering her sweet nothings. ‘The whole of India is indulging in Intermittent Feasting in the last few months of the year – one festival follows another and each has its own special sweets. Onam has its Payasam, Eid has Sevaiyan, Ganesha brings Modaks and Diwali has the whole spectrum.’ I looked hopefully at a pista roll, hoping for at least  a court approved green Diwali, but the spouse was not sugar-coating her message. She handed me a dry tasteless cracker and said that was the only snack I would be allowed till my sugars dropped consistently like the Indian rupee. \nI got up to go for a walk. As the convoluted Jalebi Bai led her Sugar Daddy purposefully around the park, Cheeni Kum Hai popped up meaningfully on my playlist. \n\n",
        "headline_1": "Cracker of a diet",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/cracker-of-a-diet/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "A woman had her face burnt by a drink set on fire in a pub, which was fined just ₹1L. That’s a problem\nA Bengaluru pub was sued in consumer court by a 28-year-old woman whose face and hair were singed when a flaming sambuca went horribly wrong and spilled out of her mouth. The consumer court has settled the 2021 case ordering the Brigade Road pub to pay damages of ₹1L. It is far from adequate not only because the woman remained homebound for three months, in pain, disfigured and suffered trauma but also because this is the second incident within just five years in the same part of town. A similar case in 2019 at a Residency Road pub was settled at ₹50k in 2021. Flaming sambuca accidents are clearly not as rare as pubs claim they are. True, any drink set on fire is anything but safe. But customers trust establishments they visit can be trusted to be upfront. As a patient in Lithuania in a similar case put it: “Why would they be allowed to serve it if it is so risky?” When enthusiastic staff in a pub encourage groups celebrating to ‘experiment’, they must then list the risks too – even if it dampens the spirit so to speak.\nBengaluru Urban II district consumer disputes redressal commission noted the pub’s negligence. But its order of ₹1L fine would barely cover the woman’s basic treatment. Indian hospital ecosystem is long familiar with burn patients given the high volume of dowry-burn cases. But costs remain high and recovery is agonising and longdrawn. For court to say ₹1L also covers mental agony and legal costs is below the standards expected of it. Further, the sum barely acts as a deterrent to pubs pan-India who must show a higher degree of responsibility when serving drinks that can prove hazardous. In overlooking the nature of the accident, did court not undermine the very system designed to protect consumers? \n\n",
        "headline_1": "Burning Question",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/burning-question/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "24 hours of costume changes and loud laughs, then preserving it all in the perfect group selfie\nIndian film endings routinely display their festive roots. All misunderstandings cleared, whole families in matching gaudy attire, and everyone rotating a sparkler clockwise. We all carry the Diwali gene. And we want a big festival, a festival we deserve, a festival that’s larger than life, king-size. A day of revelries, 24 hours of pure joy, when life is one large laddoo. Music, costume changes, loud laughs and ras malai till the eye can see. Your basic Karan Johar Diwali.\nA benevolent beaming takes over. Happiness is contagious, it’s a festival disease. Christmas, Eid, Diwali…every occasion a chance to renew or resurrect. We are that firework in the sky, a mithai in the mouth. We’ve sent our location to the goddess of wealth; Lakshmi will be here any minute. On this day women don’t flinch when they hear words like fuljhari and pathaka. The house is squeaky clean, like Lady Macbeth’s hand. Walls are painted, furniture replaced, the mop thrust into unreachable spots. You’ve auditioned for Ramleela and have been picked to be a part of the vanar sena, just like last year.\n’Tis the season of gifts – though most of us give away what we just got and do not like. A case of the left hand very much knowing what the right hand is doing. What really must be banned during Diwali sales are those useless, smirking candles that everyone receives and must now get rid of. One presents a lavender candle only to be handed a vanilla one. Perhaps the solution is to keep the one you have, thus breaking the cycle.\nWe want our life to be that picture-perfect moment of homecoming, after being out in the wilderness for far too long. Surrounded by friends and family, everyone smiling, a feeling of victory and the world lit up like there is no electricity bill to pay. And though we know life doesn’t stop there, that bad stuff can follow the group selfie we just posted, we do have this moment to preserve on Insta. As we go about life grimly, getting this degree and that job, falling for the wrong person, sandwiched between kids and parents both equally bratty, all we want in our life is one Diwali. Someone to stuff you with sweets without asking if you are diabetic, as you play cards and gamble away your ancestral home.\n\n",
        "headline_1": "Doing it like the movies",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/doing-it-like-the-movies/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 21, 2025 00:00:00  \nFirst, the fire originating from a chemical warehouse at Shialbari, Mirpur on Tuesday last gulped 16 lives in an adjacent four-storey apparel factory to which it spread. Then on Thursday a fire gutted Adams Caps and Textile Ltd housed in a seven-storey building in the Chittagong Export Processing Zone (CEPZ). Before news of the two devastating fires could be stale, yet another colossal fire broke out on Saturday in the cargo village of the Hazrat Shahjalal International Airport (HSIA) to leave particularly the import section of the storage completely ruined. Now in all three cases, regulatory lapses have been reported. The chemical warehouse was set up illegally and the apparel factory in the CEPZ had no fire security certificate nor did it comply with the building code. Similarly, the cargo village has no fire detection and protection devices that can serve as an early warning system and minimise damage.\nWhy should the irregularities in industries and factories come to light only after disasters have struck? The Alliance and the Accord, two platforms of apparel business in North America and Europe, proved that measures taken to secure fire safety for apparel factories and compliance with infrastructural regulations yield positive results. But compromise on such critical issues invites disasters as experienced in all three cases. When dealing with sensitive materials like chemicals, the regulatory rules and guidelines have to be fully complied with. After all, chemicals are combustible substances and have the potential of exploding in case of mishandling. In all three cases, violation of the regulatory rules or outright illegal practices has been responsible for the eruption of fire. While there is no provision of chemical warehouses in Mirpur Area, a report claims that many such illegal facilities exist there. Will the authorities take action against such chemical storages before another such disaster strikes? \n If the private chemical warehouse is operated illegally, what about the CEPZ apparel factory that may collapse anytime, according to a spokesperson of the Civil Defence and Fire Service there. How could the factory operate in violation of the building code and without obtaining the fire security certificate from the authorities concerned? Finally, it is unimaginable that chemicals imported by factories and industries, including the readymade garment, are stored with other valuable raw materials without a fire detection-protection system. \nAll these testify to the authorities' negligence or ignorance ---a clear evidence of symptoms of underdevelopment. They and the managements have learnt nothing from the initiatives the Alliance and the Accord took to fix the problem of RMG factories' vulnerability to collapse and fires like those of Savar's Rana Plaza and Tazreen Fashion Factory. The two apparel platforms secured buildings' structural vulnerability through retro-fitting. They also introduced fire safety measures to garment factories and before leaving briefed the owners and garment associations about how the factories they could not cover will have to retrofit and introduce fire safety measures. Failure to follow their instructions is likely to invite disaster like the CEPZ one. The factory in CEPZ turned the upper floors into godowns in violation of the safety rules and the fire started there. Thankfully, fire alarm went off and workers could evacuate in time. But in case of similar other cases, workers may not be as lucky. So, the need for regularly monitoring and checking all safety measures is of immense importance.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "From blazes to infernos",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/from-blazes-to-infernos-1760971987",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       October 21, 2025 00:00:00  \nWhen the cargo complex of Dhaka's Hazrat Shahjalal International Airport (HSIA) went up in flames last Saturday afternoon, the skies above Bangladesh's busiest gateway turned into a symbol of something far larger than a single accident. The orange glow rising over the capital was not just fire -- it was a flare of alarm over how vulnerable the country's infrastructure, safety protocols, and crisis management systems have become.\nFor six long hours, the nation's main air hub stood paralysed. Flights were diverted to Chattogram, Sylhet, and even Kolkata. International cargo worth billions of takas -- ranging from ready-made garments to electronics -- was reduced to ashes. Businessmen stood helpless, watching years of enterprises being lost to raging fire. The scenes were heartbreaking. And, finding answers to questions the fire has left behind may prove daunting.\nOfficials have described the inferno as the most devastating incident in the airport's history. The fire, which broke out around 2:15 p.m. at the cargo village, spread with terrifying speed. Thirty-seven fire service units fought the flames, joined by the Navy, Air Force, Border Guards Bangladesh, police, and Ansar. Despite this, it took hours to bring the blaze under control.\nThat it happened at the country's highest-security facility - one that handles sensitive goods and international freight - has fuelled suspicion. Bangladesh's Civil Aviation Authority (CAAB) and Biman Bangladesh Airlines, two entities responsible for ground handling, were quick to call it a probable accident, cautioning against speculation before investigations conclude. Yet for many, the timing and scale of the disaster are too difficult to ignore.\nThis was no isolated event. In the days preceding the airport fire, two major blazes had rattled the country - one at a chemical warehouse in Dhaka's Rupnagar and another at the Chittagong Export Processing Zone. Such coincidence is enough to stir public paranoia. On social media and in business circles, whispers of conspiracy are swirling: was this sabotage, or a symptom of gross negligence?\nThe truth may lie somewhere in between. Bangladesh's tragic familiarity with industrial fires - from garment factories to ferry terminals - points to a systemic malaise: lax enforcement of safety codes, obsolete equipment, and a culture of administrative complacency. Whether or not deliberate, the HSIA incident exposes the same frailties that have claimed countless lives and livelihoods in the past.\nEven if investigators ultimately rule out arson, negligence itself is no less criminal. According to eyewitnesses, firefighting vehicles were stationed within the airport premises, yet the blaze grew uncontrollably. The cargo village is supposed to have modern fire suppression systems. Were they functional? Were alarms raised promptly? Was emergency coordination swift enough between agencies?\nThese are not technicalities - they are matters of accountability. Bangladesh has long relied on its image as a rising logistics and export hub. But that image collapses the moment foreign buyers see pictures of burned warehouses and diverted aircraft.\nThe financial losses from the HSIA fire could reach billions. Exporters fear contractual penalties and shipping delays. Insurers face claims that may take months to resolve. At a time when Bangladesh's economy is already strained by dollar shortages and declining foreign reserves, this disaster strikes at the very heart of its global trade engine.\nSmall businesses, clearing and forwarding (C&F) agents, and freight operators are among the worst hit. Their association has called the fire \"pre-planned\" and demanded an independent inquiry. While such claims may stem partly from desperation, they underline a painful truth: in a country where investigations often vanish into bureaucratic limbo, trust is in short supply.\nThe government has promised multiple investigations - by CAAB, the Ministry of Civil Aviation, and intelligence agencies. Yet few Bangladeshis will take comfort in that. Past tragedies have seen committees formed with fanfare, only for reports to gather dust. The Rana Plaza collapse, the Chawkbazar chemical fires, the Sitakunda depot explosion - each yielded promises of reform that faded with time.\nWhat Bangladesh needs now is not another report but a reckoning. A credible inquiry must not only identify immediate causes but also map the institutional rot that allowed this to happen. If the fire safety system failed, who was responsible for maintaining it? If negligence is proven, prosecutions must follow - regardless of rank or political affiliation.\nOn Sunday morning, hundreds of cargo workers stood outside the charred complex, staring in disbelief. Just days earlier they had been preparing consignments for export; now they were counting their losses. \"We don't know who did this, but we've lost everything,\" one said. Their despair speaks for a wider workforce already battered by inflation and uncertainty.\nMany of those injured were not bystanders but responders - thirty-five in all, including twenty-five Ansar members. Their bravery deserves recognition, but their suffering also demands that lessons be learned. Bangladesh's emergency services, underfunded and overstretched, cannot be expected to perform miracles amid structural neglect.\nIn moments like this, secrecy breeds suspicion. The government must communicate clearly and regularly about the progress of the investigation. Satellite imagery, CCTV footage, and maintenance records should be reviewed and, where possible, made public. Only transparency can prevent rumours from festering into political cynicism.\nIndependent experts - not only government officials - should be part of the probe. International fire-safety specialists or neutral observers from aviation bodies could lend credibility. If foul play is found, the public deserves to know not just that it happened, but how and why.\nThe HSIA blaze must become a turning point. Every critical infrastructure facility - airports, ports, power stations - needs an immediate safety audit. Fire drills should be mandatory. Cargo operators must be trained and certified. Advanced fire suppression systems, modern sensors, and real-time monitoring can no longer be luxuries; they are imperatives.\nBangladesh aspires to join the league of middle-income economies, but that ambition cannot rest on fragile foundations. An economy that burns too often cannot soar.\nUltimately, this tragedy is not just about flames and smoke - it is about trust. Trust in the state's ability to protect its citizens and assets. Trust that negligence will not be brushed aside as \"an unfortunate incident.\" And trust that when the next crisis comes, the response will be faster, smarter, and honest.\nThe HSIA fire is a national wake-up call. Whether the cause proves accidental or malicious, the message is the same: Bangladesh must learn, reform, and rebuild. The ashes of the cargo village demand not silence but accountability.\nOnly a thorough, transparent, and independent inquiry - followed by real action - can restore faith in the nation's institutions and ensure that such a calamity never darkens its skies again.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Sabotage or gross negligence?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/sabotage-or-gross-negligence-1760972176",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       October 21, 2025 00:00:00  \nProbe committees by separate government bodies, namely, the Civil Aviation ministry, the Internal Resources Division of the finance ministry and Biman Bangladesh Airlines, have, reportedly, been formed to investigate Saturday (October 18)'s fire incident at the import cargo section called, the cargo village, at the Hazrat Shajhalal International Airport (HSIA) in Dhaka. Though the actual damage sustained by the import cargo complex and the materials related to the garment units stored there is yet to be assessed, it is feared that materials worth Tk.10 billion might have been destroyed. This is the third major fire in a week in the country in which, as a matter of strange coincidence, only readymade garment (RMG) factories and materials and equipment used by the apparel industry have been gutted. The first of these fires broke out at Mirpur area of the city on October 14 that started from a chemical warehouse filled with explosive chemicals. The flashover engulfed the adjacent building that housed a garment factory killing at least 16 people and wounding many. \nThe Chottogram EPZ (CEPZ) conflagration, on the other hand, erupted on Thursday (October 16) afternoon from a warehouse on the 7th floor of a 7-storey building. The warehouse reportedly contained flammable materials including chemicals, medical gowns and towels used by two companies, of which, one was a garments unit, while the other a medical company. So, in each cases of these fires, we see a storage facility of flammable substances, a garment unit or a warehouse of materials for garment factories staying side by side as if waiting for an accident to occur. Now, it is up to the probe bodies to determine if the series of fires were purely stray cases, or they had any connection whatsoever. In any case, the investigation bodies would hopefully find an answer. However, going by previous records, there are no strong reasons to believe that the root cause of the destructive fires could ever be discovered. Even so, this time, one would like to hope that a miracle might happen. So, let us keep our fingers crossed that something useful would come out of those investigations. \nMeanwhile, Commerce Adviser to the interim government, Sk Bashir Uddin, while reacting to Dhaka Custom Agents Association (DCAA)'s allegation of delayed response from the Civil Aviation Authority (CAA) and the Fire Service in the face of HSIA's devastating cargo village blaze, told reporters on Sunday (October 19) that CAA acted within seconds and that 37 units from Fire Service joined efforts to douse the fire. However, terming the destruction of the 'import goods storage' complete and that no import operation could be resumed before reconstruction of the complex, the DCAA urged the authorities concerned to open a temporary cargo storage facility so import activities through HSIA could continue. The Customs Agents' representative also suspected of a plot to cripple the economy by the HSIA fire. No doubt, DCAA's suspicion demands serious attention from the government. \nBut the commerce adviser's response to the DCAA's allegations and concerns could be different from what all political governments of the past would do under similar circumstances. On the contrary, he was rather defensive, if not in an outright denial mode. However, he assured the companies affected by the HSIA's cargo village blaze of all help from his government.\nWhatever the outcome of the probes, the government should at least take adequate measures so that any such future fire or act of sabotage in this highest foreign currency earning sector could be prevented. In case, if any such devastating incident takes place at any industry or sensitive installation despite efforts to prevent it, the Fire Service and Civil Defence, the Army, the Navy, the BGB, the Police, the Ansar should be on guard and act before it is too late. \nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Should every fire take us by surprise?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/should-every-fire-take-us-by-surprise-1760972211",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 21, 2025 00:00:00  \n\nBaul Samrat Fakir Lalon Shah, one of the greatest mystic poets of Bengal, composed his songs orally, which were later transcribed by his disciples. During his lifetime, a few of his followers, including Bholai Shah, compiled about five hundred of Lalon's songs in two notebooks. One of these notebooks, containing the original manuscripts of 314 songs, was taken to Kolkata by Rabindranath Tagore, the then zamindar of Shilaidaha, and is now preserved at Shantiniketan.\nEvery year, on the occasion of Lalon's death anniversary and memorial festival, over a hundred thousand devotees and researchers from home and abroad gather in Cheuriya, Kushtia, to honour his legacy. On behalf of all admirers, a collective appeal is made to bring back the original manuscript of Lalon's songs from Shantiniketan and preserve it at the Lalon Academy in Kushtia. Such an initiative would greatly contribute to research and safeguard an invaluable part of our cultural heritage.\nI therefore urge the authorities concerned, particularly the Ministry of Cultural Affairs, to take the necessary steps to facilitate the return of the manuscript to the Lalon Academy in Cheuriya, Kushtia, for proper preservation and display.\nMuhammad Shafayat Hussain\nDepartment of Physics\nKushtia Government College, Kushtia\nkobishafayat@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bring back Lalon's manuscript",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bring-back-lalons-manuscript-1760972250",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-10-2025"
    }
]