[
    {
        "full_article": "An accident is, by definition, both unexpected and preventable. But the numerous fireworks industry blasts that dot the summer months with stunning regularity in the firecracker manufacturing belt of Tamil Nadu in Virudhunagar challenge this definition. A total of 26 people have died and 20 others injured in eight accidents that have occurred in the first six months of 2025. According to official data, 17 accidents were reported in fireworks units in the State in 2024 and claimed the lives of 52 people. Of these, 42 people died in 12 accidents in Virudhunagar, which has roughly 1,000 fireworks units and 3,000 cracker shops. In 2023, 79 workers were killed in 27 accidents in the State, including 28 workers in 15 accidents in Virudhunagar. In the latest episode, eight persons died and five others were injured in an explosion at a fireworks factory in Sattur, near Sivakasi this week. Preliminary reports said friction caused during the process of filling chemicals that are used to make special fireworks may have caused the explosion. Investigations are on to pinpoint the exact cause. But whatever the cause, there is unlikely to be any new learning from this kind of post mortem.Temperatures in the rather dry, hot belt of Virudhunagar often soar unbearably during the day. It is also common knowledge that firecracker units store chemicals that are highly inflammable, and can ignite and burn easily when exposed to an ignition source such as a spark, flame, or high heat. And yet, unerringly, the summer months, usually, have unfortunate accidents resulting in the death or the disability of people who are already vulnerable, socially and economically. While the laxity of manufacturers is condemnable, there is also a big role for the state in regulating these fireworks units, since all of them require a licence from the Petroleum and Explosives Safety Organization to function. The Explosives Rules, 2008, which govern fireworks units, specify that packages containing explosives shall not be allowed to remain in the sun or exposed to excessive heat, and all due precautions ought to be taken to prevent accidents by fire or explosion. Following the rules is essential to retaining the licence to operate and manufacture explosives. Clearly, here is a situation where the heft of the state can be utilised to ensure compliance, but a better way of handling it is to involve manufacturers in an effort to ensure there are no further accidents, no further lives lost as a result. Such cooperation has produced results in the past in curbing the employment of child labourers in the industry. It will now have to be leveraged to save precious lives. A preventable tragedy that repeats itself makes a farce of state regulation and enforcement. Published - July 03, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        fire\n                    \n                            /                      \n                        \n                        industrial accident\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        weather\n                    \n                            /                      \n                        \n                        labour",
        "headline_1": "​Under fire: On Tamil Nadu and the fireworks industry blasts",
        "headline_2": "The state must enforce compliance of regulations in the fireworks industry",
        "link": "https://www.thehindu.com/opinion/editorial/under-fire-on-tamil-nadu-and-the-fireworks-industry-blasts/article69764483.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "The Madhya Pradesh Pollution Control Board has confirmed that officials had incinerated 337 tonnes of toxic wastemoved to a private waste treatment facility in Pithampur from the defunct Union Carbide facility in Bhopal. The event closes a single, but important, chapter in the sordid history of the 1984 Bhopal disaster, the state response to which pushed the city and its people to the edge. The successful incineration is illustrative in that it demanded interventions from the Madhya Pradesh High Court, the Supreme Court of India, and the Union Environment Ministry, among other stakeholders, over more than a decade. In the end, the State government was able to arrange for the waste to be safely disposed of — including an outreach exercise to assuage public anxiety over the emissions — within six months at a cost of ₹126 crore. Evidently the means have always existed; the political initiative to effect them has been wanting. This is an important detail: waste, once it has entered the environment, has a tendency to be converted to different forms; it seldom goes away. The toxic waste incinerated thus far has yielded more than 800 tonnes of ash and residue that officials will have to landfill in a scientific manner. Like solid waste landfills around the country, this new facility will require regular upkeep, monitoring, and funds of its own. The site of the Union Carbide plant also retains several more tonnes of contaminated soil and other hazardous artefacts, plus contaminated subsurface resources in the area.Crucially, much of the impetus for positive change in the matter, including waste removal, has come from victims’ families, survivors, and activists rather than from the state. Survivors’ groups have filed petitions arguing that deaths and injuries continue to be undercounted and that they are owed inflation-adjusted damages. Since the Supreme Court closed the door on the curative route, also in dispute is whether a new valuation of losses can be forced on The Dow Chemical Company, notwithstanding the fact that it remains a proclaimed offender. Long-term surveillance has been patchy, with activists and survivors alleging that the advisory committee appointed by the top court has met only sporadically and that local hospitals continue to suffer a shortage of specialist medical workers to attend to survivors. In the final analysis, Dow must account for all remediation activities. Both the State and the Centre must close pending settlement claims and attend on a self-motivated basis to the survivors’ well-being, if required with the assistance of a new statutory body to unify health, relief, and remediation goals. Ultimately, the families must be able to move on. Published - July 03, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Bhopal\n                    \n                            /                      \n                        \n                        industrial accident\n                    \n                            /                      \n                        \n                        pollution\n                    \n                            /                      \n                        \n                        waste management and pollution control\n                    \n                            /                      \n                        \n                        hazardous materials\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        hospital and clinic",
        "headline_1": "Away from the edge: On waste disposal from the 1984 Bhopal plant accident",
        "headline_2": "The incineration of toxic waste from the Bhopal tragedy took time and effort",
        "link": "https://www.thehindu.com/opinion/editorial/away-from-the-edge-on-waste-disposal-from-the-1984-bhopal-plant-accident/article69764501.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "Why one word inserted by Mrs G in Constitution’s Preamble should be kept, the other dropped \nRSS and the vice president are among those who have recently batted for deleting ‘socialist’ and ‘secular’ from the Preamble of the Constitution. Their arguments echo those made earlier – that Indira Gandhi inserted these adjectives during Emergency in 1976, and that such descriptors were not considered necessary by the constituent assembly. The Supreme Court has maintained both terms have distinct Indian contexts; that they capture the spirit of the Constitution, are part of basic structure doctrine, and cannot be equated with Western ideological positions. \nLet’s consider ‘secular’. As SC correctly observed many times, secularism is integral and intertwined in all aspects of the Constitution. From right to equality and fraternity, all fundamental rights clearly indicate that secularism is a core feature. In the Indian context, secularism, envisioned as equality of all religions, castes and creeds, is evident in Articles 15 (equality) and 25 (freedom of religion). \n‘Socialist’ is a different kettle of fish. SC has held that the idea of socialism can be upheld as part of basic structure since it also stands for equality of opportunity and fair distribution of the nation’s wealth; that such philosophy is reflected in various articles of the Constitution. But that’s stretching the definition of socialism. It conflates socialism, which is to do with ownership of means of production, with social justice, which is about everyone getting a fair shot at life. The Constitution certainly has social justice as part of its basic structure doctrine. But not socialism. In fact, a robust capitalist system with good welfare provisions is the best guarantee for social justice. Social justice is best served by a rights-based approach that’s worked into an economic policy that encourages free enterprise. India’s problem right now is that since structural reforms aren’t happening, economic opportunities are not expanding, making welfare spends bigger. Socialism is irrelevant here. The other point is that secularism is key to social justice. Given caste hierarchy and religious diversity, a secular state is a must for delivering social justice. \nSo, drop ‘socialist’, keep ‘secular’.\n\n",
        "headline_1": "Secular, not socialist",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/secular-not-socialist/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "India has the most dangerous factories. Undercounting accidents does nothing to improve safety\nThe toll of Monday’s industrial accident in Hyderabad has risen to 40 dead and 33 injured. Painful as it is, the fact that this unit of Sigachi Industries – feted as a “multibagger” until recently – was running without basic safety systems like fire alarms and heat sensors raises questions about the value assigned to workers’ lives. While the management didn’t commission a safety audit, the state’s guilty of dereliction of duty because it allowed the factory to operate without a fire department NOC. \nCountless Sigachis have occurred in India over the years. Bhopal remains the world’s worst industrial disaster, but blasts, fires, gas leaks, electrocutions occur with sickening frequency. Per govt data, there were 5,336 deaths in factories in the five years from 2018 to 2022. But these numbers don’t tell the full story. They have been sourced from the formal sector, which accounts for a very large part of India’s industrial output, but not its factory employment. Fact is, almost 90% of India’s industrial labour works in the informal sector, where wages, productivity and working conditions are abysmal, and safety not even an afterthought. \nILO data shows India is the most dangerous country for factory workers, with 117 deaths in workplace accidents for every 1L workers. The number is 3.7 for America. In Europe, Germany, Denmark and Switzerland report only 1.3-1.4 deaths per 1L workers. Oddly, these countries report far more non-fatal occupational injuries per 1L workers – Denmark (3,581), Germany (1,496), Switzerland (2,293), as against 325 in India. Is it possible that Switzerland’s factories are more hazardous than India’s?\nIt’s clear that India is massively undercounting industrial accidents. A study based on industrial accident data from Dadra and Nagar Haveli in 2017 found that police recorded only 30% of deaths, and health facilities 70%, although every accident death should result in an FIR. India’s factory workers won’t be safe until accountability is fixed every time. For that, we’ll have to stop brushing these accidents under the carpet.\n\n",
        "headline_1": "Deadly work",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/deadly-work/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "Ticket to ride on the London Metro\nIf Underground movements are your cuppa tea – or Matcha Latte – hop aboard. ‘Mind the Gap between the train and the platform. This is the Jubilee Line to Stratford.’ The canned announcer keeps up her reminder on every route and imminent stop.\nTry not to stare. The London Underground gives you a seatside view of  Britain’s multicultural reality. Plus  summer tourist tsunami. In addition to surroundscape of  the world’s ethnicities, skin shades, body shapes, hair types, you get a Babel-grade surroundsound. TS Eliot updated to: ‘In the compartment, women come and go, talking a polyglot lingo.’ And, like across Britain, you are never ‘far from the madding crowd’ of Hardy local accents. As un-understandable.\n‘This is the Bakerloo Line to Elephant and Castle.’ Try not to stare. Aided and abetted by current heatwave, less is more than an eyeful. Forget your Eng Lit (Hons) Keats, Shelley and whatever their words were worth. Barely-there shorts and tops have long been the ‘cuckoo call of Spring’. Have a lark discreetly observing buttered skin on toasted legs. Or, more kosher-ly, marvel at the  sartorial variety. Techie casual, banker formal, tourist classic to unclassifiable. Eliot again, ‘Mornings, evenings, afternoons, I have measured out my train life in much more than Tee-spoons.\nDon’t stare. Read your phone or free copy of ‘Metro’. Or compartment ads for youthful cheeks and mature cheese. Or a pithy gem from Poems on the Underground. Or Transport For London’s omnipresent safety signs, ‘See It, Say It, Sorted’ for suspicious movement, and  the ‘61016’ text to report sexual harassment. Or simply the caution to ‘Carry water in hot weather.’\n ‘This is the Circle Line via Tower Hill. The next stop is Sloane Square’. But no ’90s Sloaney sashays aboard. Only tired Mum struggling with perambulator. Or tired tourist struggling with suitcase coz next stop is rail junction Victoria. Never seen is tired cliché of bowler-hatted toff with tightly furled brolly and copy of FT. Though, in this Ascot season, plenty of women in fancy frocks and fancier hats/ ascinators teetering on ‘the District Line to Richmond’ en route to National Rail. \nMostly it’s Eastbound, Westbound. ‘Change here for the Whatever Line to Royal Albert Hall/ Museums/ Monument/Heathrow. The Underground is a spoked hub. Not ‘Way Out’, but way towards. As in ‘Xanadu’ (Coleridge poem not Newton-John song), we move ‘Through caverns measureless to man,/ Down to’  Platform 1/2/3/4. And await the resounding roar which will finally take us to the ‘pleasure dome that Kubla Khan aka Lonely Planet did decree’. Or to an enticing business-op. Or, best of all,  a catch-up with old friends.\n                                         ***\nAlec Smart said: “In political football, it’s ‘Bend it Like Hindi’.”\n\n",
        "headline_1": "YourTube, MyTube",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/yourtube-mytube/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "It’s incredible that to date he has had so little impact in America. Markets are strong, growth hasn’t slowed, and treasury’s recording revenue from tariffs but tariffs aren’t impacting prices\nIt’s suddenly fashionable to talk about how the era of ‘American exceptionalism’ is ending, given Trump’s policies, the dollar’s decline, and the fact that so far this year US stock market is underperforming its international rivals by the widest margin since 1987.\n\nThe surprise however is that despite the shocks emanating from Washington and West Asia, US stocks are still grinding higher.\nRead the full story on TOI+.\n\n",
        "headline_1": "The real Trump shocker",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-real-trump-shocker/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 03, 2025 00:00:00  \nThe country's agriculture has come a long way off, thanks to some remarkable research and experiments with cereals and other crops. But still farm practices in general are yet to be smart enough to turn farmlands economically sustainable. A survey titled \"Productive and Sustainable Agriculture Survey 2025\" carried out by the Bangladesh Bureau of Statistics (BBS) corroborates this lapse in farming. The study finds that only 1.2 per cent of agricultural land in the country yields the optimal level of output, 44.37 per cent has acceptable or adequate level of productivity and the major portion of land comprising 55.63 per cent has production far below the sustainable level. Still more worrying is the fact that the problem of land degradation occurring at the rate of 50 per cent is encountered by as high as 27.25 per cent agricultural households. The prospect is not only bleak for those families because of this high rate of land degradation, it also unfolds a spectre of fast shrinkage of agricultural land and its attendant ills of displacement of a large number of people and their food insecurity.\nAdmittedly, the country is not under an immediate threat of falling short of the required land areas for production of enough foods to feed its people. Both the 44.37 per cent and the 55.63 per cent of lands now yielding acceptable and below par level of crops respectively can be improved to a large extent for augmenting production. Even with the existing research results and technological innovation achieved by agricultural scientists of the Bangladesh Rice Research Institute (BRRI) and the Bangladesh Agricultural University (BAU) along with other such universities and institutes can bring about a change for the better. There has been a kind of inertia on the part of policy formulators in implementing the laboratory knowledge and findings at the field level. However, a new breed of educated young people has come forward to adopt the latest models of agriculture. Although they are a few in number, these new generation of farmers is changing the agricultural map of the country. \nHow they are doing it? It is quite simple. Bio-diversity-supported agricultural practices they have opted for simply to provide the boost agriculture here needs. Apps-driven irrigation, fertiliser and pesticide use--- with drone replacing manual practice and monitoring crops' health--- have already brought about a paradigm shift in the country's agriculture. The knowledge and technology are there but reaching those to farmers at the field level is what proves highly challenging. But such smart ways of farming economise on irrigation and inputs such as improved seeds including salinity and heat-tolerant varieties, fertiliser and pesticides by determining their correct amounts. \nSo, to take agriculture to the next level, the latest innovative practices of farming has to be made familiar to even unlettered farmers. Sure enough, there is a need for big investment if a farmer wants to adopt the latest agricultural practices. It is exactly at this point the policymakers have to think out of the box. How to bring small agricultural plot holders under the coverage of smart practice? If farmers' cooperatives are formed and the government provides the machines, tools and devices for payment of prices in instalments, the initiatives will certainly take off. Alongside this, there is a need for directing research focus on stalling extensive land degradation.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Introducing innovative farming practices",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/introducing-innovative-farming-practices-1751470412",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       July 03, 2025 00:00:00  \n\nAt a recent seminar hosted by the Dhaka Chamber of Commerce and Industry (DCCI), experts and business leaders highlighted how Bangladesh's outdated logistics system is undermining the country's global competitiveness, hampering export growth and overall economic momentum. As the country prepares to graduate from the United Nations' Least Developed Country (LDC) category, addressing these logistical shortcomings must be a top priority. Upon LDC graduation, Bangladesh will lose numerous preferential trade assistance and benefits under International Support Measures (ISM) for LDCs. These include crucial advantages like duty-free quota-free (DFQF) market access (like the EU's Everything But Arms scheme), relaxed rules of origin, and flexibilities under the TRIPS Agreement for intellectual property, especially for pharmaceuticals. At the same time, the country will see gradual withdrawal of \"Special and Differential Treatment\" (S&DT) provisions from various World Trade Organization (WTO) agreements, while new trade-related obligations will be imposed. These changes will drive up the cost of trade and investment. For example, one study projects that LDC graduation will result in an 8-12 per cent increase in duties on Bangladesh's exports to EU countries, directly raising overall export costs. In this context, the importance of strengthening the country's outdated logistics sector cannot be overemphasised to offset these anticipated increases in international trade costs and safeguard the nation's global trade competitiveness.\nAn efficient logistics system that reduces lead time and cost is what keeps the wheels of the commerce turning. From the delivery of raw materials to manufacturers to the final product reaching consumers, both domestically and globally, logistics plays a crucial role in ensuring that goods and services are delivered without a hitch, and in a cost-effective and timely manner. The global logistics market is valued at $10 trillion and it is inextricably linked to every economic activity. The sector is particularly vital for export-oriented countries like Bangladesh. Regrettably, the country is among the countries where logistics costs are among the highest. It was revealed at the DCCI seminar that logistics costs in Bangladesh is roughly 15 to 20 per cent of GDP, far above the global average of 8 to 10 per cent. This aligns with an earlier World Bank Group report titled 'Moving Forward: Connectivity and Logistics to Sustain Bangladesh's Success,' which showed sector-wise logistics service expenses in the country ranges from 4.5 per cent to a staggering 48 per cent of sales, which is far higher than that of other competing countries. \nBangladesh's stark inefficiency in logistics is also reflected in global rankings. Bangladesh currently ranks 88th out of 139 countries in the World Bank's Logistics Performance Index (LPI), trailing significantly behind regional competitors like India (38th) and Vietnam (43rd). Its performance is even more concerning in the \"trading across borders\" category, where it is ranked 176th out of 190 countries. The World Bank report projected that mitigating Bangladesh's excessive logistics cost via targeted short-term and mid-term reform measures could increase its export earnings by as much as 20 per cent. Even a modest 1 per cent reduction in transport costs or dwell time alone could raise exports by over 7 per cent.\nBangladesh's poor ranking at LPI stems primarily from weaknesses in its trade and transport infrastructure, including congested ports and poor road networks, which collectively lead to high logistics costs. Further hindering its performance are significant inefficiencies in customs and border management, insufficient adoption of digital tracking and tracing systems, and procrastination of shipments. These factors, alongside fragmented governance and an over-reliance on road transport, collectively undermine the country's logistical efficiency and global competitiveness. \nTo address this shortcomings, experts at the DCCI seminar called for modernising Chattogram and Mongla ports since about 92 per cent of the country's export takes place though the ports. They have also proposed some key reforms such as digital platforms to connect shippers and transporters, warehouse automation, digital customs solutions, and greener logistical practices to improve the overall performance of the sector. Moreover, the construction of a dedicated expressway exclusively for trucks and lorries from Chattogram port to Sitakunda was suggested as a potential game-changer for streamlining the transport of import and export goods.\nAn efficient logistics system, however, goes beyond just building better roads and transport system; it requires an integrated multimodal logistics network that seamlessly combines road, rail, and waterways. In Bangladesh, 77 per cent of goods are transported by road, 16 per cent by waterways, 6 per cent by railways, and 1 per cent by other means. Such an overreliance on roads is a major drawback. If a significant portion of goods loaded or unloaded at ports could be transported via launches or barges, rather than being almost entirely loaded onto trucks, it could reduce both transportation costs and logistical complexities, easing pressure on the road network while enhancing overall efficiency.\nThe National Logistics Policy, introduced in 2024, aims to significantly reduce this dependency on roadways to 60 percent by 2041, while increasing the share of goods transported via river routes and railways to 25 percent and 14 percent, respectively. But the policy remains unimplemented. \nBangladesh is crisscrossed by hundreds of rivers that could be used to transport goods in a cheap and environmentally friendly way. But this natural resource remains underutilised. Historically, rivers have been intertwined with the country's culture, trade and development. Almost all the major cities and industrial hubs have grown around the country's vast network of rivers and natural water resources. However, over time, this landscape has changed dramatically. The number of active rivers has dwindled, many have lost their vitality, and waterways - once the arteries of the nation's transport system - have gradually been replaced by roads as the dominant mode of transporting people and goods. This overreliance on road transport has come at a significant cost, reflected in growing traffic congestion, escalating road construction and maintenance expenses, and increasing environmental pollution. It is, therefore, time to prioritise the development and operation of inland waterways and railways as key components of a balanced and efficient multimodal logistics network.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Imperative of revitalising logistics sector",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/imperative-of-revitalising-logistics-sector-1751470483",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 03, 2025 00:00:00  \n\nIn today's competitive world, academic knowledge alone is no longer enough. The job market now demands far more than high CGPAs or classroom performance. Employers seek individuals with communication skills, teamwork experience, problem-solving abilities, leadership qualities, and technical competence. \nUnfortunately, many university students in Bangladesh become so absorbed in textbook studies that they overlook the importance of real-world capabilities. As a result, when they graduate, they often find themselves unprepared, unemployed, and unsure of what to do next. This disconnect between academic learning and market readiness is a key reason for the growing unemployment problem in our country.\nIf students start developing skills alongside their academic education, they can become not just job seekers but job creators. Universities must encourage participation in co-curricular activities, such as tech clubs, entrepreneurship workshops, internships, competitions, and real-life projects. These initiatives foster creativity, confidence, and a sense of ownership.\nAt the same time, families should support children in pursuing passions beyond textbooks-whether it's learning coding, design, public speaking, or other 21st-century skills. It's crucial to understand that education is not the destination-it's the foundation.\nMd. Ala Uddin\nDepartment of Computer Science & Engineering\nBGC Trust University Bangladesh\nalauddin@bgctub.ac.bd\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Time to prioritise skill development",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/time-to-prioritise-skill-development-1751470500",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 03, 2025 00:00:00  \n\nBangladesh is witnessing a gradual but significant shift towards electric vehicles (EVs), driven by the global push for clean energy, rising fuel costs, and the country's own need to reduce air pollution. While still in its early stages, the EV market in Bangladesh presents both challenges and opportunities that will shape the nation's transportation. In recent years, Bangladesh has seen a steady increase in the use of electric vehicles, particularly three-wheelers like easy bikes and electric rickshaws. These vehicles offer an affordable mode of transport for millions, especially in semi-urban and rural areas. With over one million electric three-wheelers already in use, the sector shows potential for broader electrification, including private cars, buses, and delivery vehicles. The government has also signaled support for EV adoption. In 2021, the Bangladesh Road Transport Authority (BRTA) began drafting policies to regulate and promote electric vehicles. Several private companies have entered the market, offering imported EVs, while discussions are underway about developing local manufacturing capabilities.\nThe rise of EVs offers clear economic and environmental benefits. First, EVs can help reduce Bangladesh's dependence on imported fossil fuels, easing the burden on foreign currency reserves. With global oil prices volatile, transitioning to electric transport is a strategic move.\nSecond, electric vehicles produce no tailpipe emissions, helping combat air pollution-a major health issue in cities like Dhaka and Chattogram. Cleaner air can reduce respiratory diseases and healthcare costs.\nThird, EV production and maintenance can create new jobs. If local assembly plants are established, it could stimulate the automotive sector and create opportunities for engineers, technicians, and service providers.\nDespite these opportunities, several challenges could slow EV growth in Bangladesh. The most pressing is the lack of charging infrastructure. While electric three-wheelers rely on simple home charging setups, scaling up to electric cars, buses, and trucks will require public fast-charging stations-currently almost nonexistent. The country's weak power grid also poses a problem. Frequent load-shedding and limited grid capacity make reliable EV charging difficult, especially outside major cities. Cost is another barrier. Electric cars remain expensive for the average Bangladeshi consumer, and import taxes further raise prices. Without targeted tax incentives or subsidies, mass EV adoption is unlikely. There are also regulatory gaps. Many electric rickshaws operate without proper registration or road safety checks, raising concerns about safety and traffic management.\nJarin Akther \nStudent \nNorth South University\njarin.akther@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Challenges, opportunities of EV market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/challenges-opportunities-of-ev-market-1751470523",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-07-2025"
    }
]