[
    {
        "full_article": "Since 1995, when India became a dialogue partner of the Association of Southeast Asian Nations (ASEAN), and 2002, when it was upgraded to Summit level, the annual ASEAN summit has been an opportunity for India to reconnect with a region with historical linkages, and now increasing geopolitical importance. In addition to the ASEAN and ASEAN-India summits, the annual East Asia Summit (including the U.S., China, Russia, Australia, New Zealand, Japan, South Korea, India and the ASEAN countries) is a chance for the Indian leadership to interact with the most powerful countries on Indo-Pacific issues. The rebirth of the Australia-India-Japan-U.S. ‘Quad’, for example, took place in 2017, after a decade-long hiatus, on the sidelines of the ASEAN summit. Underlining this importance in his virtual speech at the ASEAN-India summit in Kuala Lumpur on Sunday (October 26, 2025) Prime Minister Narendra Modi called the 21st century “the century of India and ASEAN”, and committed to India’s support to “ASEAN Unity, ASEAN Centrality, and the ASEAN Outlook on the Indo-Pacific”. He also announced that 2026 would be the year of ASEAN-India maritime cooperation, with a focus on humanitarian assistance and disaster response, maritime security and the region’s blue economy. The summit — External Affairs Minister S. Jaishankar represented India — came at a time of increased geopolitical turbulence, including the economic turmoil unleashed by the U.S.’s tariff policy, China’s constraints on crucial exports, and maritime tensions. At the East Asia Summit, Mr. Jaishankar called the times “complicated”, taking aim at the U.S. for constraining energy trade with Russia and applying its principles “selectively”, and China for supply chain reliability and market access issues. India and ASEAN also committed to finalising the review of the ASEAN-India Trade in Goods Agreement (AITIGA) soon.The strong statements and commitment to cooperation did not, however, sufficiently cover for Mr. Modi’s absence from the Summit — he was absent in 2022 also. Malaysian Prime Minister Anwar Ibrahim said Mr. Modi had expressed his inability to attend due to festivities in India, but the explanation was unconvincing as the ASEAN engagement had been planned months in advance. While some pointed to Mr. Modi’s campaign schedule for the Bihar Assembly polls, others cited U.S. President Donald Trump’s presence and India-U.S. trade deal tensions as a possible reason for his staying away. A few even suggested a lingering strain in the India-Malaysia relationship over Malaysia’s diplomatic support to Pakistan during Operation Sindoor, and a visit by the Pakistani Prime Minister to Kuala Lumpur earlier this month. Mr. Modi may have had international, domestic or bilateral reasons, but the no-show was a missed opportunity, especially when other global players including the U.S. and China demonstrated their commitment to regional stability, by simply being there. Published - October 29, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        ASEAN\n                    \n                            /                      \n                        \n                        India-ASEAN\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        New Zealand\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        waterway and maritime transport\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Malaysia\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        international relations",
        "headline_1": "​Missed opportunity: On India and ASEAN summit in Malaysia",
        "headline_2": "India could have made better use of the ASEAN Summit",
        "link": "https://www.thehindu.com/opinion/editorial/missed-opportunity-on-india-and-asean-summit-in-malaysia/article70213530.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "Historically, October and November mark the period when the Bay of Bengal throws up devastating cyclones. Of the 12 such cyclones during the 18th Century CE-20th Century CE, nine were recorded in these months. They include the severe cyclone which made landfall near Nizampatnam, Andhra Pradesh, on November 19, 1977, and the super cyclone, which crossed the Odisha coast near Paradip on October 29, 1999. The human toll in both disasters was about 10,000 each, according to an India Meteorological Department (IMD) publication in 2021. Memories of such events get rekindled whenever a cyclonic storm develops in the Bay, an example being Cyclone Montha, which began to intensify into a severe cyclonic storm on October 27-28, 2025. Though not as strong as the ones in 1977 and 1999, this does not provide much comfort to the authorities in the three coastal States, including Odisha. Parts of north coastal Andhra Pradesh, especially Visakhapatnam, Anakapalli and Srikakulam districts, and also Ganjam and Gajapati of Odisha have received significant rainfall. In Andhra’s Kakinada and Konaseema regions, nearly 10,000 people were evacuated. The Odisha government made arrangements for the evacuation of people from vulnerable places amid inclement weather in several southern districts where there was a “red alert”. National Disaster Response Force teams were also deployed.Over the years, the preparedness of the Union and State governments has improved to an extent where the prospect of thousands dying in cyclones has become a thing of the past, if the last 20-odd years are an indication. However, there is still damage to public and private properties, affecting the livelihood opportunities of the under-privileged sections in particular. Likewise, milch and draught animals and poultry are severely impacted. When Cyclone Gaja struck the Tamil Nadu coast near Vedaranayam in November 2018, Nagapattinam district and Thanjavur saw large-scale losses of cattle and poultry. Several coastal States have been taking measures, structural and non-structural, to mitigate the effect of cyclones. Notwithstanding improvements to their knowledge and skills, the authorities in Andhra Pradesh and Odisha will have to demonstrate in action all that they have learnt so far while undertaking relief and rehabilitation measures. The political leadership should not lag behind and must ensure that all affected people are safeguarded and treated in an impartial way. Published - October 29, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        oceans\n                    \n                            /                      \n                        \n                        Monsoon\n                    \n                            /                      \n                        \n                        cyclones\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        weather\n                    \n                            /                      \n                        \n                        weather news\n                    \n                            /                      \n                        \n                        weather science\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        disaster management\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        relief and aid organisation\n                    \n                            /                      \n                        \n                        safety of citizens\n                    \n                            /                      \n                        \n                        natural disaster\n                    \n                            /                      \n                        \n                        disaster\n                    \n                            /                      \n                        \n                        disaster, accident and emergency incident",
        "headline_1": "Relief, rehabilitation: On India’s east coast and cyclones",
        "headline_2": "India’s east coast invariably bears the brunt of cyclones",
        "link": "https://www.thehindu.com/opinion/editorial/relief-rehabilitation-on-indias-east-coast-and-cyclones/article70212647.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "That India mostly doesn’t compensate those wrongfully convicted is, as SC said, a wrong that must be corrected \nSupreme Court has sought govt support to frame norms to compensate for wrongful arrest, prosecution and conviction. It announced its intent as it overturned the conviction of a man on death row for six years. SC has frequently acquitted death row convicts and expressed its anger and distress at subpar and dishonest police work and prosecution. It has berated subordinate courts for wrong judgments. SC’s intent is welcome but must be seen to completion. This gap in our justice system has been discussed threadbare, Law Commission made its recommendations (2018) while a legislative attempt in Lok Sabha – a private member’s bill, the Protection of Rights of Wrongful Convicts Bill (2019) – lapsed. BNS was an opportunity missed to put a compensation framework for false arrests, detention and conviction on the statute. Wrong imprisonment isn’t merely justice denied, but dignity destroyed, lives shattered and faith in justice system irreparably damaged.\nSo, how should compensation be decided? Law Commission recommended considering the offence’s seriousness, severity of punishment, length of detention, damage to health, harm to reputation, and of course, loss of income and opportunities. Add legal fees. In 2014, New York City paid $40mn to five black and Latino men wrongly convicted in 1989 in their teens for a brutal attack on a NY jogger in Central Park. DNA forensics cleared them 25 years later. US’s National Registry of Exonerations recorded 153 exonerations in 2023, of which “nearly 84% were people of colour”, and who “lost 2,230 years collectively for crimes they did not commit…” Between 1989, when the state-wise record was started, and 2023, New York state had made a total payout of $322mn to those wrongfully incarcerated. \nIndia does not even maintain a record of wrongful arrests, prosecutions or convictions. And if and when there is compensation, the amount is often a paltry figure. Discharged in 1996, it took Isro scientist Nambi Narayanan 20 years to win a compensation of ₹50L. SC said state can’t avoid its “vicarious liability”. But in 1998, SC had awarded him ₹1L in damages. One is expected to be simply grateful one’s free, even if broken and shattered.\n\n",
        "headline_1": "Not Guilty? Not Enough",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/not-guilty-not-enough/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "A MAGA researcher claims that the world- famous monument was built by an ancestor of the US president \nWas Taj Mahal built by an ancestor of Donald Trump? This claim has been made by a MAGA researcher, Dr BO Gus.\nDr Gus’s assertion regarding the provenance of the allegedly Mughal monument, built in 17th century as a mausoleum by Shah Jahan for his wife, Mumtaz Mahal, comes after teaser trailers for a Bollywood film, The Taj Story, which purports to unveil the “mystery” of the monument and reveal it to be a Shiv temple. \nThe original purpose of the monument, the exquisite dome of which has been described as “A teardrop on the face of eternity”, has long been in dispute. \nIn 1965 a lawyer-cum-historian, PN Oak wrote a book in which he claimed Taj Mahal was a Rajput palace possibly built in the 4th century. \nWhen it was pointed out that in the 4th century people didn’t have the architectural know-how to build an edifice like the Taj, Oak said, ‘Uh, oh. My bad”, and in 1989 published another book, Taj Mahal: The True Story, in which he said the monument was a 12th century Shiv temple built by Raja Jai Singh and subsequently Shah Jahan turned it into a mausoleum.\nNow the distinguished US scholar, Dr Gus has put paid to all conjecture regarding Taj Mahal by proving that the monument was built by a forebear of the current US president, who had come to India on the equivalent of an H-1B visa and built the monument. \nHe has adduced as evidence that Taj is an acronym for Trump’s Ancestral Jagirdari, a medieval Indian equivalent of Internal Revenue System whereby an official called a Jagirdar collected taxes for a commission. \nWith the funds thus raised, the proto-Trump turned the Taj into the world’s first casino that served as a model for the Trump Taj Mahal gambling den in Atlantic City. \nThe MAGA cheers raised for this revelation drowned out the sound of a pair of ancient bodies rolling in their graves…\n\n",
        "headline_1": "Trump’s Taj",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/trumps-taj/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "Right now, GOI should help Vi. But it must exit the telco soon. And it should disband BSNL, sell its assets\nIndia’s third largest telco, Vodafone Idea (Vi), is so deep in debt that pressing it to pay up is pointless. Its debt stands around ₹2L cr, and it owes govt over ₹80,000cr under the head of ‘adjusted gross revenue’. AGR was supposed to be a smart policy, giving govt a share of telco revenues, but as mounting dues show, govt earnings have been notional so far. So, Centre has wisely obtained SC’s nod to reassess the AGR demand on Vi. \nFor govt, there are good reasons to save Vi. Firstly, the need to maintain a semblance of competition. There was a time when India had over 15 telcos. Now, there are three private players with over 90% of the market, and one state-owned – BSNL, which also services erstwhile MTNL subscribers. If Vi goes down, customers will literally be at the mercy of a duopoly. Secondly, after trying to wring cash out of Vi for years – in taxes and penalties, and later AGR – and almost beaching it, govt has grabbed a 49% stake. So, it must keep Vi afloat and also be mindful of the interests of lenders and investors. If it can help nurse Vi back to health by forgoing some revenue now, the increased worth of its stake will fetch real returns. \nHaving said that, govt could have done this years earlier, for telcos have all along disputed the interpretation and implementation of AGR. It was never govt’s intent to be a stakeholder in non-core sectors, and here it is saddled with Vi, in addition to BSNL, thanks to its own rigidity. As of July, the combined outstanding of BSNL and MTNL was over ₹50,000cr, despite revival packages worth many thousands of crores over the years. No Western country owns a telco. UK, Germany and France reduced stakes in BT, DT and Orange, respectively, decades ago. India should also take the first exit from Vi when the price is right, and from BSNL-MTNL after monetising their land, buildings and spectrum – which had a book value of over ₹80,000cr in 2019 – and offering a golden handshake to staff. \n\n",
        "headline_1": "Hello, Hello",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/hello-hello/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "By Francis Gonsalves\nIt’s only in your imagination” or “Don’t let your imagination run wild” are critiques we often hear from teachers, parents, elders or friends. However, notwithstanding occasions when imagination can distort the truth, our imagination is an inherent power that allows us to transcend the here-and-now and create new images and ideas to revalue a treasured past and reap a thrilling future. It also helps us relate to and respond to God.\nThough science and commerce have brought many benefits, they have also contributed to a loss of enchantment and a depleted sense of the sacred in us. Relationships are often built and broken on the basis of cost-benefit ratios. The visible and material are all that count. Consequently, one imprisons oneself in a self-contained, technocratic sphere, without the richness of community and the joy of seeking life’s deeper meaning. Here, imagination can help us reorient our lives and reinvent our world.\nPoet Samuel Taylor Coleridge wrote about primary and secondary imagination. Primary imagination is our capacity to perceive and organise stimuli from the outside world. We have the power to order and orient our lives. Secondary imagination refers to the ability to go beyond primary organisation to reassemble perceptions and synthesise fragmentary truths, creating new meaning, which ultimately is our quest for the Divine. Thus, secondary imagination helps us to make meaning in the spiritual-religious realm.\nOur world is awash with pregnant signs of the sacred and stirrings of the Divine. While primary imagination makes us recognise these signs and stirrings, secondary imagination creates new meanings through symbols expressed in diverse forms such as rituals, myths, poetry, art, music, and stories. This transports us into the realm of transcendence. Imagination becomes our gateway to God.\nImagination functions through the language of symbols. We sometimes dismiss symbols as being ‘not real’. This is naïve, since symbols function at the edge of language and push back the borders of the unknown, revealing truth to us in a way we can grasp. Moreover, symbols address the many dimensions of life – intellectual, emotional, moral, aesthetic, religious, spiritual and so on – thereby involving our whole being, leading to a deeper perception of truth within us, and without.\nThe imagination’s symbol-making power allows us to negotiate the paradoxes of life. We glimpse that beneath the pain of death lies the promise of life, that beyond doubt lies faith, that despite falsehood around us, truth must prevail. In all this, our imagination manufactures symbols – from embodied ritual symbols to metaphoric story symbols – that help us cope with the contradictions and challenges of our finite human lives.\nFrom birth to death, we live in a specific slice of history. Religions differ on what lies before and after. Yet, human consciousness has a spatiotemporal quality, whereby we strive to make sense of everything by fitting it into a narrative – a ‘first this and then that’ – using the symbols of our culture and religion to tell our story. Our stories will differ, but it is up to us to create new stories and reconfigure the elements of our experiences into new patterns, providing fuller possibilities for life.\n\n",
        "headline_1": "Create new worlds with power of imagination",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/create-new-worlds-with-power-of-imagination/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 29, 2025 00:00:00  \nThere is no question that workers' pay hike or demand for it is part of the job culture. But such a hike is always based on the increase in the earnings of the organisation concerned. In the case of the government, it is from the revenue earnings that demands for such pay raises are met. From that perspective, one needs to assess the new pay scale for public servants. The National Pay Commission (NPC) 2025, which is now engaged in the difficult task of preparing a new pay scale, has reportedly made an initial estimate that the government will require a whopping sum of about Tk 700 billion annually to accommodate the raises in pensions, gratuities and medical allowances. However, one commission member has described the estimate as a 'ballpark' figure, meaning that it is not an exact number. \nThe NPC, which is unlike a host of other commissions that the interim government had formed early this year, will have to review and recommend pay raises for public servants by November 30 next. Understandably, it is a race against time for the NPC to complete its task within such a short time. Though preliminary estimate, the figure is too big. Even a figure a bit smaller than the NPC's estimated Tk 700 billion will be difficult for the government to arrange. The preliminary estimate is equivalent to around one quarter of the country's annual earnings in tax revenue. It is more so when the country's revenue board is more often than not failing to fulfil its annual revenue collection targets, thanks to high inflation, sustained erosion of income of fixed income groups, overall slump in business activities, to name but a few of the negative factors impacting performance of the economy. Worse yet, traditionally every time a new pay scale for government officials is announced, the prices of essential commodities in the kitchen market go up. \nUnfortunately, the economy has not been doing well. Actually, the economy has been in the doldrums during the last one and a half decades, despite the claims of miraculous growth to the contrary. Such claims, everyone knows, were based on fake, made-to-order, figures to suit the purpose of the powers that be. Can a section of bureaucracy wash its hands of that legacy? Did the autocracy not reward the public servants complicit in its power abuse, massive corruption and other misdeeds, among other means, through irrational pay hikes?\nNotably, the inflation in 2015 rose following introduction of the eighth pay scale for public servants and it began to surge since March 2023. One may also recall here how a section of civil bureaucracy in the past broke their code of conduct with impunity and came out openly in the name of 'servants of the republic' to serve partisan interests. Unsurprisingly, the overall quality of performance and professionalism among public servants began to fall since. The new pay commission needs to be sensitive to all these issues and their impacts on the economy to recommend the raises in the new pay scale, which the finance ministry itself termed ambitious. As the pay commission added that it was a 'guesstimate', the final figure for the new pay scale may then see a further rise which may overshoot the present fiscal limit. In that case, given the limited mandate and time in its hand, the interim administration would be well-advised to leave the tricky issue of implementing the new pay scale to the discretion of the next elected government.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Implementing new pay scale for public servants",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/implementing-new-pay-scale-for-public-servants-1761662579",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       October 29, 2025 00:00:00  \nThe question of whether Foreign Direct Investment (FDI) in Bangladesh's readymade garment (RMG) sector is ultimately beneficial remains unresolved. Industry stakeholders and policymakers have yet to provide a definitive stance. There are foreign collaborations, but not in the form of large-scale FDI. However, the government's efforts to attract FDI in both within and outside the Export Processing Zones (EPZs) is not industry-specific, and hence not meant to exclude any specific manufacturing sector beyond the scope of investment. The key question remains: is FDI outside the specialised zones a welcome proposition?\nIn recent years, Bangladesh has emerged as a viable destination for industrial relocation, especially from countries like China, Japan and South Korea. Rising labour costs in those economies have prompted many manufacturers to seek alternative locations for setting up export-oriented industries. Bangladesh, despite infrastructure and governance challenges, offers competitive advantages such as a low-wage, abundant labour force and experience in mass garment production. Among all manufacturing sectors, the RMG industry stands out as the most promising candidate for attracting overseas investment. Industry observers argue that FDI in this area could generate multiplier effects across various related sectors-logistics, packaging, accessories and more.\nHowever, local RMG manufacturers remain wary of such developments. It can well be guessed that much of the concerns of the local manufacturers stem from the fear that if the government allows unconditional approval to foreign investment in the RMG sector, there might be serious competition in the low-end segment products---the key strength of Bangladesh's apparel industry. This fear is further heightened by the fact that China has already made it known that producing low-end apparels is no longer viable in that country, because of soaring wages. So, provided with adequate opportunities, chances of relocation of Chinese factories for low-end products are high. \nIn view of this, stakeholders are more inclined to confine foreign investment in the garment sector to the EPZs only. They reportedly agreed some time ago to accept foreign investment outside the EPZs on condition that those factories will produce fashion items for non-traditional and new markets like Russia, Brazil, China, South Africa, India, Australia and Mexico.\nThe country's RMG sector is now in a state of uncertainty, if not panic. Exports did not suffer any major setback following the impacts of Covid 19 and the Russia-Ukraine war on global markets and notwithstanding some ups and downs in export orders coming to Bangladesh, the sector did demonstrate strong resilience that eventually helped ride out the problems of supply chain disruptions and market instability. However, in order to further strengthen the foundation of the industry, experts including foreign buyers stress upon the need for expanding and diversifying the manufacturing base in ways that will be beneficial to the local industry and the country's economy. Is FDI the right recipe in this regard? \nIn the investment summit held sometime ago, the deliberations mainly centred on economic zones including what the country is ready to offer to investors in those zones. Since the event was organised by the Bangladesh Economic Zones Authority (BEZA), the focus was obviously to attract prospective investors to those zones, some of which are country-specific. \nThere are quarters in the country which fear foreign investment in the RMG outside the SEZs and EPZs might pose a genuine threat to the sector. Looking at the scenario simplistically may not help, as there are counterarguments that may reveal that the fear of the local manufacturers is more from better wage prospects for workers in the foreign factories, which in turn will have its effect on the local ones. \nIt should be noted that the local manufacturers at the moment are rigid in their stand on wages. The rigidity of domestic entrepreneurs on wage issues has often been a contentious topic, particularly in labour rights discussions. Allowing foreign investment in low-end segments could, they fear, disrupt the wage equilibrium and create labour unrest in existing factories. So, according to them, inviting foreign investment in the basic and low-end segment of apparels would call for undesirable chaos. In this context, critics are at ease to raise the all-important question: if foreign investors can afford to pay better and still make profits, why not the locals? \nGiven these complexities, any decision to allow FDI in the RMG sector-particularly outside EPZs-must be preceded by a comprehensive consultation process. Engaging local stakeholders, especially domestic manufacturers, will be critical in finding a workable solution. It is also essential to involve think tanks, policy analysts and industry experts to weigh the broader implications of such a policy shift.\nBangladesh's RMG sector is at a crossroads. While FDI could act as a catalyst for transformation and long-term competitiveness, unregulated or poorly managed foreign entry could disrupt the delicate balance the industry has maintained over decades. A thoughtful, strategic approach-rooted in inclusive dialogue and clear regulatory frameworks-will be essential to ensure that FDI complements rather than competes with the local industry.\nwasiahmed.bd@ gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Reviewing FDI policies for a stronger apparel value chain",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/reviewing-fdi-policies-for-a-stronger-apparel-value-chain-1761662625",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 29, 2025 00:00:00  \n\n Women's education and employment are among the most vital and widely discussed topics of this century. Bangladesh is not outside this trend. However, there is a significant gap between the percentage of women who receive education and the percentage who participate in employment in the country.\nIn Bangladesh, the rate of female education has reached its peak over the last two decades. Yet, a large gap remains between women's educational attainment and their participation in the workforce. Student dropouts occur at various educational levels, but nowadays the main dropouts happen after the higher secondary and graduation levels. Various social, religious, situational and personal barriers contribute to this gap. Issues such as child marriage, lack of awareness about education and employment, superstitious beliefs regarding women's work, societal expectations after marriage and child-care responsibilities are significant factors behind this disparity.\nFor instance, as Bangladeshi society is largely patriarchal, female family members are not always expected to be employed or contribute financially. Women are often seen as the primary managers of households and bear significant responsibilities as mothers. Additionally, some women choose not to seek employment even after completing higher education.\nThis causes concern because the gap between women's education and employment in Bangladesh remains striking. Even though girls surpass boys in enrollment at some educational stages, their participation in the labour force is disproportionately low-approximately 44.15 per cent, according to 2024 data.\nAddressing this gap is essential for the overall development of the country. Effective measures could include creating employment opportunities and safe work environments for women, promoting higher education and skills training, addressing social and cultural barriers, and providing proper career guidance. Policymakers, government, and non-government organisations have a crucial role to play as leaders in society. At the same time, every member of society shares responsibility for addressing these micro and macro issues to increase women's participation in the workforce.\nAysarjo Karmokar\nInstitute of Social Welfare and Research\nUniversity of Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Women's education and employment",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/womens-education-and-employment-1761662654",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 29, 2025 00:00:00  \n\nRecord-high global gold prices not sparing Bangladesh signal a decline in public confidence in the taka, reflecting more than just international market volatility. As inflation erodes savings and the dollar strengthens, many small and large investors are turning to gold as a safe store of value. Investing in gold is not merely a trend or a reflection of global uncertainty; it is a clear signal of growing concerns among the population about the stability of their currency and the economy at large.\nAlthough Bangladesh Bank attributes the rising gold demand to international factors, local elements cannot be overlooked. The current instability of the market exchange rate, declining foreign reserves, collapse of banks and weak purchasing power have heightened public anxiety. For many households, gold has become a preferred hedge against economic uncertainty.\nThe government must take necessary steps to restore people's faith in the taka. \nThese include tightening fiscal discipline, controlling inflation through targeted policies, rebuilding foreign reserves and ensuring greater transparency in monetary policy decisions. Effective public communication is also vital; providing clear guidance on economic strategy can help alleviate panic-driven gold purchases. Moreover, promoting domestic investment opportunities and enhancing the credibility of the banking sector can reduce reliance on physical assets.\nAchieving stability in the gold market requires a coordinated approach by the government and the Bangladesh Bank, focusing on macroeconomic stability. This is essential to protect savings, restore confidence and ensure sustainable economic growth.\nRituraj Bhuiya, BBA\nNorth South University\nrituraj.bhuiya@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Gold prices and waning confidence in Taka",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gold-prices-and-waning-confidence-in-taka-1761662676",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-10-2025"
    }
]