[
    {
        "full_article": "On July 10, U.S. President Donald Trump announced a 35% tariff on Canadian imports, despite Ottawa rescinding a 3% digital services tax (DST) that was to go into effect on June 30; Mr. Trump had dubbed this as an ‘attack on American firms’. Canada expected that it would generate about $5 billion from DST on revenues from Canadian-source digital services over five years dating it back to January 1, 2022. The 35% tax was imposed despite ongoing trade talks, which Canada was hoping would result in a trade deal by July 21 — as agreed upon between Canadian Prime Minister Mark Carney and Mr. Trump on the sidelines of the G-7 summit in mid-June. The new 35% tax, that was conveyed to Mr. Carney through a letter, which Mr. Trump sent to more than 20 U.S. trading partners, is likely to exempt items compliant under the 2018 United States-Mexico-Canada Agreement. Canada and the U.S. are each other’s largest trading partners. In fact, despite Mr. Trump’s constant refrain about the flow of fentanyl, the opioid coming through America’s northern borders (less than 0.1% of what lands in the U.S.), what has rankled the American President is the trade surplus of about $63 billion in Canada’s favour. This on-again-off again approach to tariffs as a stick against America’s trading partners has forced even steadfast allies such as Canada to scramble to diversify. Hours before receiving Mr. Trump’s letter, Mr. Carney posted a picture of himself with British Prime Minister Keir Starmer on X, saying, “... the world is turning to reliable economic partners like Canada.”America’s action against Canada brings to mind a similar episode about a decade ago between close neighbours, India and Nepal. India closed land ports following the enactment of Nepal’s new Constitution citing fears about the treatment of the minority Madhesi community that has had close ties to India. This action crippled Nepal’s land-locked economy that was entirely reliant on Indian ports such as Kolkata and Visakhapatnam for its trade. Acute fuel and medicine shortages followed. Nepal’s GDP collapsed from 3.3% in FY15 to 0.2% in FY16, and Nepalis began harbouring a deep resentment toward India. New Delhi’s move forced Nepal to recalibrate its foreign and economic policy, eventually leading it to join China’s Belt and Road Initiative in 2017 and accepting massive infrastructure funds from Beijing, much to New Delhi’s dismay. This episode, between two vastly different nations, would serve Washington well to realise that mending a trade imbalance must not come at the expense of losing one of its closest allies with deep running cultural and linguistic ties, as Canada, with an economy that is one-eleventh that of the U.S. albeit with a trade surplus, now attempts to redraw its foreign and economic strategies.\r Published - July 15, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        Canada\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Nepal\n                    \n                            /                      \n                        \n                        Belt and Road Initiative\n                    \n                            /                      \n                        \n                        imports",
        "headline_1": "​Too close for comfort: On America’s tariff and U.S.-Canada ties",
        "headline_2": "Canada is looking for new friends after the Trump-induced uncertainty",
        "link": "https://www.thehindu.com/opinion/editorial/too-close-for-comfort-on-americas-tariff-and-us-canada-ties/article69811336.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "Feats on grass have a special allure. When they come at Wimbledon, the most prestigious grass court on the planet, they acquire a richer tone of lustre. Jannik Sinner and Iga Swiatek, who won their maiden titles at the All England Club over the weekend, stand testament to this. Both were past Major champions, with Sinner having won three and Swiatek five trophies. Yet, by their own admission, very few achievements rank alongside their runs on the pristine lawns of southwest London. The wins also come at a critical juncture in their tennis lives as both players served doping-related bans in recent months and had their sporting ethics questioned. For Sinner, the success against two-time defending and five-time Slam champion Carlos Alcaraz snapped a streak of five straight losses to the Spaniard. This sequence contained the most painful of all defeats, at Roland-Garros last month where the Italian lost despite being three championship points up. The victory at SW19 showed the 23-year-old’s remarkable powers of recovery and mental resilience. For Swiatek, Wimbledon was her first trophy of any kind since the French Open 2024. The Pole, who had spent a combined 125 weeks as No. 1 — seventh best in history — had slid down the rankings and had lost her aura. But by winning on her least-favoured surface, she has resurrected her career emphatically.Sinner’s and Swiatek’s triumphs will also have wide-ranging effects on their respective Tours. Sinner and Alcaraz have now split the last seven Majors between them, and Wimbledon was the second straight Slam final they were sparring in. In fact, starting from the Rome Masters in early May where Sinner made his comeback from doping suspension, they have clashed in the final in all three competitions they have both been part of, reinforcing the view that theirs is now men’s tennis’ pre-eminent rivalry. They have met 13 times — 10 of them in semifinal or better — and appear to have fully satiated fans’ desire to see a worthy follow-up to the famed Roger Federer-Rafael Nadal duel. Ranked No. 1 and No. 2, they are also head and shoulders above the rest of the field. The gulf is best explained by Sinner’s ATP points-tally of 12,030, which is nearly double that of third-ranked Alexander Zverev. Swiatek, meanwhile, has re-established the triumvirate atop the women’s game. The 24-year-old may be the ninth different Wimbledon winner in as many editions, but she, Aryna Sabalenka and Coco Gauff have won 10 of the past 14 Majors. Swiatek’s six Slams make her the leading light among active women, a position she seems primed to hold on to.\r Published - July 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Wimbledon\n                    \n                            /                      \n                        \n                        tennis\n                    \n                            /                      \n                        \n                        France",
        "headline_1": "Courting grass: On Wimbledon 2025",
        "headline_2": "Sinner and Alcaraz look set to establish a famed rivalry",
        "link": "https://www.thehindu.com/opinion/editorial/courting-grass-on-wimbledon-2025/article69811312.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "GOI directive on desi deep fried snacks misses the point: aam aadmi needs affordable, healthy options\nRussians visiting GOI’s nine-day Bharat Utsav festivities in Moscow that concluded Sunday were raving about an Indian duo at the stalls – samosa and masala chai. Union health ministry back home may want central govt offices to put up ‘oil and sugar boards’ as a reminder of samosa’s – and jalebi’s – adverse impact on health, but the irony is, samosa/jalebi is part of what’s often quasi-officially celebrated as India’s contribution to global list of munchies.\nTwo points. First, undoubtedly, pakodas, vada pav, laddoos, samosas, jalebis and their ilk are unhealthy foods. But they’re free of preservatives and mostly cooked at point of sale. There’s exhaustive evidence that consuming ultra-processed, packaged fried snacks high in fat and sugar is driving India’s obesity problem. Yet, we still do not have front-of-pack-label regulations for packaged foods. Second, availability and affordability. Per ministry directive, these boards/ posters/cautionary signs will be put up in all canteens or stalls on the premises of central govt institutions. To alter people’s consumption of transfat-rich foods, to change people’s snacking behaviours, health ministry also needs to provide alternatives in these very places. The onus of eating healthy is not on people alone – what options, healthy and affordable, is the govt canteen serving?\nTake for instance, the 57 items Western Central Railway lists as available at its stalls. Snacks range from idli-vada-dosa to pakodas (bread/onion/paneer), samosa, cutlets and, of course, aloo bonda. Prices start at Rs 10 (kachori), upto Rs 25 (veg cutlet). The cheapest – and only healthy – snack is a boiled egg, Rs 9. Jalebi is cheaper: Rs 6. For people on the go, grabbing a vada pav is commute culture. Without providing options, cautionary signs may simply push consumers to packaged foods – that can only worsen the obesity health crisis.\n\n",
        "headline_1": "Judge Not The Jalebi",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/judge-not-the-jalebi/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "Imagine a game where you can win a lot of money very quickly – but also lose even more just as fast. That’s what something called derivatives trading is like. It’s a kind of money game played in the stock market, and it’s become very popular in India. But for most ordinary people, it’s turning out to be more of a trap than a treasure.\nA big company from New York called Jane Street has been earning huge money from this game in India. In just over two years, it made about ₹37,000 crore here – that’s a giant amount! But recently, India’s stock market watchdog, SEBI, said Jane Street may have played unfairly and tricked the system to make money. They’ve been stopped from trading for now, though the company says it did nothing wrong.\nBut this story isn’t just about Jane Street. It shows a bigger problem.\nMany people in India who don’t earn a lot of money – say less than ₹40,000 a month – have been trying their luck in derivatives trading. In fact, 3 out of 4 trades last year were by such people. It’s almost like buying lottery tickets, hoping for a lucky win. But just like the lottery, most people don’t win. SEBI says 91% of investors lost money, and on average, each person lost about ₹1.2 lakh. Younger people under 30 were losing money even faster.\nSo, while small investors were losing a total of ₹61,000 crore, big companies and trading firms were making that same amount. That’s not fair, is it?\nA famous investor, Warren Buffett, once said derivatives are like “financial weapons of mass destruction.” They’re complicated and risky. Big businesses might know how to use them safely, but for regular people, it’s very easy to lose big money.\nSEBI has made some new rules to protect people, but rules alone aren’t enough. We also need better financial education – people should understand what they’re getting into before putting their hard-earned money at risk.\nSo, just like you’d be careful before playing a dangerous game, investors need to think twice before jumping into the world of derivatives. It’s not really meant for everyone.\n\n",
        "headline_1": "Not for Everyone: Why Derivatives Are Risky for Small Investors",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/not-for-everyone-why-derivatives-are-risky-for-small-investors/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "Jane Street case, regardless of its outcome, must lead to measures for shielding ordinary investors from risky investments\nThe alacrity with which trading firm Jane Street has deposited ₹4,875cr ($567mn) in an escrow account to resume trading shows how lucrative the Indian derivatives market is. Last year, the NYC-headquartered firm earned about ₹20,000cr ($2.3bn) here. In the 27 months from Jan 2023 to March 2025, its India profit totalled roughly ₹37,000cr ($4.3bn). And Jane Street is one of many players in the world’s largest derivatives market – measured by contracts. This might sound like an achievement but is a concern actually.\nAs Sebi’s months-long investigation found, small retail investors responsible for India’s derivatives trading frenzy might have been taken for a ride. It says Jane Street manipulated stock values on the Nifty50 index – “an intentional, well-planned and sinister scheme” – to profit from derivatives. That was the reason for its July 4 order barring the company from the securities market. Jane Street will appeal the decision, but even if it is absolved of blame, the securities market remains a cautionary tale for small investors, and Sebi’s data illustrates this best.\nIndia’s ‘middle class’ is broadly said to start at the ₹5L mark – monthly earnings of around ₹40,000. But people earning less than this amount participated in three out of every four futures and options (F&O) trades last fiscal. In effect, derivatives trading became the new weekly lottery for a segment that might be struggling to pay bills. And just as lottery winners are rare, the vast majority of F&O investors lost money – Sebi says 91.1%. The average loss per investor was ₹1.2L. Investors younger than 30 years, who are the fastest growing cohort, making up 43% of participants now, were even more likely to lose. Altogether, retail investors lost ₹61,000cr in derivatives trading last fiscal, while trading firms, both Indian and foreign, pocketed – no surprise – ₹61,000cr.\nIt’s a spectacular wealth transfer in the wrong direction. Warren Buffett had described derivatives as “financial weapons of mass destruction” in 2002, well before mortgage-backed securities played a role in the 2008 global financial crisis. There’s no denying that derivatives have a role in the modern financial system, and are a useful hedge for businesses, but they are beyond the understanding of the ordinary retail investor, who should be shielded from them. Sebi has already taken regulatory measures, but better financial education is equally important.\n\n",
        "headline_1": "Not An Option",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/not-an-option/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "A doc & his Mrs on turning the clock back \nAntiaging – that’s the new buzz word. I lowered my newspaper and smiled intelligently at my wife after providing my Gyaan of the Day. She frowned, ‘Not just aunties, uncles are also aging. Even though they dye their hair jet black and refuse to accept their fifty shades of grey.’ Kamala makes everything a feminism debate nowadays.\nBut aging is one sphere where there is gender parity. I’m talking about trends…like Botox.  She narrowed her eyes: ‘If you’re going to be vulgar I’m leaving. You don’t have to be rude about my burgeoning backside.’ Kamala listens to a lot of Shashi Tharoor speeches.\nI wasn’t referring to booty but to beauty treatments – like fillers. These are much needed as we age. I’m sure she understood me, but she decided to throw in a socio-political comment to sound superior: ‘Whether it’s Delhi or Mumbai or Bengaluru, all cities need their roads repaired and potholes filled. Bridges need to be maintained and checked regularly.’\nSo also the human face and body (I was sticking to my topic). Sometimes it needs a little boost. A little correction. A touch of treatment. So we can look like Gen Z bro. Yolo.\nKamala sat back on the armchair and looked deeply philosophical: “You know, this generation has it all sorted. Now they have a drug for weight loss. Like our 2-minute noodles they can lose weight instantly with minimum effort. Though some of the brand ambassadors are looking a bit like the living dead. Gauntie-aging!’ She has a habit of creating words and hoping people make it the Oxford word of the year.\nIt doesn’t prevent brain rot, I countered. It’s like painting an old dilapidated building while it’s crumbling from the foundation. Kamala perked up: ‘That’s what we should do! Add more layers – cleanser, toner, hyaluronic, glycolic, sunscreen, retinol and finally foundation. Nothing survives without a good foundation.’\nI smiled at her indulgently. I was about to say something trite like age is just a number. But she beat me to it: ‘Your silly sense of humour keeps me laughing. All said and done, together with good healthy food, regular exercise and adequate sleep, laughter is the best medicine.’\nWe have an appointment with a qualified dermatologist tomorrow – I hope he has a sense of humour. I’m not complaining. Maybe that is the anti-aging mantra: Not complaining.\n\n",
        "headline_1": "Skin city",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/skin-city/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 15, 2025 00:00:00  \nIt is heartening to know that the National Board of Revenue (NBR) has already framed a draft of the code of ethics and professional conduct for its staff in order to make its service transparent and accountable. Why the NBR needs such ethical guidelines is not far to seek. It has ever remained one of the most corrupt government organs. In this context, the finding by the Bangladesh Bureau of Statistics' study on the state of bribery in the government offices that 31.67 per cent of the respondents had to pay bribes to get services may be illuminating for several reasons. The BBS-conducted study presents this unsavoury picture of the past one year when the interim government was at the helm of affairs. Titled \"Citizen Perception Survey 2025\", this study reaffirms that old habit dies hard for people in government service. The NBR with its infamous Motiur Rahman legacy surprisingly did not figure among the top corrupt government agencies.\nNow what can be the possible explanation for this? The BBS study may have selected people of modest income, not those who have taxable incomes or actually submit tax returns. The survey has found the Bangladesh Road Transport Authority (BRTA), law enforcement agencies and land registry offices as the dens of corrupt practices with 63.29 per cent, 61.29 per cent and 54.92 per cent people respectively coerced to pay bribes for receiving service. Had respondents from the upper echelon of society been selected, the NBR would have every chance of breaking into the circle of the top three groups. It is not for nothing that the International Monetary Fund (IMF) has tagged reform of this order to the NBR with its loan sanctioned for Bangladesh. The multilateral funding agency has taken interest in this matter and a team is scheduled to visit Bangladesh to extend technical support and also assess the code of ethics framed. \nThat the tax-GDP ratio is one of the lowest in Bangladesh and even lower than its South Asian neighbours is not simply because wilful tax dodgers can evade paying their dues on their own account, it is also because of an unholy alliance between a section of the revenue officials who prompts the process. So there is the need for the envisioned code of conduct which if framed well and made effective will leave not much leeway for such corrupt practices. Here the attempt is to set a benchmark of standard practices in providing service. When dearth of people with integrity is acute, there is no other alternative to tightening the set of practices and behaviours governing administration in its public dealings. All corrupt government agencies are sure candidates for similar ethical guidance. \nLet the process take off with the introduction of the code of ethics in the NBR. Other government agencies may raise a dissenting voice like a section of the NBR officials did, saying that there are public service rules which guide their conducts. But this is a lame excuse. The bureaucracy and the administrative setups down the order have long been pampered by governments in order to establish a privileged but pliable coterie for mutually advancing material gains through corruption. If the NBR gets the priority right, there is no reason why other government agencies would not be made \nto follow suit.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Code of ethics for NBR",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/code-of-ethics-for-nbr-1752508919",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       July 15, 2025 00:00:00  \n\nRemittance has long been a cornerstone of Bangladesh's economic stability and growth. The billions of dollars sent home by expatriates have served as lifelines for families, bolstered our foreign currency reserves, fueled rural economies, and underpinned banking liquidity. In the fiscal year 2023-24, remittance inflows reached an impressive USD 24 billion -- a figure that demonstrates the immense contribution of migrant workers to the national economy. However, a closer look reveals a looming threat: nearly 80 per cent of this remittance came from the Middle East -- a region now engulfed in deepening instability.\nThe Middle East, once seen as a dependable and generous host to Bangladeshi migrant workers, is today mired in relentless political and military turmoil. From the drawn-out war in Yemen and clashes in Lebanon to the ongoing crises in Syria and Iraq, the genocidal violence in Gaza, and the recent escalation in the Iran-Israel conflict -- the region is quickly becoming a tinderbox of global conflict. These developments are not isolated or distant; they strike at the very core of our economic security. With millions of Bangladeshis working in the Gulf states and beyond, any prolonged disruption in the region could result in mass job losses, forced returns, and a sharp decline in remittance inflows.\nThis is not a warning we can afford to ignore. It is imperative that Bangladesh begins exploring and developing alternative sources of remittance and foreign income without delay. The old adage \"Don't put all your eggs in one basket\" rings especially true for us now. We cannot continue to rely so heavily on one region for our economic lifeline -- especially a region so riddled with uncertainty.\nThe first and most immediate step is labour market diversification. Bangladesh must aggressively pursue new labor destinations across Southeast Asia, Eastern Europe, Latin America, and Africa. Countries such as Malaysia, Japan, South Korea, Romania, Belarus, Croatia, Poland, Brazil, and Chile are grappling with a shortage of skilled and semi-skilled workers. These are opportunities waiting to be tapped.\nTo access these markets, Bangladesh will need to deploy proactive diplomacy. This means forging bilateral labour agreements, offering mutual training recognition, ensuring worker protection, and building trust with host nations. It also requires private sector collaboration and streamlined government processes to facilitate quicker deployment of trained labor.\nMany Bangladeshi workers currently employed abroad -- particularly in the Middle East -- are low-skilled or unskilled. But the demand in emerging labour markets is shifting toward skilled and semi-skilled categories. This mismatch presents both a challenge and an opportunity.\nTo bridge the gap, the government must prioritise skills development programmes tailored to international demand. Training in electrical work, plumbing, welding, nursing, caregiving, hotel and restaurant management, IT, digital marketing, and even niche areas like hairdressing can transform the earning potential of outbound workers. For example, hairdressing, often dismissed as a low-income trade, commands substantial income in European cities.\nBy investing in internationally accredited training programmes through technical schools, polytechnics, and public-private initiatives, Bangladesh can unlock a new generation of skilled migrants ready to meet global demand -- and send home greater remittances in the process.\nStill, relying solely on exporting labour -- regardless of the market -- keeps Bangladesh vulnerable to external shocks. The more we depend on foreign economies, the more we expose ourselves to global volatility. Therefore, long-term resilience demands the creation of robust employment opportunities within our own borders.\nBangladesh has the potential to stimulate large-scale employment through the development of agriculture-based industries, SMEs, export-oriented manufacturing, freelancing, and entrepreneurship. These are not only avenues for reducing unemployment, but also for increasing domestic income and internal economic circulation.\nFreelancing, in particular, has emerged as a major global trend, and Bangladesh is already on the map. After India, we are the second-largest pool of IT freelancers globally. Yet, in the absence of proper infrastructure, payment gateways, tax incentives, and policy support, our freelancers have not been able to translate their potential into substantial export earnings. By removing these bottlenecks, Bangladesh can turn freelancing and digital services into a billion-dollar export industry.\nWhile remittances remain vital, export diversification must go hand in hand with labour market reforms. The ready-made garment (RMG) industry currently accounts for the bulk of our export earnings, but over-reliance on any one sector -- as with any one region -- is dangerous.\nThere are promising sectors just waiting for the right push: pharmaceuticals, agro-processing, leather, ceramics, frozen fish, light engineering, and handicrafts. With modern infrastructure, smart subsidies, and global market connectivity, these industries can generate substantial foreign exchange -- reducing our dependence on overseas labor altogether.\nThe IT sector again stands out as a game-changer. With a young, tech-savvy population and a growing digital ecosystem, Bangladesh can become a major hub for outsourcing, software development, and digital services. Countries like India, Vietnam, and the Philippines have already shown the path. All we need is the vision and commitment to follow it.\nShould the Middle East crisis escalate, a large number of Bangladeshi migrants may be forced to return home. This influx, if not managed well, could overwhelm the labour market and increase social pressures. But if handled with foresight, it can become a turning point.\nReturnee workers bring skills, discipline, and capital -- all of which can be channeled into domestic productivity and investment. The government must create an investment-friendly environment tailored to the needs of the returnees: access to land, bank loans, simplified regulatory procedures, and tax incentives. Such measures can encourage them to become entrepreneurs and employers. This not only ensures them an avenue for soft landing but also turns them into engines of economic growth.\nFinally, awareness at the family and community level is essential. Many Bangladeshi households are entirely dependent on remittance, which makes them financially vulnerable. These families must be guided to explore alternative income sources, develop financial literacy, and think beyond remittance dependency.\nThis can be achieved through joint efforts by local government bodies, NGOs, and the media. Awareness campaigns, community-based entrepreneurship training, and microcredit access can prepare families to adapt and thrive -- even in a post-remittance scenario.\nThe political crises of the Middle East are not just geopolitical developments playing out on foreign soil -- they are directly connected to the fate of millions of Bangladeshis and the economic lifeline of our nation. We may not be able to stop wars in Yemen, Gaza, or Iran, but we can -- and must -- prepare for their economic fallout.\nNow is the time for visionary leadership, not reactive firefighting. Now is the time for bold policies that prioritise human capital, innovation, and diversification. The choices we make today will determine whether we survive future crises or fall victim to them.\nBangladesh stands at a crossroads. It must move beyond the comfort of known markets and traditional remittance channels. A new era demands new thinking -- and exploring alternative sources of remittance is no longer an option; it is an urgent necessity. If we act wisely and decisively now, we can turn today's threats into tomorrow's opportunities. If not, we risk letting uncertainty dictate our destiny.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Exploring alternative sources of remittance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/exploring-alternative-sources-of-remittance-1752509089",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       July 15, 2025 00:00:00  \n\nIndustry leaders in the Readymade Garment (RMG) sector should have been elated by the fact that in the last financial year (FY2024-25), export of their products to the USA registered a sharp rise by 14 per cent compared to the previous fiscal (FY24). But at the moment, they may not be in the mood to rejoice at the latest development. The reason is, the tariff talks with the USA, the single biggest market for Bangladeshi woven garment products, have not produced any positive results so far. Notably, the Trump administration, in addition to the existing 15 per cent, has imposed another 35 per cent as reciprocal tariff on Bangladesh's exports to the USA. Now it is also demanding a 40 per cent local value addition to our RMG products to qualify for 'Made-in-Bangladesh' label. But this condition, if not relaxed, is going to deal a heavy blow to the woven garment's export to the US market. Bangladesh's trade delegation in Washington, D.C. has been holding negotiations with the Office of the US Trade Representative (USTR) seeking relaxation of the Rules of Origin (RoO) requirement related to the condition of 40 per cent local value addition. The problem with this particular requirement is that 70 per cent of the fabric for the woven sector is imported from China. Obviously, that is a big issue for Washington, as it is at the moment in a trade war with China. The Trump administration's policy is to reduce global value chain's reliance on Chinese raw materials. According to the Export Promotion Bureau (EPB), in the fiscal year 2024-25, Bangladesh exported RMG products worth USD7.54 billion to the US market. It marked a substantial volume of apparel goods shipment to that country. So, it is not hard to understand the challenge Bangladesh is now faced with. And of that US bound apparel goods, woven garment was the dominant component. To reduce Bangladesh's dependence on China-origin fabric for its woven sector, domestic capacity is required to be developed for meeting the US's condition of local value addition. Since developing the necessary backward linkages to produce the fabric (for woven garment) domestically, Bangladesh would be hard put to meet USTR's RoO requirements. Since Bangladesh-US tariff talks have also their geopolitical dimensions, the team conducting the negotiations led by commerce adviser Sk Bashiruddin may require additional diplomatic support. \nIt is worthwhile to note here that according to a Bloomberg report, India, which is also holding tariff talks with the USA might win a below 20 per cent reduction in the proposed tariff, which will be lower than what Vietnam has secured (20 per cent tariff) from the USA. In that case, Bangladesh risks losing its competitive edge vis-a-vis its regional competitors.\nUnless the tariff is reduced, or the RoO is relaxed, the high US tariffs on Bangladesh-origin RMG products will make those very expensive leading US retailers to look for alternative sources like India or Pakistan whose products would be cheaper due lower rate of US tariff imposed on them. According to industry insiders, some importers of our RMG products in the USA, have already put their purchase orders on hold. Suppliers to the Walmart, too, are learnt to have suspended some orders from Bangladeshi manufacturers. These are definitely not a good omen for Bangladesh's exports to the US market. Meanwhile, some quarters including the international media have been portraying a bleak future for Bangladesh's RMG sector. There are also reports of how the garment workers are now in fear of losing their jobs. \nNo doubt US market is important for Bangladesh. But that is not the end of the world. \nIn the circumstances, Bangladesh should continue its tariff negotiations with the USA. At the same time, the search should be on to look for alternative markets for Bangladesh's RMG exports. It is also time the country intensified its efforts to further widen and diversify its export basket.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "US tariff challenge and BD's exports",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/us-tariff-challenge-and-bds-exports-1752509230",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 15, 2025 00:00:00  \n\nAs I sat in my afternoon neurochemistry class, comfortably drowsy after a satisfying lunch, my professor mentioned something that instantly snapped me back to attention: neuroplasticity. The incredible ability of humans to adapt and learn from the environment stems from the brain's neuroplasticity. Jerzy Konoski first used the term \"neural plasticity\"; he was a Polish neurophysiologist who added to the work of Ivan Pavlov and successfully discovered secondary reflexes and operant conditioning. Imagine him as a detective of the brain, building on Ivan Pavlov's famous dog experiments.\nBut wait-neuroplasticity's story goes way back! In 1793, Italian anatomist Michele Vincenzo Malacarne was playing the ultimate animal trainer. He takes pairs of animals, trains one intensely for years, and then dissects them (yes, it gets a bit grim) to compare their brains. The result? The trained animals had bigger cerebellums like a muscle growing after a workout!\nFast forward to today and scientists have discovered something even better: your brain isn't done changing after childhood. Those clever neurons keep adapting well into your 20s and 30s. Think of your pre-frontal cortex, the CEO of decision-making, emotions, and personality as a late bloomer, finally maturing around your mid-20s, around the time you get your wisdom teeth. \nUse this amazing ability of your brain to your favour, learn a new skill, or break a bad habit, give yourself a pat on the back, your brain is literally reshaping itself!\nSyeda Aida Mowla\nStudent\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "The brain shifters",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/the-brain-shifters-1752509252",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-07-2025"
    }
]