[
    {
        "full_article": "Marked by controversy, Afghanistan’s Acting Foreign Minister Amir Khan Muttaqi’s ongoing visit to India was meant to signal a major reset in ties between New Delhi and the Taliban. The visit was his first since the Taliban grabbed power in 2021, as was his meeting with External Affairs Minister S. Jaishankar and National Security Adviser Ajit Doval. It was made possible by the UN Security Council’s Sanctions committee that waived the travel ban on Mr. Muttaqi, who is on the list of sanctioned terrorists since 2001. New Delhi has strategic reasons for the warm welcome and enhanced relationship. Close ties neutralise the considerable security risk and terror threat from India’s western flank, and protect India’s personnel and considerable investment in projects there. The deterioration in Afghan-Pakistan ties indicates that the Taliban, as an “enemy’s enemy”, could prove a valuable ally. Given that the Taliban now control nearly all of Afghanistan, it would seem pragmatic to engage with them at the level other regional powers including Russia, China, Pakistan, Iran and the Central Asian states do. India has announced that it would upgrade the Indian Embassy in Kabul, a “technical mission” thus far, and that both sides will exchange diplomats. This takes India a step closer to recognising the Taliban government, something only Russia has done. India also announced initiatives to build hospitals, provide humanitarian assistance and enhance trade levels. Significantly, both sides “emphasized respect for each other’s sovereignty and territorial integrity” — indicating that neither side accepts Pakistan’s territorial claims. Mr. Muttaqi also affirmed that the Afghan government will not allow its territory to be used against India, a considerable shift from 2001-21 when Taliban forces targeted India’s missions and infrastructure projects.While the text of the joint statement was substantive, the headlines of the visit have been overshadowed by several missteps and poorly structured optics. The press conference at the Afghan Embassy, and the attempt to raise the flag of the Islamic Emirate of Afghanistan was one. It also emerged that no women journalists had been invited, leading to outrage. Two days later, Mr. Muttaqi held another, all-inclusive press conference. The government, which distanced itself from the event, missed an opportunity to express its stand on the wider question of the Taliban’s ban on women’s education and employment, lack of an inclusive political process, treatment of minorities and past attacks by the group. While engaging the Taliban is no doubt important, and vital, for regional security, India must clarify how far it plans to go down the road of appeasing the group, and risking its reputation, towards that end. Published - October 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India-Afghanistan\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        minority group\n                    \n                            /                      \n                        \n                        diplomacy",
        "headline_1": "​Talking to Taliban: On India-Afghanistan ties",
        "headline_2": "India must be wary of terror groups, even if they are in power",
        "link": "https://www.thehindu.com/opinion/editorial/talking-to-taliban-on-india-afghanistan-ties/article70159216.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "Fresh impetus for the Sawalkote Hydroelectric Project, planned as a 1.8-GW scheme on the Chenab, coincides with India’s unilateral suspension of the Indus Waters Treaty (IWT) after the Pahalgam attack, giving it a geopolitical symbolism that risks overshadowing questions relating to the environmental impact. The Union Ministries of Power and Home Affairs have repeatedly stressed its strategic value to press for exemptions from impact and carrying capacity studies. But other factors cannot be wished away with a wand. The Chenab already hosts the Dulhasti, Baglihar, and Salal projects, in a “bumper-to-bumper” hydropower corridor. Ignoring cumulative impact here means underestimating compounded sediment loads and slope instability. The gravity dam proposed at Sawalkote, despite being described as run-of-river, will form a reservoir of over 50,000 crore litres, rendering it functionally closer to a storage dam. Its estimated cost has risen by ₹9,000 crore due to inflation and prolonged administrative uncertainty. The NHPC Limited’s recent record in comparable Himalayan projects shows many schedule slippages and cost overruns. Finally, rehabilitation costs account for just 0.6% of total expenditure whereas nearly 1,500 families will have to be resettled and 847 hectares of forests will have to be diverted.In strategic terms, the project’s timing signals India’s intent to operationalise its entitlement over western rivers following the IWT’s suspension. Keeping the treaty in abeyance also removed procedural constraints, allowing projects such as Sawalkote and the Wullar Barrage to go ahead. However, this approach risks diminishing India’s credibility as a riparian state that abides by treaties, particularly in fora where it advocates rule-based transboundary governance. Pakistan has already challenged the suspension’s legality vis-à-vis the 1960 framework. Should India proceed with multiple large projects without cooperative mechanisms, future negotiations may potentially invite third-party scrutiny — precisely what it has long resisted. In any case, strategic assertion should come with ecological restraint, and would require regional studies and protocols to manage sediments for all future projects, regardless of treaty status. India should also institutionalise data transparency through regional or multilateral platforms, converting hydrological monitoring from a security risk into a confidence-building measure, which would also align strategic autonomy with stewardship. Sawalkote’s legacy will ultimately depend on whether India realises that national security and ecological responsibility reinforce each other.\r Published - October 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Indus Waters Treaty\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        energy and resource\n                    \n                            /                      \n                        \n                        environmental issues\n                    \n                            /                      \n                        \n                        national security",
        "headline_1": "​Testing governance: On the Sawalkote Hydroelectric Project",
        "headline_2": "National security and ecological responsibility reinforce each other",
        "link": "https://www.thehindu.com/opinion/editorial/testing-governance-on-the-sawalkote-hydroelectric-project/article70159179.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "These respond to Pavlovian conditioning, until they don’t \nThe local Resident’s Association has chosen to give me a Lifetime Achievement Award, I announced proudly to Kamala. She was less than impressed. ‘You’ve walked around reminding them that you are a good candidate for the Prize and listing your imaginary achievements for one year now. They were left with no other option!’ she said disdainfully. \nIt’s the trend nowadays, Kamala. If you feel you deserve an award you must announce it yourself – and corner the committee into giving you the blessed thing. Actually, it’s a scientific fact proved by an experiment conducted by a Russian scientist called Pavlov. His famous Pavlovian studies were on conditioning dogs by associating food with the sound of a bell. He found that the dogs salivated when they heard the bell, even if there was no food in the vicinity. Some celebrities demonstrate the same reaction every time they hear the word Nobel, even if nobody takes them seriously.\nSome of them are more deserving of another award, aptly named the Ig Nobel. This is a satirical prize that aims to first make people laugh – and then think. ‘A lot of stand-up comics would be good candidates for that award,’ Kamala suggested wryly. Winners have included real scientists who did research on the possibility that black holes fulfil all the technical requirements for being the location of Hell. And those who studied the ‘five-second rule’, a tongue-in-cheek belief that food dropped on the floor will not become contaminated if it is picked up within five seconds. There are awards for everything. From the Filmfare Awards for movies to the Nobel Prize for Physics or Peace. And yet, some celebrities come away disappointed every year. They find themselves on the list for whom no bells toll. \nKamala was worried about our neighbour Donne Thimappa who felt he deserved the award more than me because he had broken up several fights between neighbours in the area. Who was going to bell the cat and let him know that he was not getting the Prize this year? I offered to be the one, promising to mention him in my acceptance speech and to dedicate the award to him, with the noble intention of maintaining peace in the neighbourhood. Now I’m not surprised if that rings a bell – because similar trumped-up stories have been in the news recently.\n\n",
        "headline_1": "Nobel Intentions",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/nobel-intentions/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "Another Diwali, another round of litigating how to do it right, and maybe only rain can help\nDiwali déjà vu is nice. We are looking forward to the lights and festivities. And Diwali déjà vu is maddening. In NCR and many other of the country’s urban centres, a large constituency of unwell citizens and those with children and pets who are scared by firecrackers or find breathing hard in smoke’s wake, are dreading the onset of bad air. The apex court itself has been deeply engaged in this conversation for a decade, as have several govt bodies, civic organisations, business lobbies etc. But here we are yet again, relitigating the same issues all over again, just as we did last year and the year before that.\nDoesn’t the NCR ban on firecrackers hurt the spirit of Diwali? Shouldn’t green firecrackers at least be permitted? But is there any such thing as a firecracker that’s green? Isn’t it a false impression being created that these are environmentally safe? But where is the data showing that it’s the firecrackers that cause the bulk of Diwali pollution? Round and round we go, as if determined to make no progress whatsoever.\nIf the stop, start, kneejerk measures are helping, we are not doing any proper measuring of it. When GRAP restrictions delayed the recarpeting of a Delhi runway last year, we didn’t tally the emissions of the thousands of waiting and hovering aircraft. BJP to AAP, the past years have seen different political parties pass the buck, without wholehearted focus on finding a way out. If NCR is set on a green firecrackers path this Diwali, it will be with the full foreknowledge that all kinds of pollution will fly through this net. Testing infra is absurdly inadequate to cover all the points of sale.\nThe consensus that’s been missing so far is not going to drop down from the smog tomorrow either. Public policy expert Michael Munger underlines how the adoption of the US constitution itself defied preexisting rules for consensus, and how lucky this was for America. He sees the role of constitutions as enabling politics, which in turn is a process of deciding on rules, such that even the losers accept as legitimate. When the tree-lined Cheonggyecheon was brought back to life in central Seoul, it meant fighting back disagreements as much as a vast elevated highway. But it’s a vision that’s paid back South Korea a million-fold. Restoring India’s rivers, forests, air and soil to health will certainly not be cost-free. But just as certain is that the costs of failing will be nightmarishly higher.\n\n",
        "headline_1": "Green, Hot Air",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/257425/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "Patchy connections let down India’s internet cover. Making govt payouts dependent fully on e-KYC warrants a rethink\nAdoption of tech has made governance smoother and more efficient. But direct cash transfers aren’t the magic bullet promised – to a great extent because the state has replaced a direct interface with beneficiaries with electronic KYC: ‘identity markers’ on a computer screen. And the onus of ensuring these ‘identity markers’ are updated on govt portals is entirely on beneficiaries. Who, in turn, are dependent on availability of internet that remains inconsistent across rural India. Every e-KYC season, it’s a scramble to locate a steady internet connection with reasonable speed for sufficient time.\nTherefore, as TOI reported, that in a Maharashtra village, of 100 women attempting to update details to avail a women’s payout, just 5 received an OTP is not surprising. They walked 30 minutes to a point known to receive internet – a phone hung from a tree branch. It would be comical if people’s earnings, livelihoods, weren’t held hostage to it. Given this reality – no secret to any branch of govt – what is shocking is state’s inflexibility, which made e-KYC mandatory without backup options. In Maharashtra, in this instance, deputy CM Ajit Pawar has said e-KYC is “non-negotiable”. Challenges with Aadhaar-linked verification are not of internet availability only. But that poor internet coverage can stall beneficiaries from claiming their due highlights how tricky total surrender to tech can become.\nIt is not about unreliable internet alone either. India leads in internet shutdowns – Sept alone saw shutdowns in Haryana (teacher’s death), UP (Bareilly), Leh (Sonam Wangchuk’s arrest), and in Oct in Cuttack (Durga puja immersion), while J&K continues to lead with maximum shutdowns, internet almost always blocked in some or the other district. It’s like having piped water without water supply. Or power connections without electricity. Govts really have to ensure digital exclusion doesn’t reverse strides made in financial inclusion – physical verification must not be binned altogether.\n\n",
        "headline_1": "Buffer Against Buffering",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/buffer-against-buffering/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "Trump appears to be open to fixing ties with New Delhi. GOI did well by holding strong\nIt’s still early days, but US ambassador-designate Gor’s meeting with Modi over the weekend signalled the possibility of a thaw in bilateral ties. It’s rare for PM to meet an ambassador before the person has actually assumed office. Gor also came bearing the message of strengthening India-US partnership, particularly in critical minerals, the supply of which China is again looking to squeeze. Modi had also praised Trump’s Gaza Peace Plan last week. All of this may suggest that a trade deal between the two countries – the main bone of contention – is close. \nTrue, given Trump’s mercurial nature, he is capable of changing his mind any time. However, there are also reasons to believe that Washington now realises that New Delhi is not going to buckle under the pressure of tariffs. After all, India is in the right here. It was willing to negotiate on all trade matters, including working towards a consensus on import of Russian oil – which the previous Biden administration had asked to buy. The additional 25% tariff for importing Russian oil was totally just Trumpian pique. India also played it smart by messaging a show of force with other Brics members. Hence, if all of this was meant to be Trump-style pressure negotiations, it possibly did not work much. \nSecond, now that the award of the Nobel Peace Prize has passed, Trump might start listening to some of his more rational advisers. It’s because he was so obsessed with the prize, pushing claims about stopping seven wars, including, ridiculously, the India-Pakistan conflict in May, that Trump took umbrage at New Delhi’s vehement denial of his involvement in the summer ceasefire. This made him inclined to listen to tariff hawks like Peter Navarro and Howard Lutnick. But now that things have settled down on the Nobel front, Trump may be more open to listening to steadier voices like Marco Rubio. \nAt the end of the day, India and US both benefit from a productive relationship. Our long-term strategic visions for a stable, rules-based international order align. That can’t really be said of the India-China relationship where the Chinese Communist Party wants to dominate Asia in the long run. India did well to hold its ground vis-à-vis US. It showed it can’t be bullied. Trump White House would do well to get its India policy back on track and pick up things from where they were left off in Feb during Modi’s visit to Washington. Gor seems to have taken tentative steps in that direction. \n\n",
        "headline_1": "Loosening Gordian Knot",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/loosening-gordian-knot/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 14, 2025 00:00:00  \nWhen competition is a key to staying in business, Bangladesh is in a dire need for exploring all the avenues for enhancing its competitive edge as much as possible. The scenario following graduation from the Least Developed Countries (LDC) makes it further incumbent on this country to go whole hog in order to adapt with the withdrawal of the duty-free access of Bangladesh products to the European Union (EU), the United Kingdom (UK). Both Free Trade Agreement (FTA) and the Preferential Trade Agreement are likely to come to an end after 2029. Aware of this, the National Board of Revenue has decided to waive value-added tax (VAT) on raw materials and services procured by exporters from local sources. However, the NBR did not do it on its own. Industry associations and exporters have long been demanding the concession. Exporters will have to meet certain compliant requirements such as making transactions in foreign currencies and ensuring the delivery is properly documented in the Utilisation Declaration (UD) or Utilisation Permission (UP). \nClearly, the arrangement is yet to meet the business people's demand. If the bonded warehouse users enjoy duty-free import concession, why should manufacturers and exporters sourcing domestic raw materials and services will have to meet complicated and at times costly requirements before qualifying for the proposed privilege? The president of the Bangladesh Knitwear Manufacturers Exporters Association (BKMEA) has cited the problem with the bonded-warehouse provision. Obtaining a bonded-warehouse licence is highly costly beyond the means of smaller firms. He argues rightly that the rules were made four decades ago when the country relied mostly on imported raw materials and services. \nThe firms that source their raw materials from local suppliers should be encouraged further by granting more concessions. They are not only using the local materials but also helping develop the domestic backward-linkage factories and productive units. The greater the supply of raw materials from local sources is, the stronger the domestic manufacturing base. This is a precondition for maintaining production costs low and staying competitive in international market. Well, documentation of procurement sources can be verified by means other than the conditions set for the purpose. For example, the suppliers' and procurers' inventories can be checked if those match or not. \nThe system should be made as simple as possible to encourage growth of smaller firms that produce raw materials for manufacturers and exporters. At no point should the importers of raw materials be favoured leaving the domestic backward linkage industry to unfavourable terms and conditions. The country needs a strong manufacturing base and the backward linkage industry in certain areas are capable of fully meeting the needs of bigger and exporting units. If the purpose is to diversify export goods and boost those of the existing manufacturers, reliance on imported raw materials has to be gradually phased out in favour of production and procurement of such goods. The government must pursue a policy of encouraging the backward linkage industry to develop into a self-sufficient manufacturing infrastructure. A small country with a large population must get its priority right. Labour is cheap here and unemployment a huge problem. Small and medium enterprises through their integration into the backward linkage chain can absorb a large number of the unemployed.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "VAT waiver on local procurement",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/vat-waiver-on-local-procurement-1760367025",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       October 14, 2025 00:00:00  \nEvery year, thousands of Bangladeshis risk their lives crossing the Mediterranean Sea, driven by the hope of higher earning opportunities in Europe. For many, that dream ends in tragedy. Their overcrowded boats capsize; some names could be known and some remain unknown. The latter vanish into statistics. \nAccording to the UN refugee agency (UNHCR), between January and August 2025, a staggering number of 13,148 Bangladeshis crossed the Mediterranean to reach Italy irregularly, accounting for 30.8 percent of all sea arrivals. This puts Bangladeshis at the very top of the list of those entering Italy through irregular routes -- a grim distinction that has persisted for years.\nThis backdrop gives new significance to Chief Adviser Professor Muhammad Yunus's visit to Italy this week. Officially, he is attending the World Food Forum in Rome, where he will deliver a keynote address on October 13. But behind the ceremonial appearances lies an urgent political and humanitarian agenda. Both Bangladesh and Italy have been engaged in talks to curb irregular migration and expand regulated labour migration. Yunus's visit could provide a critical opportunity to give that dialogue new momentum.\nItaly's migration challenge is as much a domestic political issue as it is a humanitarian one. For Bangladesh, however, it is also a matter of national reputation and social stability. The exodus of young Bangladeshis -- often facilitated by human traffickers -- reveals deep-rooted problems: unemployment, limited access to decent work, and the lure of risky migration routes promoted by unscrupulous recruiters.\nBangladeshis while trying to land in a European country typically take a long, dangerous journey. Many travel first to Libya or Tunisia via irregular intermediaries. There they are trapped in detention camps, forced labour, or subjected to extortion before attempting the final and most dangerous leg across the Mediterranean. Some survive; many do not.\nFor Italy's right-wing government, led by Prime Minister Giorgia Meloni, controlling these arrivals has become a political imperative. Her administration has pledged to clamp down on irregular migration, arguing that uncontrolled flows strain public services and fuel social tensions. For Bangladesh, the issue is different but equally pressing. Irregular migration undermines the country's labour export reputation and exposes citizens to exploitation. It also deprives the economy of potential remittances that could have come from regulated, productive employment abroad.\nMeloni was scheduled to visit Dhaka on August 30 to discuss migration and labour cooperation, but her trip was cancelled. Now, with Yunus in Rome, the focus shifts to whether the two leaders can meet again to push the agenda forward.\nDuring their last meeting in New York on the sidelines of the UN General Assembly on September 25, migration dominated the discussion. Both leaders discussed ways to combat human trafficking and agreed on the need for closer cooperation in repatriating irregular migrants. They also explored opportunities to support legal migration by developing vocational training programmes in Bangladesh that align with Italy's labour market needs.\nFor Rome, the idea makes practical sense. Italy faces labour shortages in several sectors -- construction, agriculture, caregiving, and manufacturing among them. Bangladesh, with its large, young workforce, could supply skilled labour through proper channels. For Dhaka, such collaboration would create safer migration pathways and help address unemployment pressures at home.\nA senior official at Bangladesh's Ministry of Foreign Affairs confirmed that migration will be \"a key agenda item\" in Yunus's meetings with Italian officials. \"Visa issues may also come up, along with discussions on trade and defence cooperation,\" the official said.\nThe discussions may also revive Meloni's earlier proposal to establish a Bangladesh-Italy Trade Forum, designed to enhance bilateral investment and business ties. According to officials, there is a possibility that Meloni may visit Bangladesh in December, depending on political developments in both countries.\nIn May, Bangladesh and Italy signed a memorandum of understanding (MoU) aimed at curbing irregular migration and promoting legal labour mobility. While this agreement was hailed as a step forward, tangible results have been slow to emerge. Yunus's visit could provide the political impetus needed to operationalise it.\nThe MoU envisions a system where Bangladeshi workers would be trained domestically and deployed to Italy through approved recruitment channels, thereby reducing dependence on middlemen. It also commits both sides to share information on traffickers and improve coordination on migrant repatriation.\nBut implementing such agreements requires more than signatures. Bangladesh's recruitment sector remains plagued by corruption and weak oversight. Unlicensed brokers often lure jobseekers with false promises, charging exorbitant fees. Unless the government strengthens regulation and digitalises recruitment processes, the MoU risks being undermined by the same networks that profit from irregular migration.\nItaly's domestic debate on migration often focuses on border control and deportation, but that narrative ignores the underlying human dimension. Most Bangladeshi migrants are not criminals -- they are workers seeking dignity and opportunity. Many come from rural districts where jobs are scarce and wages too low to sustain families. Their decision to leave is not driven by greed but by desperation.\nBangladesh's challenge is therefore not only to prevent irregular migration but also to create hope at home. Expanding technical education, investing in small industries, and providing access to safe overseas employment could all reduce the desperation that drives people into smugglers' hands.\nWhile irregular migration dominates headlines, legal migration is also under strain. Thousands of Bangladeshis who travelled to Italy with valid visas in recent years are now caught in administrative delays. Many have been unable to renew residence permits, while others face expiring documentation that could push them into irregular status.\nMeanwhile, those applying for new visas face long waiting times due to a backlog of applications. \nThese delays not only harm individuals but also undermine confidence in legal migration systems. Without reliable and transparent procedures, more people will be tempted to take illegal routes -- a vicious cycle both governments must break.\nThe Yunus administration has an opportunity to redefine Bangladesh's migration diplomacy. By combining Yunus's global standing as a Nobel laureate and social entrepreneur with pragmatic policy reforms, Bangladesh could advocate for a more balanced migration framework -- one that prioritises both regulation and compassion.\nInstead of treating irregular migration solely as a law-and-order issue, Dhaka and Rome could frame it as part of a broader economic partnership. A joint labour mobility programme could focus on skill-building, certification, and ethical recruitment. Italy, in turn, could commit to faster visa processing and fair labour standards for Bangladeshi workers.\nSuch cooperation would not only address the migration crisis but also strengthen economic ties between the two countries. Italy is already home to one of Europe's largest Bangladeshi communities -- over 150,000 strong -- who contribute to both economies through remittances and entrepreneurship. Engaging this diaspora in policy discussions could make migration more sustainable and inclusive.\nIf Yunus's Italy visit results in renewed commitment to implement the May MoU, launch vocational training initiatives, and streamline visa processes, it could mark a turning point. A successful outcome would mean fewer deaths at sea, fewer people exploited by traffickers, and more Bangladeshis migrating legally, safely, and with dignity.\nIt would also reaffirm Bangladesh's reputation as a responsible partner in global migration governance -- a country willing to address irregular flows through cooperation, not confrontation.\nBut success will not come easily. It requires sustained political will, administrative reform, and genuine empathy for the lives at stake. Italy must look beyond deterrence; Bangladesh must look beyond remittances. Both must look toward building a system that respects human mobility as a right, not a risk.\nMigration has always been part of Bangladesh's story. The question now is whether that story can move from tragedy to transformation -- whether a journey that once began with despair might, in time, become one of dignity.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "CA's Italy Visit: Settling the migration issue",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/cas-italy-visit-settling-the-migration-issue-1760367061",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       October 14, 2025 00:00:00  \nInternational Centre for Diarrheal Disease Research, Bangladesh (icddr,b), which first started as Cholera Research Laboratory (CRL) in 1960 in Dhaka to study the microbiology of cholera, earned international fame by innovating Oral Rehydration Therapy (ORT) in mid-1960s.The findings of the first large-scale clinical trial of ORT were published in the internationally acclaimed British medical journal, the Lancet, in 1968. Based on the research, WHO later introduced the Oral Rehydration Solution (ORS) formula, a mixture of salt, sugar and clean water, in 1975 that has now become a household word in the country as it helped save millions of lives from cholera epidemic every year. Now icddr,b has come up with yet another therapeutic food that can save children who underwent long-term chronic health conditions due to severe childhood malnutrition and, to some extent, to the faulty or imperfect development of the gut microbiome in children. Gut microbiome is the collection of all microorganisms that live in the human gut or gastrointestinal tract. The therapeutic food called, Microbiota-Directed Complementary Food No.2, or MCDF-2, helps the production of a specific kind of bacteria in the gut that break down food into molecules that have links to the development of bone and brain.\nThis therapeutic food, MCDF-2, for malnourished children was born of a collaboration between Dr Tahmeed Ahmed, executive director of icddr,b and Dr Jeffry Gordon, director of the Edison Family Centre for Genome Sciences and Systems Biology at Washington University in St. Louis. Dr Tahmeed's work centred around his decades-long research on malnutrition in Bangladesh, while Dr Gordon was famous for his pioneering work on human gut microbiome. And together they developed MCDF-2, which Time magazine has listed in its Social Impact category among the 'Best Inventions of 2025'. \n\"Our decade-long research indicated the gut microbiome plays a central role in how children grow and respond to nutrition\", Dr Gordon explained, adding, \"The beneficial bacteria we identified help process vital dietary components that our bodies cannot do on their own, providing a foundation for designing foods that restore healthy growth\". \nIn this connection, Dr Gordon further informed that well-controlled clinical trials of MCDF-2 in Bangladeshi children have shown its ability to repair these children's microbiome and has effects that extend well beyond the wall of the gut- revealing how our community of trillions of gut microbes profoundly affects so many facets of human postnatal development. \nDr Tahmeed on his part said, \"It shows how science and compassion can come together to address one of the most persistent global health challenges. MCDF-2 gives us new hope that locally developed, affordable solutions can help millions of undernourished children not only to survive but to thrive.\" As could be further learnt, MCDF-2 is a mixture of roasted and ground chickpea, soybean, peanut, green banana, soybean oil and a premixed vitamin-mineral blend. These are then mixed with other components in an electric mixer to form a paste. These ingredients were selected for their ability to nourish specific beneficial gut bacteria that support healthy growth, immune function and neurodevelopment in children affected by malnutrition.\nUndernutrition remains a major threat to child survival and development worldwide and is responsible for nearly half of all under-five deaths. And this global issue has been further complicated by displacements caused by wars and natural disasters leaving millions of children at risk of stunting (low height-for-age) and wasting (low-weight-for height). Major studies are now underway with this microbiome-directed therapeutic food in India, Pakistan, Mali and Tanzania. Undeniably, the researches of Dr Jeffrey Gordon of Washington University in the USA and Dr Tahmeed Ahmed of the icddr,b of Bangladesh have shed new light on how food can now be scientifically prepared to address malnutrition among children better. Thankfully, the ingredients of that revolutionary food can be had from our local kitchen market. This is indeed good news for mothers with newborns who cannot afford expensive baby foods in the market.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "A baby formula that can heal acute malnutrition",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/a-baby-formula-that-can-heal-acute-malnutrition-1760367107",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 14, 2025 00:00:00  \n\nA child is not born a criminal. Every child is born innocent - a blank page waiting to be written upon. Family, society, school, friends, economic status, and the media all play vital roles in a child's growth. From these influences, both the good and bad qualities of a child develop. Thus, the environment is closely linked to the overall development of a child.\nA child's first medium of learning is the family. He learns by observing the good and bad behaviour of the people around him and tries to apply what he sees. Often, it is found that parents themselves are involved in various crimes or are indifferent to their children. As a result, the child becomes mentally disturbed and loses the ability to distinguish between right and wrong. Sometimes, poverty leads a child towards crime. When he is deprived of food, clothing, education, and security, committing crime may seem to him the only way out.\nIn addition, the social environment plays a major role in shaping a child's character. If a society is rife with corruption, violence, and crime, and if criminals prosper without punishment, then a child grows up believing that one can succeed even through wrongdoing.\nPeer influence also has a strong impact. Adolescence is a period of imitation. If friends are addicted to drugs, the child is likely to be influenced. Sometimes, peers say, \"Let's have some fun,\" and engage in theft or vandalism - and gradually, such acts become habitual. Children are also neglected in educational institutions at times. Teachers may impose harsh punishments without considering a child's mental state, causing the child to lose confidence. In the present era, many children become involved in crimes through social media. Exposure to violent games, arson, or car theft can arouse a desire to imitate such acts. \nLoving a child, giving time, listening, understanding their problems, and helping them are essential. If parents behave like friends, children are less likely to take the wrong path. Schools and communities should provide counselling, and education should focus not only on academics but also on morality and humanity. Increasing child-friendly content on television, cinema, and online platforms like YouTube is equally important. Moreover, rehabilitation - not punishment - should be prioritised for children prone to crime, so they can grow up mentally healthy and well.\nAkash Ahmed\nStudent of the Dept. of Law\nBangladesh University of Professionals (BUP)\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Born innocent, shaped by the world",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/born-innocent-shaped-by-the-world-1760367282",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-10-2025"
    }
]