[
    {
        "full_article": "The Supreme Court of India’s September 1, 2025 order on Bihar’s Special Intensive Revision (SIR) exercise offers a crucial lifeline to voters who found themselves wrongfully excluded from the draft electoral rolls. The Court’s ruling and the Election Commission of India’s (ECI) clarification that claims and objections can continue to be filed even after the deadline, represent a welcome move in an exercise that has raised questions about transparency and fairness. The ECI has confirmed that applications submitted after September 1, 2025 will be considered after the electoral roll is finalised, with the process continuing until the last date for filing of nominations. This ensures that inclusions and exclusions can be integrated into the final roll, providing excluded voters with a meaningful opportunity for redress through their Aadhaar card. However, the ECI’s numbers raise a curious question. While over 15 lakh new voters registered using Form 6, only around 33,000 claims were filed for re-inclusion of the approximately 65 lakh excluded names. This large difference becomes even more concerning when one considers that both categories use Form 6, potentially leading to conflation in the data presented to the Court. This data confusion feeds into a broader dispute between the ECI and political parties. While the ECI claims, using its daily data reports, that parties failed to assist excluded voters, parties contend that they did raise claims, but these were not properly processed by Block Level Officers.Recognising these challenges, the Court has wisely directed that the Bihar State Legal Services Authority use para-legal volunteers to assist voters and political parties. The Court’s intervention appears to reflect concerns that mirror data-driven investigations, including by The Hindu, which have identified unusual patterns in the exclusion lists, pointing to anomalies. Ground reports further validate these findings, underscoring the need for robust corrective measures. The onus is on political parties to rise above narrow self-interest and actively assist genuinely excluded voters. The democratic process demands such civic responsibility from all stakeholders. For the next steps, the ECI must recognise Aadhaar as a valid standalone document to prevent unfair exclusions among the 99.5% of those in the draft roll who have already submitted documentation and the rest. Given that Aadhaar serves as sufficient proof for the excluded to file claims, it should logically suffice for those already on the draft roll. The Bihar SIR experience offers lessons for future electoral roll revisions. The ECI must abandon its technocratic, short deadline-driven approach in favour of intensive revisions spread over longer periods, allowing thorough door-to-door verification. A clean electoral roll cannot be achieved through hurried exercises that prioritise administrative convenience over voter rights.READ MORE Published - September 02, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        Aadhaar",
        "headline_1": "Another chance: On Bihar’s Special Intensive Revision exercise and the Supreme Court order",
        "headline_2": "Allowing objections beyond deadline may help wrongly excluded voters",
        "link": "https://www.thehindu.com/opinion/editorial/another-chance-on-court-order-bihars-special-intensive-revision-exercise/article70000707.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "The GDP growth numbers released on Friday (August 29, 2025), showing that growth in Q1 of this financial year stood at 7.8%, came as a pleasant surprise at a time when most of the commentary has been about the factors holding growth back. For instance, even the Reserve Bank of India, as recently as August 6, 2025, had predicted that growth would be at 6.5% in Q1. It was off by a significant 1.3 percentage points less than a month before the data came out, something it must introspect about. Within the data, the strong manufacturing sector growth, of 7.7%, was especially heartening given that it came on a relatively high base of 7.6% in Q1 of last year. Some commentators have said that this is because companies were ramping up production and exports ahead of the August tariff deadline by the U.S. However, given that merchandise exports grew just 1.6% in Q1, the more likely reason is that companies were catering to domestic demand. However, the numbers released by the government do not provide much clarity here. The manufacturing sector, as measured by the Index of Industrial Production, grew at 3.3% in Q1, slower than the 4.3% seen in Q1 last year. Steel consumption was drastically slower in Q1 this year than last year. Both private and commercial vehicle sales actually contracted 5.4% and 0.6%, respectively, in Q1. Railway freight traffic grew by 2.5% versus 5% last year, while air freight grew at 5.4% compared to 13.9% last year. Two-wheeler vehicle sales contracted 6.2% while three-wheeler sales were flat at 0.1% growth. Diverse data show that the core and consumer sectors were slowing, and so the pickup in the manufacturing sector is worth a deep examination. The strong performance by the services sector is welcome, and shows how dependent the Indian economy is on this sector.Chief Economic Adviser V. Anantha Nageswaran has said that the government was retaining its 6.3%-6.8% growth prediction for the year. This means that, with 7.8% in Q1, the government expects growth to significantly slow down in the remaining three quarters, despite its statements about the limited impact of the U.S. tariffs. The data also call into question the robustness of the statistical system, since a nominal GDP growth of 8.8% assumes that inflation was just 1% in Q1. Clearly, price levels are not being captured adequately. A relatively low nominal growth rate also makes it more challenging for the government to meet its fiscal deficit targets, especially at a time when it expects a revenue hit due to the upcoming GST rate cuts. Overall, the GDP numbers have brought cheer, but also several questions.READ MORE Published - September 02, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        iron and steel\n                    \n                            /                      \n                        \n                        automobile\n                    \n                            /                      \n                        \n                        consumer goods\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        taxes and duties",
        "headline_1": "​Questionable cheer: On GDP growth numbers",
        "headline_2": "The government might find it difficult to meet its fiscal deficit targets",
        "link": "https://www.thehindu.com/opinion/editorial/questionable-cheer-on-gdp-growth-numbers/article70000359.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "India is trying to balance its friendships with big powers like the US and Russia. Recently, at a big meeting in Tianjin, Prime Minister Modi was seen warmly meeting Russian President Putin, even riding in his Russian-made car. This showed clearly: India isn’t planning to stop buying Russian oil anytime soon. In fact, India might even buy more.\nBut why is this important? The US, under Trump, has been punishing India with very high tariffs (extra taxes) because India continues to buy oil from Russia. The idea was that these tariffs would push India away from Russia. But that hasn’t worked. India says it needs affordable oil to keep prices steady at home.\nIndia has also told Russia it wants the war in Ukraine to end. Modi has said, “This is not an era of war.” Still, India can’t suddenly stop dealing with Russia. Russia has been India’s partner since 1947, helping with defence and energy. Even when India’s ties with the US got stronger, India stayed careful, because America can change its policies suddenly.\nAs Defence Minister Rajnath Singh explained, in global politics there are no “permanent friends or enemies—only permanent interests.” That means countries look after their own needs first.\nAt this summit, India not only strengthened ties with Russia but also improved relations with China and got support after a terror attack in Pahalgam. The US may now realise it has made a mistake by putting too much pressure on India. A friendly tweet from the US embassy suggests America might soften its stand.\nFor India, the rule is simple: be open to friendship, but don’t get pushed around.\n\n",
        "headline_1": "Why India Still Buys Oil from Russia",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/why-india-still-buys-oil-from-russia/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "India’s right to waltz with Russia. It’ll be receptive to a US pivot as well, should Trump see sense\nAmerica is habitually slow to acknowledge miscalculations – Vietnam, Afghanistan – but visuals of Modi-Putin camaraderie at the Tianjin SCO summit should make Trump rethink strategy. His 50% cumulative tariff clearly isn’t weaning India off Russian oil. Modi firmly holding Putin’s hand, and riding in his Russian-made Aurus limo to their bilateral, was defiance expressed in giant semaphore. Besides, indications are India is about to buy 10-20% more Russian oil this month as Ukrainian strikes have temporarily disabled some Russian refining capacity.\nIndia wants to end the war in Ukraine as much as Trump. Modi has told Putin more than once that this is not an era of war. As for buying Russian oil, it was a policy shift urged by the Biden administration to prevent an oil shock followed by an inflationary spiral. If three years of sanctions and military support to Ukraine have not ground Putin’s war machine to a halt, it is a failure of US and Nato policies. Therefore, Trump scapegoating India with punitive tariffs is the height of cynicism and hypocrisy.\nIt is also diplomatic folly. India’s formal ties with Russia go back to 1947, and Russia has stood by India all these years. The relationship was tested as US-India ties improved this century, but Trump’s first term made India cautious. His tariff pressure over Iranian oil and Russian weapons in 2018 pushed India closer to Russia again. And now, a reenactment of history within seven years has made India wary. As defence minister Rajnath Singh said on Saturday: “There are no permanent friends or enemies, only permanent interests.” In a multipolar world, where US can’t be counted upon, and any reset with China will have to be carefully calibrated, India simply can’t snap ties with Russia.\nThe SCO summit has been fruitful for India. It reinforced ties with Russia, formalised the thaw with China, and obtained a condemnation of the Pahalgam attack that led to Op Sindoor. Perhaps, US has realised its error. US embassy’s “friendly” tweet yesterday might signal a course correction, and India should be receptive to conciliatory gestures. But it mustn’t get arm-twisted.\n\n",
        "headline_1": "Oil Together Now",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/oil-together-now/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "Playing off burgers, sushi and dragon rolls\nFor 25 years of our marriage, Kamala and I have had a date night every weekend. This time, Kamala decided we needed to be more adventurous with our food choices: “You’re so predictable! It’s always the same boring masala dosa or papdi-chaat. Let’s try something different for a change.” Never one to refuse a challenge, I tentatively suggested a burger or a pizza. Kamala was not impressed. “We are going fully swadeshi now – no American food, remember,” she chided, reminding me of her Gandhian protest against Trump’s tariffs. I then suggested a butter naan and kadhai paneer from a Delhi style dhabha a few miles away. Madam grimaced: “First they try imposing Hindi on us, and now you want to make that food our staple diet!”\nIf I had to eat food according to the political flavour of the season, I was willing to play that game. I proposed sushi. We haven’t had that for a while and Japan is in the news nowadays and I felt certain that the latest political visit would have made Japan rise to the top of Kamala’s list of favourites. Not so simple it would seem. She glared at me like I had no ikigai: “Seriously – the things you say! Sheee! Sushi smells as fishy as some of the names on the Bihar voters list. And it’s basically rice in little compact bundles. You might as well eat bisi bele bhath at home.”\nKamala was obviously not accepting me wabi-sabi, with all my wonderful imperfections, so I said in my most conciliatory tone that she should choose and whatever she chose would be ok with me. I wanted to diplomatically repair relationships that mattered. To my utter surprise she chose Chinese – a cuisine she has always criticised as too spicy and not good for gut health, claiming that she suffers from Chinese Restaurant syndrome because of the MSG added to most hotel Chinese food.\n“Yes, Chinese please! I love Chinese. We must evolve and change our likes according to the prevailing situation. Right now, Chinese is my favourite,” said Kamala and proceeded to relish a plate of dragon rolls. We also ordered American chop suey with a glass of vodka, never addressing the elephant in the room. This was a diplomatic dinner to mend marital ennui and now I’m going to check my fortune cookie to see what we are eating next week.\n\n",
        "headline_1": "Spicy diplomacy",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/spicy-diplomacy/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "For four days, Mumbai has been almost frozen. Why? Because a huge protest, led by activist Jarange Patil, has taken over parts of the city.\nThe Bombay High Court (HC) has now stepped in. It said protesters must leave public spaces and that no more new groups should enter the city. But people are still waiting to see if the government will act on this.\nOriginally, the government only allowed about 5,000 people to gather for one day at Azad Maidan. Instead, over 30,000 came with hundreds of vehicles, set up camps, and blocked streets. Patil has said he and his followers won’t leave until their demands for a Maratha quota are met.\nBecause of this, daily life in Mumbai has been turned upside down. Commuters, workers, journalists—even women traveling alone—have faced big problems. Streets that usually carry cars and buses are now hosting games of kabaddi, makeshift camps, and even bathing and toilet activities. Many people feel their city is being held “hostage.”\nThe bigger issue is this: anyone has the right to come into Mumbai. But no group should be allowed to bring the entire city to a standstill. Yet, the Maharashtra government has done very little so far.\nYes, the quota issue is complicated. But ignoring the problem has left Mumbai stuck, even during its Ganpati festival. Now, Mumbaikars are asking a simple question: When will their city return to normal life?\n\n",
        "headline_1": "Mumbai Stuck Again",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/mumbai-stuck-again/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 02, 2025 00:00:00  \n\"Healthcare is a human right\" as articulated in the World Health Organisation (WHO) constitution and Article 12 of the International Covenant on Economic, Social and Cultural Rights (ICESCR). The WHO preamble defines 'health as a state of complete physical, mental and social well-being, not merely the absence of disease'. Admittedly, it is highly challenging to attain this standard of human health anywhere, only more so in poorer countries like Bangladesh. On this count, this country has only exacerbated its healthcare system for multifarious reasons, chief among those being the policy failures and the endemic corruption and inaction of the regulatory health service authority. The country has developed moderately extensive healthcare infrastructure even up to the bottom tier of rural areas. But the conditions of the majority of those including some upazila health complexes are unfortunately deplorable. Had those been run by trained and required staff and integrated into a well-coordinated national healthcare system, patients barring critical ones would not need to rush to cities, face hassles and incur unnecessary expenditures.\nThe systemic weakness thus reportedly forces patients to bear as high as 74 per cent out of pocket (OOP) expenses of medical costs on an average, reportedly highest in the world. This was slightly lower in 2022 and 2023 ranging between 67 and 69 per cent, according to different studies. Notably, different countries use different metrics to measure the expenditure. But one study concludes that OOP ranges from 20 per cent to 60 per cent in lower middle-income countries while in developed countries it is estimated to be between 15 per cent and 25 per cent. Cuba, not a rich country, presents a unique and refreshing picture of healthcare management. In 2021, its OOP was 8.39 per cent--- showing a declining trend, with the country spending 14 per cent of its GDP, highest in the region, on public health. Evidently, it is the political will to give priority to public health that determines the state of a nation's healthcare system. \nBangladesh's political system is not like that of Cuba but even under the current arrangement, the people can receive timely and better medical treatment. True, this is an overpopulous country and the challenge is even greater to provide for quality medical services. The government hospitals are under stress because of the crowding of patients far beyond their capacities. This excessive pressure could be lessened quite significantly if the community hospitals in villages and health complexes were developed not only to deliver initial medical care through proper diagnosis but those also arranged camps in order to make villagers aware of the preventive aspects of health and hygiene. Even the related textbooks do not have lessons on how students can maintain personal health and environmental hygiene. \nLast but not least, private health facilities have been commercialised far too much. Unless the public-private cooperation is achieved at a reasonable level and the management of private hospitals, clinics and diagnostic centres are made convinced of the need for reining in their outrageous profit motive, healthcare cannot be available, accessible and acceptable to the general public. In a way, the majority of physicians have also sold their souls to a new breed of hospital managements who could not care less for humanitarian services. The yawning mistrust compels patients who can afford to seek medical treatment abroad but the poor are left in the lurch.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Nation’s healthcare in a shambles",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/nations-healthcare-in-a-shambles-1756743324",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       September 02, 2025 00:00:00  \n\nThe recent visit of Indian Prime Minister Narendra Modi to Beijing is more than a bilateral engagement between Asia's two largest powers; it is a potential game changer for the South Asian region and for global geopolitics. For decades, the relationship between India and China has oscillated between uneasy coexistence and overt hostility. The shadow of the 1962 war and the bloody skirmishes that flared up even in recent years at the Line of Actual Control (LAC) long defined their rivalry. Direct air links were cut off, trade slowed down, and Chinese companies were increasingly pushed out of Indian infrastructure projects. Suspicion had hardened into hostility, and hostility into a wider geopolitical fault line that reverberated across South Asia.\nYet, Modi's Beijing visit appears to have opened a door that many thought permanently shut. The thaw is not simply a bilateral necessity -- it is rooted in global shifts. A crucial catalyst has been the dramatic tariff hike imposed by the Trump administration on Indian exports, which India perceives as a betrayal from a partner it once relied upon to counterbalance China. In this context, New Delhi's recalibration toward Beijing has the potential to transform the regional landscape.\nThe India-China rivalry has deep historical roots. The 1962 border war not only inflicted territorial and human losses but also entrenched mutual distrust that persisted across generations. Even when the two countries achieved significant economic growth in the late 20th and early 21st centuries, the mistrust remained. Periodic talks and confidence-building measures were often overshadowed by sudden flare-ups, the most serious of which occurred in Galwan Valley in 2020, leaving soldiers dead on both sides.\nThese skirmishes had consequences far beyond the battlefield. The suspension of direct flights, restrictions on Chinese firms in India, and heightened nationalist rhetoric further chilled ties. For ordinary citizens, a sense of animosity took root, creating a perception that the rivalry was both permanent and irreversible.\nBut in geopolitics, permanence is elusive. The sharp shift in the U.S. trade policy --specifically Washington's decision to impose 50 per cent tariffs on Indian goods -- upended India's calculations. Long seen as an ally in countering China's growing influence in Asia, the U.S. suddenly appeared unreliable. For India, the tariffs felt less like an economic dispute and more like strategic abandonment. Faced with this jolt, New Delhi's leadership began to look anew at Beijing.\nThe global context matters. The U.S.-China rivalry has increasingly defined world politics, pushing other nations to take sides. India, for years, leaned closer to the U.S., participating in forums like the Quad alongside Japan and Australia. But Washington's tariff hammer made India realise that over-reliance on one partner was strategically risky.\nChina, for its part, also has reasons to engage. With slowing growth, trade disputes with the West, and mounting concerns about global supply chain realignments, Beijing needs stable relations with regional giants like India. For China, India represents not only a massive consumer market but also a partner whose cooperation is vital to stabilising South Asia.\nThus, Modi's visit represents a moment of convergence: two rivals finding common ground not because their disputes vanished, but because global pressures created overlapping interests.\nThe ripple effects of improved Indo-China relations will be most deeply felt in South Asia. For decades, the smaller countries of the region -- Bangladesh, Nepal, Sri Lanka, Bhutan, and the Maldives -- have had to perform a delicate balancing act. Aligning too closely with China risked provoking Indian ire, while tilting too much toward India could jeopardise Chinese economic investments and political goodwill. This strategic tightrope often constrained their foreign policies and left them vulnerable to external pressures.\nFor Bangladesh, the balancing act has been particularly delicate. Dhaka has deep historical, cultural, and security ties with Delhi, while at the same time it has become a significant beneficiary of Chinese infrastructure investments under the Belt and Road Initiative (BRI). Navigating between these two giants has been a diplomatic challenge. Too much closeness to one used to invite suspicion from the other.\nIf Modi's Beijing visit indeed ushers in a phase of cooperative Indo-China relations, Bangladesh will breathe a sigh of relief. It means less pressure to choose sides and more room to focus on its own economic and strategic priorities. Improved ties between Delhi and Beijing could also pave the way for regional connectivity projects -- rail, road, and energy corridors -- that benefit all of South Asia.\nFor Nepal, long caught between the two giants, a more stable Indo-China relationship would ease the constant tug-of-war over its foreign policy. It may also open up new opportunities for infrastructure cooperation without being framed as a zero-sum game.\nSri Lanka and the Maldives, often cited as examples of \"debt trap diplomacy\" in relation to Chinese loans, have found themselves struggling to balance Beijing's financial leverage with New Delhi's strategic expectations. A thaw between the two Asian powers could reduce the competitive bidding for influence and instead foster cooperative development initiatives.\nOn the other hand, Bhutan's security concerns have always been tied to the India-China dispute, especially in the sensitive Doklam plateau area. A shift toward cooperation could provide much-needed stability for Thimphu, which has been under immense pressure due to its geographical vulnerability.\nThe resetting of ties between India and China is not only a bilateral breakthrough but also a regional stabiliser. A cooperative relationship between Asia's two giants could reduce border tensions. Dialogue can replace skirmishes, lowering the risk of accidental escalation.It could boost regional trade. By reopening trade channels and restoring direct connectivity, both countries can drive economic growth across South Asia. Better Indo-China relationship could also encourage multilateralism. Platforms like BRICS, the Shanghai Cooperation Organization, and the Asian Infrastructure Investment Bank could gain new relevance with India and China working in tandem. Again, it could shift geopolitical equations. If New Delhi and Beijing find common ground, South Asia could become less of a battleground for U.S.-China rivalry and more of a hub for Asian-led initiatives.\nHowever, optimism must be tempered with caution. The structural problems in Indo-China relations remain profound. Border disputes have not been resolved, and mutual suspicion in security establishments is deep-rooted. Domestic political pressures in both countries can easily reignite nationalist rhetoric, undoing fragile progress.\nMoreover, while economic cooperation is possible, competition for influence in South Asia will not vanish overnight. Both nations still see themselves as natural leaders of Asia, and that rivalry of visions could complicate sustained cooperation.\nThe role of the United States also remains uncertain. Washington will not quietly watch a warming of ties between India and China, as it undermines the U.S. strategy of using India as a counterweight to China. Future U.S. administration may offer incentives -- or exert pressures -- to pull India back into its orbit.\nFor the reset to succeed, sincerity and seriousness are essential. Symbolism must translate into substance. Both sides should prioritise some tasks. First is to institutionalise dialogue through regular high-level meetings to manage disputes before they escalate. Second is to restore connectivity by reopening direct flights and easing restrictions on trade and investment. Third is to promote regional projects through joint infrastructure or energy initiatives in third countries like Bangladesh or Nepal that could showcase cooperative leadership. And fourth is to de-escalating border disputes by establishing clear mechanisms for border crisis management to prevent future clashes.\nPrime Minister Modi's visit to China is more than a diplomatic gesture -- it is a recognition that the destinies of India and China are intertwined. Their rivalry has long cast a shadow over South Asia, forcing smaller nations into uncomfortable choices and perpetuating instability. But the emerging reset offers a chance to break this cycle.\nFor Bangladesh, Nepal, Sri Lanka, Bhutan, and the Maldives, the thaw could mean breathing space and opportunities for growth. For Asia, it could mean greater stability and a stronger voice in global affairs. And for the world, it signals that multi-polarity is not merely an abstract concept but a tangible reality taking shape in the heart of Asia.\nThe task ahead is daunting. Old rivalries die hard, and global geopolitics remains volatile. Yet, if nurtured with seriousness and sincerity, the new momentum in Indo-China relations could redefine South Asia's future. It is an opportunity too significant to squander.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Resetting Indo-China ties: Implications for South Asia",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/resetting-indo-china-ties-implications-for-south-asia-1756743385",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       September 02, 2025 00:00:00  \n\nThe World Bank (WB) made a forecast in April last that more 3.0 million people would join the ranks of the extreme poor by the end of this year. Attributing this development to the economic slowdown following August 2024 political change, the global lender added that the development would contribute to the rise in the overall rate of extreme poverty from 7.7 per cent in 2023 to 9.3 per cent by the end of this year. \nAs defined by the WB, individuals who cannot meet their basic needs and live on less than USD2.15 dollar (as of 2023) a day are the extreme poor. And, as such persons cannot meet their basic needs, they often go hungry and suffer from malnutrition. Actually, this is a broad-brush measure to qualify and quantify extreme poverty. But in the real world, extreme poverty is a very complex human condition and it varies depending on the overall social and economic condition of society where a section of its population is experiencing abject poverty. From the perspective of donor-funded poverty research, the efforts to address poverty, which is but a symptom of a much deeper social malaise of continuous transfer of social wealth from the people belonging to the economically weaker and underprivileged segment of society to the powerful and the rich directly under state political patronage, is more palliative than curative. Notably, the political class running the state acts as the handmaiden of this continuous pauperisation of the weaker segment of society. The phenomenon was never more glaring than during the previous regime. So, the transfer of social wealth to the super-rich at an unprecedented scale that was taking place during that period should have at least come to a temporary halt through the political change of August 2024. But from the findings of the WB, it appears that the political changeover of August 2024 has rather worsened than improved the country's poverty situation. How is one to explain this apparent dichotomy? Clearly, the rise in extreme poverty that WB reported was the continuation of the worsening poverty rate that remained both unreported and under-reported during the previous regime. \nSmall wonder that the study findings of a local private research body, Power and Participation Research Centre (PPRC), as disclosed recently, show how the rising poverty level is affecting both urban and rural households of the country. The said study found that 80 per cent of the households in Bangladesh cannot meet family expenses with their monthly incomes. So, they have to borrow money from relatives or other sources to make ends meet. As a result, they get into debt, which is the beginning of the process of sliding deeper into poverty. The PPRC study found that the bottom 40 per cent of the households have an average monthly income of Tk 14,881 or about Tk 15,000. But this amount of money falls short of their average monthly expenditures amounting to Tk 17,387, which is close to Tk 17,400. Clearly, the borrowings render these families even poorer as they have no additional incomes to repay the debts accruing every month. Evidently, these families are progressively running into a vicious circle of debt that they cannot extricate themselves from. Soon they will fall into dire poverty, categorised as 'extreme poor' by the WB. \nThe middle 40 per cent families, as it came out from the PPRC's study, have an average monthly income of Tk 28,818, or in round figure, Tk 28,800. The average monthly expenditures of these families, on the other hand, are Tk 29,727, or around Tk.29,700. So, this group somehow manages to scrape through. Since the interim government is focusing mainly on addressing the issues of macro economy like economic growth, inflation, interest rates, balance of payments etc., the micro-economic ones like worsening poverty is getting lesser attention. \nBut for those living through penury, the matter is urgent and cannot wait. The government must act to help at least the bottom 40 per cent households so they may not sink into extreme poverty.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ever worsening poverty situation",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ever-worsening-poverty-situation-1756743435",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 02, 2025 00:00:00  \n\nThe long-overdue election of the Jagannath University Central Students' Union (JnUCSU) has become a pressing issue in light of the country's socio-political context. One of the core demands of the July-August mass uprising was the establishment of democratic rights and greater accountability. A functional student union is central to this process, as it empowers students to elect their own representatives who can voice their concerns before the university administration.\nThe absence of union elections for years has created a vacuum, allowing certain student organisations to dominate the campus unchecked. This dominance often breeds conflict and violence. An elected student union could foster a culture of coexistence among student groups, restoring peace and order.\nJagannath University students continue to face a host of problems such as lack of proper accommodation, poor transportation, substandard healthcare and declining academic quality. An elected body could directly negotiate with the administration to resolve these issues, ensuring students' legitimate demands are addressed in a timely manner.\nMoreover, student union elections cultivate new and capable leadership. JnU Central Students Union (JnUCSU) could become a training ground for leaders who may later serve the nation with integrity and vision. With student unions being revived at Dhaka University, Rajshahi University, and Jahangirnagar University, there is no justification for further delay in holding such election at Jagannath University. The oft-cited excuse of \"legal complexities\" can no longer hold ground.\nThe JnUCSU election is not merely a procedural requirement; it is a fundamental democratic demand. Holding it without delay will help restore a healthy academic and political environment at Jagannath University.\nSadia Sultana Rimi\nStudent, Mathematics Department\nJagannath University\nsadia15.jnu@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Hold JnU Students Union election now",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hold-jnu-students-union-election-now-1756743463",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-09-2025"
    }
]