[
    {
        "full_article": "The first hull loss of the ‘Dreamliner’, one of aviation’s most advanced twin-aisle aircraft, is one that is unsettling, more so when there have been recent examples of survivability in modern widebody jets. The tragic end to Air India flight AI171, on June 12, 2025 — there was one surviving passenger — just minutes after its liftoff from Ahmedabad for London Gatwick, and it touched a recorded barometric altitude of 625 feet, will be under much global scrutiny. That the crew were faced with a sudden and sharp turn of events on the 11-plus-year-old Boeing 787-8, a plane with ample avionics redundancy, and reliable twin engines — the GEnx-1B67, rated at 67,000 lbs of thrust each — has led to much speculation about the cause. Experts have suggested reasons such as issues with load planning, ambient air temperature and engine performance, wing surface settings, and even a bird hit. Inducted by Air India during its government-owned days, as part of a 68-aircraft deal signed with Boeing in 2006, the subfleet of 787-8s has played a role in its medium to long-haul network expansion to Europe, the Far East and Australia. The plane’s global safety record has been strong in general, but it has also been an aircraft type that has raised some concerns. These have included assembly-line quality control, ‘whistle-blower’ statements, engine icing problems that resulted in a safety directive, a lithium aerospace battery-related electrical system issue that led to extensive world-wide groundings, an emergency locator transmitter battery fire that caused heat damage, and, in 2024, an in-flight upset that was linked to a feature in the flight deck crew seat.All eyes will be on how the airline’s new owner, Tata Sons (with a 25.1% shareholding by Singapore Airlines Limited), steers its operations and addresses safety concerns after an ‘unprecedented’ four-airline merger. The group is in the middle of executing Vihaan.AI, the airline’s ‘transformational roadmap over five years’, with the appointment of a ‘head of group safety, security and quality’ integral to this. In parallel, the airline has also faced scrutiny by India’s civil aviation regulatory body, the Directorate General of Civil Aviation. With a formal investigation, that includes international participation, having been initiated, in keeping with aviation protocols, the complexities that a first-time 787 crash analysis could throw up should be ironed out. At the 81st International Air Transport Association annual general meeting and World Air Transport Summit in New Delhi last week, India was recognised to be one of the largest aviation markets. However, its rapidly expanding aviation sector needs to address the challenges, which include safety, on the ground and in the air. Published - June 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Airlines\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        air and space accident\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        Ahmedabad plane crash 2025\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Singapore\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        aviation safety\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        New Delhi",
        "headline_1": "Crash and burn: On the Air India Ahmedabad plane crash and Indian aviation",
        "headline_2": "India’s aviation sector needs to address safety concerns",
        "link": "https://www.thehindu.com/opinion/editorial/crash-and-burn-on-the-ahmedabad-crash-indian-aviation/article69691403.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "Israel’s strikes on Iran’s nuclear facilities, at a time when Washington and Tehran were in talks, are brazenly illegal, reckless and dangerous. If there was any possibility of resolving the nuclear issue through dialogue, Israel has practically killed it. That Donald Trump, despite his repeated warnings, failed to stop America’s closest ally from launching the attacks — threatening his own diplomatic push — suggests that the U.S. President was either not serious about his words or had limited influence. Israel’s overnight attack targeted the Natanz nuclear enrichment facility, ballistic missile factories and the residences of Iran’s top nuclear scientists and military chain of command. In retaliation, Iran launched a drone attack, with most shot down. Supreme Leader Ayatollah Khamenei has promised a harsh response. If Iran launches ballistic missiles, which seems likely, Israel would carry out more attacks, as Prime Minister Benjamin Netanyahu has indicated. So what possibly awaits West Asia are prolonged attacks and counterattacks, with potential regional spillover effects.There are legitimate concerns about Iran’s nuclear programme. It has enriched uranium to 60% purity, way above the grade for civilian purposes. Israel says Iran was making attempts to build a bomb in secret. While the IAEA says Iran has enough highly enriched uranium to make bombs, there is no conclusive evidence to suggest that Iran has moved in this direction. Tehran once agreed to scuttle its nuclear programme in return for the lifting of sanctions as part of the multilateral agreement in 2015, but it was Mr. Trump who sabotaged the agreement. And when Mr. Trump, in his second term, offered dialogue, the Iranians seized it. But what Iran got instead was an attack on its nuclear plants. Israel did this as it knew it could get away with any form of aggression, thanks to the U.S.’s military, political and diplomatic support. Israel has behaved like a rogue nation ever since the October 7 attack by Hamas. It is facing allegations of committing genocide after its destruction in Gaza that has killed over 54,000 Palestinians. It routinely bombs Lebanon despite a ceasefire with Hezbollah. It has carved up more territories in Syria after the collapse of the Assad regime. And now, by attacking Iran, Tel Aviv has pushed West Asia into a deeper security abyss. Israel’s unchecked militarism is closing the space for diplomacy in a tumultuous region. If the conflict spills over into the Gulf waters and kingdoms, it would be catastrophic for the global economy, especially for India whose millions of citizens work and live in the region. There must be an immediate, coordinated international effort to rein in the Jewish state and reboot diplomacy to restore stability in West Asia. Published - June 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Israel\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        missile systems\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Syria\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        security measures",
        "headline_1": "​Rogue nation: On Israel’s Iran strikes",
        "headline_2": "Israel has pushed West Asia into a security abyss",
        "link": "https://www.thehindu.com/opinion/editorial/rogue-nation-on-israels-iran-strikes/article69691339.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "Forgotten after every plane crash is the terrifying complexity of pilots’ jobs. Their work involves precision, pressure & unpredictability. Their lives are often defined by fatigue, anxiety, even depression. Then there’s aircraft reliability & airport congestion\n\nEvery air tragedy brings the role of pilots into sharp focus. Never, though,is there enough appreciation of what a pilot’s job entails – it’s a terrifyingly complex interplay between human expertise, technology, and split-second decision-making.\nRead full story on TOI+\n\n",
        "headline_1": "Stories from modern cockpits",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/stories-from-modern-cockpits/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "An Israeli commentator says Tel Aviv’s military op is a war that’s been in the making for years, and that the timing was determined by a real threat that Tehran’s assembling nuclear weapons\n\nThere are moments in the life of a nation when a broad, unshakable consensus forms – even without prior political preparation. When Israel decided to take military action against Iranian leadership’s plans to eliminate Israel is one such moment. This may sound melodramatic, yet annihilation of world’s only Jewish state is the Ayatollah regime’s goal.\nRead full story on TOI+\n\n",
        "headline_1": "‘Iran had to be hit…it’s humiliated, but far from defeated’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/iran-had-to-be-hitits-humiliated-but-far-from-defeated/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "Ishvar, often translated as God or the Supreme Being, occupies a unique place in Patanjali’s Yog Sutras. Far from being a theological dogma, Ishvar in this context is introduced as an essential component of yogic practice, particularly within the framework of Ishvar Pranidhaan, the act of total surrender to the Divine. But who or what is Ishvar? Is he merely a belief, a metaphor, an overarching deity or an ontological reality?\nIn Sutra 1.23, Ishvar Pranidhaanadva – Patanjali introduces Ishvar, as one of the means to attain Samadhi, total absorption. This implies that surrender to Ishvar can be a direct path to the highest meditative absorption. In the very next sutra, Patanjali elaborates on the nature of Ishvar, not as some deity sitting in a far-off heaven, but as a unique, Cosmic Being; PurushVishesah – a distinct, unrivalled, nondual Purush.\n\nIshvar, as indicated by Patanjali, is not bound by the limitations that afflict individual beings. He is described as ‘ klesh-karmavipaaka-aashayaihapara amrstah purush-vishesa h’ – the one who is untouched by kleshas, afflictions, karm, actions, vipaaka, fruits of actions, and aashayas, latent impressions. He is eternally pure, full, free, omnipresent and omniscient. This vision of Ishvar transcends anthropomorphic notions of God and presents a deeply philosophical and experiential reality.\nTo understand Ishvar, one must grasp the essence of creation itself. All intelligent creations – whether a wristwatch ora clay pot, presuppose three elements: (1) knowledge of creation,(2) a consciousbeing possessing that knowledge, and (3) material required. With its profound order and intelligence, the universe cannot result from chaos or chance; it is a superintelligent and deliberate creation. Every aspect of it, from stars to galaxies, from a tiny mole to mighty mountains, from a blade of grass to a banyan tree, from a single-cell amoeba to marvellous humans, functions in astonishing harmony. It is unwise to think that this universe appeared from nothing. As the ancient saying goes, ‘ex nihilo nihil fit’ – nothing comes from nothing.\nIn Vedanta, Ishvar is both nimitta-kaaran, intelligent cause, and upaadaana-kaaran, material cause of the universe. Just as a spider weaves its web from within itself and withdraws it, the entire cosmos is a manifestation of Ishvar. Pervading existence, Ishvar remains unchanged. This cosmic presence is not separate from us. Patanjali encourages an intimate relationship with Ishvar through pranidhaan, a surrender that is not passive but born of insight. Ishvar becomes a mirror to our higher Self, a catalyst for inner transformation.\nImportantly, Patanjali’s elucidation of Ishvar is not sectarian. Ishvar is not bound to a name, form, or religious identity.\n\n",
        "headline_1": "Ishvar in Patanjali’s Yog Sutras",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/ishvar-in-patanjalis-yog-sutras/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "We all need privacy – to misspeak, to err, to be intimate\nTo hold one opinion but voice another, is this inauthentic? To conduct oneself as if one is being permanently surveilled, does that help democratic life? In her book Strangers and Intimates: The Rise and Fall of Private Life, British sociologist Tiffany Jenkins traverses centuries, to explain how the private and the public developed into two distinct realms, and how this historic achievement is now in mortal danger. \nSpark of conscience | From the Protestant iconoclasm of Martin Luther to the extensive adventurism of Henry VIII, the 16th century germinated the independence of ‘inward things’ from traditional authority. Hobbes’s 1651 magnum opus Leviathan presented hypocrisy – the gap between public utterance and private belief – as key to protecting the social order from anarchy. The 1650 Toleration Act passed by Cromwell’s parliament made strides towards making religion a private matter. \nAge of separations | The first modern biography, Boswell’s Life of Samuel Johnson (1791), the first modern autobiography, Rousseau’s Confessions (1782), the first novel, Richardson’s Pamela (1740), literacy rate for men in London approaching 80%, it was all of a piece with thinking for oneself. Simultaneous to the strengthening private sphere, was the rise of public life. Coffee houses were popping up everywhere. These were a male space, like the Atheninan agora. Male and female roles became sharply different. A woman effectively became her husband’s property when she married.\nIn 1801 the first census rolled out after an acrimonious five-decade resistance that it would ‘molest and perplex every single family in the kingdom’. Drawing the line between a public realm open to state intervention and a private domain beyond it became the question of the age.\nAcross the pond, the skepticism that met govt-led research was belied by the enthusiasm that met George Gallup, who founded his polling company in 1935. Americans liked answering questions about themselves and reading the results. As Kinsey discovered, they were also more than ready to share their sex ‘histories’. Bernays’ Propaganda (1928) proposed ‘the engineering of consent’, whereby these masses could be controlled by an ‘invisible’ govt, with insights from psychology and natural science. \nThe personal is the political | This was Betty Friedan, Kate Millett and other second-wave feminists’ counter to the ‘interior colonisation’ of women. But politicising the private sphere also meant depoliticising the public sphere. Redirecting scrutiny from social and economic structures of society to personal relationships placed an intolerable burden on everyone involved in such political practice, the book argues.\nRelatedly, Ruth Bader Ginsburg’s criticism of the Roe vs Wade ruling was that abortion rights should not be a privacy issue but a matter of equal rights. Either way, the public-private separation forged in the 18th century weakened by the end of the 1970s. \nLet’s talk about sex | Monica Lewinsky’s was the first massive news story to break online. The Kenneth Starr report was accessed by 20mn Americans within 48 hours of its release. Fast forward to the normalisation of Pornhub and OnlyFans as examples of ‘creator economy’. \nBy now, threats to privacy are almost exclusively framed in terms of data and digital security. But, the book underlines, the protection of individual privacy ultimately depends on a clear boundary between private and public domains, which must be defended both online and offline. Strangers are not intimates. Why treat them like that? Protect your inner life instead. \n\n",
        "headline_1": "A closet of one’s own",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/a-closet-of-ones-own/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 15, 2025 00:00:00  \nThe interim government, in its pursuit of recovering assets laundered abroad by powerful actors, now weighs the option of financial settlements as a pathway for restitution. Governor of Bangladesh Bank Dr. Ahsan H. Mansur reportedly made this disclosure in a recent interview with The Financial Times of London, saying the government aims to go for financial settlements in \"less serious\" cases using legal means. Besides, he said, the central bank team had been in touch with litigation funding firms to help asset recovery, including funds transferred abroad illegally. While asset recovery is undoubtedly essential for economic justice, the manner in which it is pursued carries significant implications for legal integrity, accountability and the broader fight against corruption. Settlements, by design, can be expedient, but they must not risk undermining the foundational principles of justice and deterrence under the guise of pragmatism.\nIt may appear more appealing to some to try to recover even a portion of misappropriated money through negotiated agreements than to risk losing all in drawn-out court battles. There is no doubting that lengthy and costly litigation, particularly in foreign jurisdictions, can result in uncertain outcomes. On the other side, entering into settlements with individuals implicated in money laundering can also be construed as a concession made under duress, driven more by fiscal urgency than by principle. Such a move may raise questions about the government's financial standing and suggest that it is up against the wall financially. More critically, it blurs the line between justice and expediency. If lesser offenses are settled financially, what stops more serious cases from being treated the same way? The distinction between less serious and serious offenses is often a matter of interpretation when dealing with high-level financial crimes. Without clear criteria, such a policy could create a grey zone ripe for favouritism and political manipulation. The optics of it alone could prove damaging to the credibility of the interim government's anti-corruption campaign. Already, supporters of the ousted regime have accused the administration of political vendettas, and any perception of selective or lenient application of penalties will only strengthen those claims. \nThere is also the ethical dimension to pursuing such a strategy. Money laundering and illicit financial flows are not merely administrative violations, they represent a systematic plunder of national resources that deepens inequality and hinders development. Settling with the accused without full transparency or judicial scrutiny may send a dangerous message that those with sufficient means can evade justice. Another immediate concern that should not be overlooked is public perception. For a population that has long borne the costs of corruption from reduced public services to growing inequality, the idea of letting alleged offenders settle their wrongdoing through payment is likely to fuel resentment. This could very well cause lasting harm to the public trust. Furthermore, the interim government must also consider whether this approach aligns with its stated commitment to rooting out corruption, or if it unintentionally legitimises the very practices it seeks to eliminate.\nIf the government must proceed with the option of financial settlements, it must do so with extreme caution and complete transparency. It should set clear and objective standards for identifying less serious cases and calculating settlement amounts, and these standards must be shared publicly to prevent any perception of unfair or arbitrary decisions. Additionally, measures must be put in place to ensure that these settlements do not become a mechanism for legitimising ill-gotten gains or encouraging future wrongdoing. Settlements may have their place, but they must not become a loophole for the powerful to evade the full weight of the law.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Govt's asset recovery move may raise a few questions",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/govts-asset-recovery-move-may-raise-a-few-questions-1749909051",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       June 15, 2025 00:00:00  \nThe annual budget of the government is the most crucial fiscal event which has a bearing on the living conditions of all social groups. It is the main conduit of national resource mobilisation and management. Every year in June, the country receives its annual national budget for the upcoming fiscal year. After unveiling the budget by the man-in-change of national exchequer, different stakeholders scrutinise the various fiscal proposals placed in the budget. They also submit their suggestions and demands for the inclusion or exclusion of specific measures. Finally, the proposed budget receives approval from the parliament with or without some amendments. Thus, the proposed budget becomes the original budget.\nBesides placing the budget proposal for the new fiscal year, the finance minister also declares a revised budget for the outgoing fiscal year. When the national parliament is operational in the country, he/she also presents a supplementary budget for the approval of the lawmakers. \nThe general trend in Bangladesh is to revise the proposed or original budget by reducing the original outlay. Ultimately, the size of the actual or implemented budget gets further reduced, mainly due to inefficiency in public spending, coupled with the wrong selection of development projects and inadequate mobilisation of resources. Budgetary decisions are primarily dependent on the availability of resources.\nThe government has been disclosing the status of the implemented or actual budget since FY09 in the budget document, specifically in the 'Budget in Brief.' This document provides a concise overview of the budget, including key figures and policy priorities. The practice brings some amount of transparency in the case of public spending disclosure and helps analysts and stakeholders get a more realistic picture of the budget.\n\nIn the first week of this month, the finance adviser to the interim government unveiled the national budget for the fiscal year 2025-26 (FY26). As there is no parliament in the country, Dr Salehuddin Ahmed, the finance adviser, delivered his budget speech via television and radio. Titled 'Building an Equitable and Sustainable Economic System', his speech nominally outlined the future direction of Bangladesh's economy. \nBreaking the tradition of incremental budgets over the last five and a half decades, Salehuddin proposed an outlay of Tk 7.90 trillion for FY26, which is around one per cent lower than the original outlay of Tk 7.97 trillion for FY25. The proposed budget for the next fiscal year, however, is 6.20 per cent higher than the revised budget for the current fiscal year. Nevertheless, the modest increase over the revised budget is also a deviation from the long practice. For the last 15 years, since FY10, the proposed budget for the new fiscal year has shown a double-digit rise over the revised budget of the current fiscal year. Considering the high rate of inflation, the 6.20 per cent increase in the proposed FY26 budget over the revised FY25 budget is also not a hike, in real terms. The annual average rate of inflation stood at 10.13 per cent in May this year. \nThe reduced outlay of proposed public spending for the next fiscal year is a reflection of reality. During the last decade of the ousted Hasina regime, the annual average rate of hike in the proposed budget was 13.40 per cent. Most of the time, inflated outlay was proposed to widen the misappropriation and misuse of public money. The reduction in the proposed outlay for the next fiscal year could potentially lead to a more efficient allocation of resources, but it also raises concerns about the adequacy of funding for key sectors. \nThe finance adviser also delivered an abridged speech of around 7,000 words, whereas the original text contained around 17,000 words. The shortened version also helps viewers and listeners maintain their concentration. \nNevertheless, the unnecessary delay in making the budget documents public was a disturbing development, especially for analysts and the media. For many years, budget documents were made public when finance ministers began delivering their budget speeches. The practice is disrupted this time. The transmission started at 3:00 pm, and the finance ministry made the documents public after nearly an hour, without any apparent reason. The media personnel who gathered at the Ministry of Information to collect the budget documents also waited for an hour to obtain the documents. Despite repeated requests, the officials did not distribute the documents, quoting the official instruction to wait until the end of the speech. Over the years, journalists have been urging the government to announce the budget before noon. Regrettably, the Yunus-led interim government stuck to the previous timing of budget presentation.\nTrue, the budget is not a panacea for all financial problems, though it is the most critical instrument of a government to manoeuvre public investment and development activities. In a democratic environment, the nature of the budget-making process should be more people-oriented, and policymakers should pay due attention to ensure that the expectations and aspirations of the people are reflected in the budget. According to some economists, public choice and democracy are interrelated, and the economic interpretation of democracy is that public wants and desires be entertained in the budget. \nSo, the budget process needs to be judged on the basis of (i) the constitutional obligations of the government, (ii) changes in the domestic political perspectives, and (iii) changes in the global economic environment. Like the previous finance ministers, the finance adviser also tried to comply with these three aspects. \nNevertheless, a budget is also not simply an annual financial statement of the government or a set of documents prepared by the bureaucrats, but rather a political tool which combines political decision-making with bureaucratic procedure. It is the numerical documentation of the government's political ideology, which is to be implemented through a suitable economic framework. \nOver the last 16 years, it has been observed that the actual budget spending was, on average, 14 per cent lower than that of the original budget and 11 per cent lower than the revised budget, which is the budget that has been adjusted after the initial proposal to account for any changes or new information. Only the actual or implemented budget of FY11 was around 3 per cent and 1.5 per cent lower than the original and revised budgets of the year, respectively. \nAs the final implementation of the budget is generally lower than the proposed or revised outlay, it implies a structural weakness in the country's public expenditure system. This has led to some critical areas being deprived of due allocation or public investment, while some less important sectors are flooded with funds. The FY26 budget is a modest attempt to deviate from this trend. Its success, however, will depend significantly on the actions of the democratically elected government in the near future, underscoring the importance of their role in the budgeting process. \nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "In quest of a practical budget",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/in-quest-of-a-practical-budget-1749909322",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       June 15, 2025 00:00:00  \nAlthough much has been said about ending chaotic traffic and ensuring road safety, the interim government has failed to bring about any perceptible change in terms of traffic congestion and road accidents. The roads remain as deadly as ever. According to a report by the Bangladesh Jatri Kalyan Samity, at least 614 people died and 1,196 were injured in 597 road accidents across the country in May alone. Motorcycles were involved in 233 of these crashes, resulting in 256 deaths and 201 injuries-accounting for 39.02 per cent of all accidents, 41.69 per cent of fatalities, and 16.80 per cent of injuries.\nWhile a breakthrough in this area cannot be expected overnight, certain government initiatives-such as the Chief Adviser's meeting with transport experts, efforts to strengthen the BRTA, and the introduction of Bus Route Rationalisation in Dhaka-had initially raised public hopes. But traffic management has become too complex an issue to be resolved quickly.\nHowever, issues such as unskilled drivers operating vehicles without licences, or obtaining them through dubious means and reckless driving, should have been addressed in earnest. It is deeply alarming that, a significant number of vehicles are being driven by individuals who have secured licences through bribery rather than through proper training and testing. For instance, a medical certificate is mandatory for professional motor vehicle drivers when applying for a new driving licence or renewing an existing one. Yet there are widespread allegations that many applicants are submitting fake medical certificates to obtain professional licences, and that the BRTA is issuing licences based on these forged documents. These fake certificates are often produced at computer composing shops near BRTA circle offices. They are typically created using Photoshop, edited with the names of reputable hospitals and doctors to make them appear genuine. This widespread malpractice is a major factor behind the sharp rise in road accidents. Roads can never be truly safe as long as unqualified drivers are allowed to operate freely.\nPutting an end to the dangerous practice of issuing forged driving licences should not be particularly difficult. What is required is a strong political will and determination on the part of the authorities concerned to eliminate a practice that continues to make our roads unsafe. Experts have long suggested that all holders of forged licences be identified and provided with proper training to perform their duties responsibly. While this is no easy task, it can no longer be ignored.\nExperts have also pointed out that the BRTA should have taken action much earlier. It is a criminal offence to issue fake licence to the prospective drivers in a country where road accident is taking a heavy toll of human lives, and the situation is showing no signs of improvement.\nMoreover, reckless driving of rundown vehicles is another major cause of the rising number of highway accidents. Faulty road designs, especially risky turning points, also contribute significantly to the growing accident rate. However, poor traffic management, a lack of highway police patrols, and the indifference of both traffic police and the BRTA in restoring order on the roads are equally responsible for the high death toll.\nStrict enforcement of speed limits, increased highway patrols, and the modernisation of traffic management systems are necessary to help reduce road accidents and casualties. But, regrettably, the enforcement of traffic rules often remains confined to lip service as corruption continues to stand in the way of meaningful action.\nThere is no doubt that improvements are needed in several key areas if we are to build a modern, effective traffic management system. For now, the authorities should focus on eliminating anomalies and corrupt practices-such as the issuance of forged licences-and encouraging both drivers and pedestrians to adhere to traffic rules. Success in these two areas alone would go a long way towards making roads safer.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Stop issuing fake licence  to drivers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/stop-issuing-fake-licence-to-drivers-1749909499",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 15, 2025 00:00:00  \n\nAs artificial intelligence (AI) changes markets around the world, businesses in Bangladesh are starting to look at how it can help them not just with tasks, but also in making important decisions.\nAI tools can now handle huge amounts of data, helping companies figure out what people want to buy, set the right prices, and manage their supply chains better than humans can. AI helps companies spot trends and predict results, allowing them to make quicker decisions based on data. This improves how they work and lowers risks.\nIn stores, smart tools that use AI can help with inventory choices by looking at seasonal patterns and what customers like. In finance, machine learning helps to assess credit risk and find out fraud. Even small and medium-sized businesses are using AI tools for talking to customers, marketing, and planning their operations. But to use AI in decision-making, we need to invest in training people and building data systems. If we don't have good data or rules to protect fairness, AI can treat people unfairly or give bad results.\nBangladesh's developing digital economy, helped by projects like \"Smart Bangladesh 2041,\" offers a good chance right now. Companies that start using AI technology early will probably have an advantage over others in their local and worldwide markets.\nAI is now more than just a technology trend; it is quickly becoming an important tool for businesses.\nMahfuza khanum keya\nDepartment of Accounting and Finance\nNorth South University\nmahfuza.keya@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Harnessing AI for smarter business decisions",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/harnessing-ai-for-smarter-business-decisions-1749909512",
        "news_paper_name": "The Financial Express",
        "publish_date": "15-06-2025"
    }
]