[
    {
        "full_article": "India’s industrial production growth slowed to a six-month low in February to 2.9%, down from January’s 5.2% (revised estimates) and almost halved from last February’s 5.6%. This decline was broad-based, except for a marginal rise in power production of 3.6%, up from January’s 3.4%, but less than half of last February’s 7.6%. While mining witnessed the steepest decline to 1.6% this February, from 8.1% last year, manufacturing almost halved to 2.9%, from 4.9% last year. From a use-based classification, the steep decline in consumer durables output to 3.8%, from 12.6% last February as well as a production contraction for the third month in a row, of consumer non-durables by 2.1% (there was a 3.2% contraction in January), indicates a marked decline in overall consumption demand. This has been despite a sharp dip in retail inflation, which was down to 3.61% this February from 5.09% a year ago, with a low food inflation rate at 3.75%, the lowest in two years. This makes it almost certain that the government’s wish for a Maha Kumbh-led spike in consumption has not materialised, leading to the likelihood of the Centre’s 6.5% GDP growth target for the 2025 fiscal being missed. February’s Index of Industrial Production (IIP) numbers co-relate with the 14-month low in the manufacturing Purchasing Manager’s Index survey conducted by S&P at 56.3.This highlights two things: the trepidation of manufacturers facing unprecedented global economic uncertainty following U.S. President Donald Trump’s actions and the lack of an appetite among consumers, many of whom have witnessed the value of their assets plummet due to Indian stock market volatility that has mirrored the peaks and troughs in global exchanges. There have been green shoots, however. Within the manufacturing sector, which has the highest weightage of about 77% in the IIP, 14 of 23 industry groups recorded growth this February from a year ago. Growth was led by motor vehicles, trailers and semi-trailers (8.9%), non-metallic mineral products (8%) and basic metals (5.8%). Capital goods output accelerated to 8.2% from 1.7% last year, indicating robust investment demand aided by a massive rise in government spending. This was despite the liquidity squeeze in India’s banking system by ₹1.7 trillion, as on February 20, due to the massive flight of foreign capital in search of haven asset classes and to hedge against a depreciating rupee. The central bank stepped in by injecting about ₹2.18 trillion into the banking system using rupee/dollar swap arrangements that ended on March 24. The Centre can perhaps take solace in the fact that despite a possibility of its growth target for the last fiscal being missed, India remains the fastest growing economy. Published - April 15, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        industrial production\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        electricity production and distribution\n                    \n                            /                      \n                        \n                        consumer goods\n                    \n                            /                      \n                        \n                        Maha Kumbh Mela 2025\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        machine manufacturing\n                    \n                            /                      \n                        \n                        stock activity\n                    \n                            /                      \n                        \n                        automobile\n                    \n                            /                      \n                        \n                        metal\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        economy (general)",
        "headline_1": "​Missing the target: On the economy, the Centre’s growth target",
        "headline_2": "Despite missing the growth target, the economy remains strong",
        "link": "https://www.thehindu.com/opinion/editorial/missing-the-target-on-economy-the-centres-growth-target/article69449438.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "That the Right to Information Act and the use of RTIs have enhanced the accountability of those in governance in India goes without saying. In the last few years there have been attempts to dilute the provisions of the Act, a landmark one that was passed 20 years ago. Clearly, some in governance and administration have treated the Act and its provisions on transparency and disclosure to be encumbrances. A significant threat has now emerged in the amendment to Section 8(1)(j) of the Act, which has been introduced in Section 44(3) of the Digital Personal Data Protection (DPDP) Act, 2023. The Act itself is an outcome of K.S. Puttaswamy (2017), a judgment that upheld the right of privacy as a fundamental right under Article 21 of the Constitution. Section 8(1)(j) of the RTI Act allows government bodies to withhold “information which relates to public information” provided its disclosure is not related to public interest or results in an unnecessary invasion of privacy. While doing so, it provides the safeguard that if the Public Information Officer or an appellate authority finds public interest in disclosing such information, it could still be available. This safeguard is important. Some information related to public servants, such as college degrees or caste certificates, might be private, but as a recent and controversial case of a bureaucrat using a fake caste certificate showed, such information could be released in public interest. Section 44(3) of the DPDP Act amends Section 8(1)(j) by allowing government bodies to simply withhold “personal information” without the safeguard provisions on public interest or other such exceptions.In a letter to Congress leader Jairam Ramesh, Union Minister of Information and Broadcasting, Ashwini Vaishnaw defended the amendment, saying that Section 44(3) was aimed at preventing the RTI Act’s “misuse” and was to harmonise the requirement of right to privacy and the right to information. He also said that information such as salaries of public officials would still remain accessible through Section 3 of the DPDP Act. But by amending the RTI Act itself — an outcome that was never the intention of K.S. Puttaswamy — and by defining “personal information” vaguely in Section 44(3) of the DPDP Act, authorities could deny RTI requests of previously public data by classifying them as “personal” — and lessen public scrutiny. The RTI Act already harmonises concerns related to the right to information and privacy by subjecting them to the question of public interest. Therefore, the amendment using the DPDP Act is unnecessary and unwarranted. The government must take the concerns of civil society and transparency activists and remove the provision amending the RTI Act, in the DPDP Act. Published - April 15, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Right to Information\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        online\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        ministers (government)",
        "headline_1": "Unnecessary amendment: On the RTI Act",
        "headline_2": "Amending the RTI Act through the Data Protection Bill is unwarranted",
        "link": "https://www.thehindu.com/opinion/editorial/unnecessary-amendment-on-the-rti-act/article69449959.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "Does the Indian university ecosystem share the Trumpian approach to foreigners?\nOne area in which US has a yuge trade surplus is international students. India alone sent over 3.3L students in 2023-24. How many make the opposite journey? Only 2893, according to the most recent All India Survey on Higher Education, of 2021-22. But per this data, only two other countries sent a higher number of students – Nepal and Afghanistan. Other top source countries were Bangladesh, Bhutan, Nigeria, UAE, Tanzania, Zimbabwe and Sudan. The list underlines how India, with all its higher ed limitations, is still an attractive destination for students from its neighbouring countries and from Africa. Potentially.\nNot only has this potential remained unfulfilled, our performance may be worsening. As TOI reported yesterday, foreign students’ enrolment at JNU has sharply declined over the last five years, particularly from Saarc countries. Plus, it now has students only from 8 countries, against 14 earlier. Why aren’t Indian universities living up to their potential? Put aside geopolitical events like the fall of Hasina or rise of Taliban. Then, the factor that’s really kept our universities back is a Trumpian approach to foreigners.\nNepal sends max students to India. Yet, when a Bhubaneswar university’s scandalous treatment of Nepalese students made international headlines in Feb, what was exposed was not an accidental but institutional racism. This tendency to demonise and/or see as inferior the people who are ‘not like us’ is spread deep and wide across our campuses. As Trump 2.0 makes international students unwelcome in US, it hollows the partnership that’s yielded countless scientific breakthroughs, plus put US at the top of the innovation pyramid. Watching that wreckage from India should leave no doubt that we need to walk the more time-tested and constructive path.\nTrumpian policies are also assaulting university autonomy. Refusing to take this lying down, Princeton president Christopher L Eisgruber is publicly campaigning that it is academic freedom and how it’s attracted the world’s finest scholars that’s built the core strength of America. Is there academic freedom in India? The ease with which seminars, movie screenings, faculty appointments et al get ‘cancelled’ suggests otherwise. Political appointments of vice-chancellors are a dead giveaway that university autonomy is on a short rein in our country. Remember, seeking to replace one intellectual orthodoxy with another is no service to knowledge. Yes, Indian higher ed has great potential. But no matter how it sings, a caged bird can’t ever soar high.\n\n",
        "headline_1": "CampUs & them",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/campus-them/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "Where all a doctor travels with your strain\nThousands of doctors work long and hugely demanding hours and they are truly honoured. But also, they are now being challenged by a new tribe of medics who follow the unholy trinity…MRI, CT Scan and X-ray.\nSo I fetch up at this clinic with this pain in the foot, wait the mandatory half hour after the appointment time, an acceptable delay, not sloppiness. When we were kids, things were so different. Your dad would usher in doc into your home, carrying his triangular bag for him. Doc would take your pulse, check your tongue and give you an APC powder and say nothing to worry about. That was that. Now, they want you to worry, that is how they can reach their quota. This lot pads up more than cricketers.\nFinally, it is my turn. No bedside manners. Doc puts on his custard yellow rubber gloves and presses the sore point. I say ‘ouch’. He says we should do an X-ray, which seems like a reasonable step in going forward, though 50 years ago the doc would have said, if a bone was broken you wouldn’t be walking, here, buzz off, take a painkiller and rest it.\nNow this guy isn’t happy with X-ray, he blithely suggests a blood breakdown called a CBC to check for an infection. Like all of the human race I am also a moth in the light helpless about the logic of the orders he is giving. Medical science stuns you into submission. You go along with the flow. Then he says, you are walking funny. Sprain your ankle and see how you walk buddy.\nHe says we should have an MRI. What is this ‘we’ thing? Whatever for? It’s a sprained ankle not Armageddon.\nHe proceeds to write the name of another clinic, which his friend runs and he says I will tell him you are coming today. He is a very nice guy (who will charge me double). I marshal my sharpest sarcy retort since we are unlikely to ever be friends and say, why not do an ECG while we are at it, like no stone unturned. He perks up and says, not a bad idea, always a good thing to rule things out.\nThat’s what this tribe is so adept at. Ruling things out except that it is you, the patient, who is jumping through coloured hoops. Talk about the sprained ankle getting a raw deal. Besides a bit part in the opening scene it’s nowhere in the script. That is what we came for…certainly not an iron deficiency test.\n\n",
        "headline_1": "Wide Ankle",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/wide-ankle/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "China’s social media is mocking Team Trump & giving ‘biz lessons’ to Americans. Xi would be loving this\nUS-China trade war appears to have sparked a Chinese meme-fest. As two govts slug it out, slapping each other’s exports with 100%-plus tariffs, Chinese netizens are deploying humour and sarcasm to do their bit. AI-generated memes featuring Trump, Vance and Musk on assembly lines, making shoes, putting together iPhones or sewing clothes, while patriotic Chinese music plays in the background are provoking chuckles across the cyberspace. Even superheroes from Marvel’s Avengers series haven’t been spared, cast in their new AI-produced roles as toiling away at sweatshops.\nIt hasn’t gone unnoticed that the tongue-in-cheek takes are being given a very tolerant treatment by otherwise quick-to-take-umbrage Chinese censors. Perhaps because these memes jive with Beijing’s official defiant stance on Trump’s tariffs. Even Chinese foreign ministry spokespersons are sharing the memes. All of this is supposedly contributing to the patriotic fervour Chinese Communist Party would like to cultivate at this point. There’s another strand too – Chinese manufacturers are also taking to social media to point out the huge brand markups their American companies slap on their products before selling them in retail. With Chinese manufacturing still very cheap, they believe that American companies – especially off-brand ones – can easily absorb the tariffs and still make profit. And, there’s a semi-humorous offer from Chinese factories to sell directly to Americans.\nXi may actually be enjoying all this. The turmoil in US economy over the last few days perfectly fits his political narrative about chaotic democracy and the so-called superiority of the Chinese system. But there’s one catch though. What if Trump further ramps up tariffs and hits Chinese cargo-carrying ships with surcharges to deter exports from China? Yes, it would be hugely disruptive for the world but also turn the heat up on Chinese businesses. You never know – with Trump.\n\n",
        "headline_1": "Chuckling Chinese",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/chuckling-chinese/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "Though corruption is commonly cited as a leading issue in many countries, what it reveals about the state of a nation is far from straightforward\nSome economists and historians see corruption as a perfectly natural symptom of early-stage development that fades as institutions mature. After all, world’s leading economy America too had its ‘robber baron’ phase, a century ago, and it passed. If this sounds like just rationalising a crime, it’s because the issue is bathed in shades of grey.\nRead full story on TOI+\n\n",
        "headline_1": "Graft’s fifty shades of grey",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/grafts-fifty-shades-of-grey/",
        "news_paper_name": "The Times of India",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "The lives of Bangladeshis are enriched with various festivals, the most prominent of which is Noboborsho (Bangla New Year). Our cultural tradition and social structure are deeply rooted in it. Even today, most farmers in the country sow seeds, harvest crops, and remember their birth dates according to the Bangla calendar.\nThe names of two Muslim rulers are notable in the formalisation of the Bangla calendar: Sultan Hossain Shah and the Mughal Emperor Akbar. However, everyone knows that Akbar was the main promoter of the Bangla calendar. On his orders, his revenue officer, Fateh Ullah Siraji, created the Bangla calendar based on the solar year and the Arabic Hijri year. At first, it was called Fasli calendar, but later, it came to be known as Bangabda or Bangla Noboborsho. The celebration of Pahela Baishakh began during the rule of the independent king of Bengal, Gaureshwar Shashanka. On the last day of Chaitra, all the subjects were obligated to pay their taxes and duties. The next day, on Pahela Baishakh, the landowners used to serve sweets to the people of their region.\nVarious festivals used to be arranged centring these two days. Gradually, it turned into a social event. One of the main events was the opening of halkhata, which means new ledger. In villages, cities or commercial areas, everyone used to close the old accounts and open new ones for the new year.\nOn the other hand, Punyah, a festival marking the annual settlement of land revenue, was first started by the Mughal subahdar of Bengal, Murshid Quli Khan, according to researcher Shamsuzzaman Khan. Murshid Quli Khan used Akbar's revenue system to start the Bangla calendar.\nThe English year begins at midnight. And the Bangla year begins at dawn with the sunrise—with a new mood, new energy, new path. The past sorrows are forgotten, and we move forward with new enthusiasm. Like the sun, the Bangla New Year illuminates us. Villages and cities are decorated with various decorations. Bangalees and many other ethnic groups participate in grand ceremonies to welcome the new year. This is how Baishakh bears witness to our tradition and culture.\nOn the first day of Baishakh in 1954, the then chief minister of East Bengal, Sher-e-Bangla AK Fazlul Haque, said, \"Today is the first day of the Bangla New Year. On this occasion, I extend heartfelt congratulations to my beloved people of East Bengal. And on their behalf, I extend my love and affection to our brothers in West Pakistan and best wishes to the people of the outside world. Our journey has begun in a new environment. We have entered the New Year with the resolve to leave the old behind and usher in a new era\" (Daily Azad, April 14, 1954).\nPahela Baishakh is the biggest non-communal and soulful festival of Bangalees. The harmony among Bangalees is universal. It is the source of strength that binds people of all walks of life. Various programmes are set to take place today for the occasion, including the Ananda Shobhajatra and the Baishakhi Mela. People will bring out new halkhata and serve each other sweets.\nThere is a mantra of getting closer during such festivals. With that mantra or the pull of the root, many will go to the villages. Many are in financial difficulty; I request the well-off to stand by them as that is the spirit of our culture.\n\"Let the dirt be wiped away, let the old be washed away, let the fire cleanse the earth\"—following these lines by Rabindranath Tagore, Pahela Baishakh helps us forget all the dirt of the past and begin anew with the spirit of harmony. Everyone wears new clothes, visits friends and neighbours, and exchanges greetings saying \"Shubho Noboborsho.\" Social relations develop through such mutual transactions.\nTo make the day memorable, many houses in the rural areas are decorated with lights. In the capital, the celebration of Chhayanaut at Ramna Batamul adds a new dimension. People are seen wearing colourful, traditional clothes. It creates a wonderful bond of respect and unity.\nThe reality is that Dhaka is now a cosmopolitan. It is home to people of many thoughts and multiple cultures and languages. They have their own cultural representation, interpretations, and ideas. Such festivals play a role in reducing the gap between the periphery and the centre.\nLove is always created from the need between people. When people and cultures are mingling together at the edges of society, it increases exchange. In 1969, 1971, 1975, and 1990, we dreamt and were disappointed. After 2024, we dream again of a new day, a new Bangla year.\nEmran Mahfuz is a poet and convener of Abul Mansur Ahmad Smrity Parishad.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "We want an inclusive society this new year",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/we-want-inclusive-society-new-year-3871151",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "When the cuckoo begins to call from the distant peaks of the hills, and the southern breeze carries the gentle fragrance of newly blossomed wildflowers in vibrant hues, the hills awaken in their own colors—ushering in the celebration of the eternal tradition of welcoming a new year and bidding farewell to the previous year.\nIt is primarily towards the end of the Bengali year that the indigenous peoples of the hills immerse themselves in this festival. Though the names vary across different ethnicities and languages, the essence remains shared. Among the Chakmas, it is known as Biju; for the Marmas, it's Sangrai; for the Mros, Changkran; the Tripuras celebrate Boisu; the Tanchangyas call it Bishu; the Ahom people observe Bihu; the Khumis, Sangraing; and the Khyangs, Sangran. Despite the variety in names, the people of the hills come together in a rich cultural fusion—marked by both diversity and a shared spirit—during the final days of Chaitra and the beginning of Baisakh.\nWhen this festival arrives in the hills, it is the final stretch of the month of Chaitra. Among the Chakma indigenous people, there is a saying: \"Chait mase rait\"—which, in Bengali, means \"The month of Chaitra brings scarcity.\" This proverb serves as a reminder that this time of year brings hardship to many indigenous households in the hills.\nAs most indigenous people are traditionally engaged in jhum or plough-based agriculture, by this point in the cultivation cycle, their granaries are nearly empty. They stand at the threshold of a new harvest, waiting for it to come in. It is during this lean season that the cries of scarcity become visible and deeply felt in their daily lives.\nYet, the underlying spirit of this festival transcends economic, social, political, and ethnic divisions, inspiring everyone to immerse themselves equally in its celebration. As a result, it touches all segments of the indigenous population—men and women, the affluent, the middle class, and the underprivileged alike.\nTo celebrate the festival, traditional games and sports are organized across villages in the hills. Songs in various indigenous languages fill the air. The Tripura people enjoy their collective Garaiya dance, moving in unison to its traditional rhythm. On the day of Phul Biju, the Chakma people offer flowers of various colors to Mother Ganga, the river goddess, as a gesture of gratitude—placing them in the waters of rivers and streams.\nBy evening, lamps are lit by the river or stream, at doorsteps, at the base of fruit-bearing trees around the household, or near the cowsheds and chicken coops. People pray for a beautiful and prosperous future. Perhaps this practice stems from a sense of gratitude toward those—human or otherwise—on whom their everyday lives depend, and from a desire to build a more abundant tomorrow.\nDuring this time, homes across the hills buzz with activity: every corner is cleaned, clothes and furniture are washed and dusted. Younger members of the household help elders bathe with care and reverence. Meanwhile, toward the end of the Mog calendar, the Marma people purify themselves with the sacred water of Sangraing.\nAt its heart, the festival carries a deep symbolic meaning—of washing away the old and the worn, and welcoming the new with hope and renewal.\nHowever, the question remains—have the indigenous peoples of the hills truly been able to celebrate this festival freely and spontaneously over time? Since festivals are reflections of lived experiences, it is essential to observe this one through the broader lens of the hill people's collective consciousness and their contemporary socio-political realities.\nIt is important to note that every festival rests upon a political and cultural foundation—a framework that supports and shapes the celebration for a specific community. The same holds true for the Chittagong Hill Tracts. This region has always played a crucial and central role in Bangladesh's political and cultural landscape. Due to its geostrategic location and the unique cultural, political, economic, and social structures of its diverse indigenous communities, the Hill Tracts remain a region of significant importance—yet also one fraught with conflict.\nThe visible and long-standing conflict between the indigenous peoples of this region and the dominant population is not only rooted in political history but also in differences in cultural practices and beliefs. As a result, the indigenous communities in this region have consistently faced oppression within the state structures created and managed by the dominant population. This conflict has also left its mark on their festivals and other cultural identities in various ways.\nNonetheless, the cultural strength that the indigenous people of the hills have built through centuries of practicing their traditional heritage allows them to partake in the festival, forgetting the oppression and wounds of the entire year. However, the unfortunate reality is that every year, indigenous students, and those working in various government and private sectors, have to present themselves to their respective authorities with a request for leave during the pre-festival period. This has almost become a routine task for them. As a result, each year serves as a reminder that indigenous communities are yet to be fully embraced as an integral part of the nation.\nOn the other hand, in what seems to be a repentance for the historical injustices done to the indigenous people, the government, in recent times, has presented these festivals in various \"inclusive\" celebrations organized by the majoritarian people. This flashy propaganda seems to divert attention from the real issues. Various government persons are suggesting that Indigenous people must be included in the Pahela Boishakh \"Mangal Shobhajatra,\" which is UNESCO-recognized and now is renamed as 'Ananda Shobhajatra.' Indigenous people, adorned in their traditional attire, will be placed in the front row of banners. The initiative may seem positive, but past experiences suggest that the state has been more adept at performing superficial actions, sidelining the fundamental demands of indigenous people. It seems that this time too, the situation is the same.\nUnless the state takes concrete steps for qualitative changes in certain areas as part of its basic responsibilities, these so-called inclusion efforts will not make the lives of indigenous people safer, nor will the celebration of the new year and farewell be spontaneous and without fear. In this regard, there are some fundamental responsibilities of the state that the policymakers need to understand.\nTo truly make the indigenous people's festivals safe and free from anxiety, the first step is the recognition of these differences. It is this dignified recognition that indigenous people have been fighting for all this time. After that, there is a need to take urgent steps to improve the human rights situation of indigenous people, so that they can focus on preserving, promoting, and spreading their unique cultural practices while recovering from the wounds of historical oppression.\nFor that, the state needs to create an open opportunity for citizens to exercise their rights, providing necessary security for the indigenous citizens of the hill areas and ensuring they have the freedom to celebrate their festivals. This year, several universities have shown some goodwill in response to the demands of their indigenous students. A positive development is that leading universities like the University of Dhaka and Jahangirnagar University have decided not to schedule exams during the time of the indigenous students' Chaitra Sankranti festival.\nAdditionally, the government has declared April 13 as an optional holiday in the three hill districts to facilitate the celebration of the festival. On the other hand, various government officials are showing solidarity with the indigenous communities by offering support and providing instructions to law enforcement agencies to ensure the safety and smooth conduct of the festival. This way, a connection can be built between the state and the indigenous people.\nThrough positive action and dialogue—guided by the spirit of the New Year celebrations and the farewell to the old—we can move towards building a truly pluralistic and inclusive state, where indigenous peoples can thrive with their unique cultural identities and become an inseparable part of a secular national structure. To achieve this, we need renewed solidarity and a shared commitment to creating a more hopeful and harmonious future.\nSatej Chakma is a writer and indigenous rights activist.\n",
        "headline_1": "New Year, Old Questions: What Will the State Do for the Hills?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/focus/news/new-year-old-questions-what-will-the-state-do-the-hills-3870981",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "\"What does the Bangla New Year mean to you?\" I could hear the question as if coming from thousands of miles away, as a journalist interviewed me on the occasion. She is the head of the Bangla section of a renowned radio station in Europe. We were discussing the Bangla New Year of 1432. As she finished her question, I paused for a while. Usually, at the beginning of a new year, the question that most people face is \"how do you feel?\" But no, that was not the question asked of me. I hurriedly put together my thoughts and somewhat answered her question. But that question did not leave me altogether. I took time to contemplate further, and it seemed that the Bangla New Year holds five meanings for me: celebration, heritage, identity, universality, and humanity.\nThe celebratory aspect of the new year is well-known. The fairs in villages, in cities, in big fields, by the roadsides; all those clay dolls, figures of horses and elephants, brides and bridegrooms; the merry-go-rounds and various games all are part of the Bangla New Year celebrations. The Baul songs in rural fairs; the musical gatherings of Chhayanaut in Ramna; dressed up men and women, boys and girls in new colourful outfits; all the happy and excited children—they all reflect the celebratory aspect of the Bangla New Year.\nIn fact, on the first day of the Bangla New Year, every nook and corner of Bangladesh is brightened. Colours come up on the sarees of women, the punjabis of men, in flower arrangements, in arcades erected. Lines take their places in alpanas, on walls, masks, and paintings. The fine arts students of Dhaka University spend the whole night before the new year drawing alpanas, finishing graffities on the walls, making masks of various colours and kinds, and creating different figures with coloured papers for the processions next morning. All of these are parts of the Bangla New Year celebration. We welcome the new year by exchanging greetings, singing songs, and savouring traditional Bangalee food. The environment around us becomes thick with the chattering of men and women, of boys and girls, and of the old and the young. Joy, excitement and interest abound all around—happiness and celebrations mark the occasion.\n\nThe Bangla New Year has an aspect of tradition based on the age-old heritage, the culture, life and the living of the Bangalee society. Some rituals have emerged over time. In some rural areas, at dawn, women swim across the ponds and in one breath and pick green mangoes from the stooping branches of a mango tree. Similarly, the act of cleaning the front yard of the house and drawing alpanas also reflect the tradition of rural Bengal. The simple faith that \"If you are fed well on the first day of the new year, you will eat well during the rest of the year,\" or the ritual of halkhata—new accounts ledger—by businesses and shopkeepers holds that tradition too.\nDuring the halkhata event, shopkeepers welcome their regular customers and serve different kinds of sweets to them with the utmost affection and love. The shopkeepers ask for the blessings of the customers so that their businesses do well the whole year. And the red-coloured halkhata, leaning against the cash box of the shop is also part of the tradition. Nearby, one can see the tips of mango leaves in a brass pot, beside which rests a pen and an inkpot.\nThe Bangla New Year has a universal aspect. On the first day of Baishakh, we come together, irrespective of colour, creed, religion and beliefs. The new year belongs to all of us—we all feel an ownership of it. Yes, there is an English New Year, and various Indigenous communities have their new years, too. Yet, over and above everything, people from all groups take part in the celebrations, enjoy the events, and observe its rituals. It is observed in villages as well as in cities; the rich and the poor observe it simultaneously.\nThe Bangla New Year calendar is exclusive to Bengal and its people. No one else in the world can claim its ownership. Bangalees observe their new year with utmost devotion, whether they are at home or live abroad. What is the reason for such devotion and excitement? This is because Bangalees link their ethnicity to and equate their identity with the celebrations. It is a symbol of our identity.\n\nThis spirit highlights our human identity along with our Bangalee identity. We identify ourselves as a part of the global humanity. We utter the prayer, \"Open our hearts,\" and we reiterate commitment \"We are humans,\" which is our original and utmost identity. With our strong faith in universalism, we hold high the virtues of tolerance, mutual respect, friendship and peace. The spirit of universalism urges us to pray, \"Connect us with everyone else and open all the doors which are shut.\" With the spirit of the universalism of the Bangla New Year, we connect with everyone else and free ourselves from all pettiness, divisive attitudes and hatred against others.\nThe relevance of all these spirits and virtues of the Bangla New Year is enormous in today's Bangladesh. Today, intolerance is on the rise in our society, and the historical communal harmony of our land is quite fragile. Our traditional virtues, with humanity at their centrepiece, seem to be struggling to hold ground. Resistance against such trends requires the spirit of the Bangla New Year to be at the forefront of our thoughts and attitudes.\nAt the dawn of the first day of 1432, when the eastern sky appears with colourful hues of the sun, when the blue sky and the calm earth is ready to welcome the new year, we should pray with all humility, \"Let our mind rise above all the pettiness, all the bad thoughts, and let us clean our mind. Let the world of tomorrow be beautiful and bright, and let us create a world of peace.\" On the first morning of the new Bangla year, let this be our desire, our prayer, and our pursuit.\nSelim Jahan is former director of the Human Development Report Office under the United Nations Development Programme (UNDP) and lead author of the Human Development Report.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "What does the Bangla New Year mean to me?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/what-does-the-bangla-new-year-mean-me-3870951",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-04-2025"
    },
    {
        "full_article": "We're heartened by the successful conclusion of Bangladesh Investment Summit 2025 that reportedly drew in some 450 foreign investors and representatives from 40 countries. During the four-day event, two investment deals were signed, while many pledged future investments. The government has rightly expressed its intent to capitalise on the momentum. As per the organisers, a \"pipeline\" of potential investments will be created based on the companies and individuals who have shown interest, and a roadmap with a timeframe of 18-24 months will be drawn up to ensure the summit's promises translate into real, long-term gains. It goes without saying that the success of this much-hyped event will be determined by how well the authorities can follow through. The challenge is not just to concretise the investment commitments, but also to uphold the post-July economic reform agenda to create an enabling environment for sustainable growth.\n\nIn this connection, we want to reiterate the importance of addressing long-standing barriers to doing business that have been repeatedly flagged by experts. While there are sector-specific concerns and vulnerabilities—such as those affecting the RMG industry, which just survived (temporarily) a tariff scare triggered by the US—barriers cutting across all sectors must be addressed with priority. Participants at the summit, for instance, raised concerns about policy inconsistency, political instability, corruption, bureaucratic red tape, lack of coordination, crises of gas and electricity, and complex approval procedures. Some of these were also reflected in a recently unveiled World Bank report that highlighted Bangladesh's top five business obstacles, including its inefficient tax structure and informal economy. Many of these problems require political commitment, so political parties, too, must step up in creating the kind of environment investors need.\n\nThe fact is, Bangladesh has significant investment potential but it cannot be fully realised without addressing these underlying challenges. While the interim government's efforts in this regard have borne some fruit, much more needs to be done. At the same time, we must acknowledge the promise shown of late by some sectors. For instance, in its report, the World Bank identified four sectors—green RMG, housing for middle-class families, paint and dyes, and digital financial services—as ripe for reform. These sectors, it argues, are mature and politically feasible enough to be restructured in ways that could create millions of jobs, draw investments, and spark a ripple effect of productivity in interconnected sectors. Among them, the RMG industry deserves particular mention. As the founder of the Korean EPZ said at the summit, if overhauled and properly supported, it could become the top global apparel exporter even as we try to diversify our export basket.\n\nTo capitalise on all such promises, we need sustained efforts from the Bangladesh Investment Development Authority (BIDA) as well as targeted interventions and broad reforms from higher authorities. The recent summit was an attempt to dispel the negative perceptions many foreign investors still hold about our investment climate because of past experiences. We can project a new, reformed image through our actions going forward.\n",
        "headline_1": "A turning point for investment—if we can seize it",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/turning-point-investment-if-we-can-seize-it-3868956",
        "news_paper_name": "The Daily Star",
        "publish_date": "15-04-2025"
    }
]