[
    {
        "full_article": "The Election Commission of India’s (ECI) completion of the Special Intensive Revision (SIR) of electoral rolls in Bihar, brings the final tally to 7.42 crore electors, a significant drop from the 7.89 crore figure before the exercise began. While the purpose was indeed to clean up the rolls, the lived reality of the exercise, including the manner in which it had to be corrected by the Supreme Court of India, renders the ECI’s ambition to extend the SIR nationwide a matter of concern. The events in Bihar warned of the dangers of adopting a default attitude of suspicion towards the electorate. While the reasons for the deletion of 65 lakh names from the draft rolls, on ostensible grounds such as death, migration, duplication and lack of enumeration, were administratively sound, the process by which they were invoked was opaque. The ECI provided no consolidated list of the excluded and no meaningful prior notice, and attached no reasons to individual cases until the Court insisted on these particulars. Reports indicated that women were deleted in disproportionate numbers, raising questions about the exercise’s accuracy. Even now, the ECI has not disclosed why 3.66 lakh names were removed between the draft and final rolls, the split of Form 6 additions, and a count of alleged foreign nationals, a raison d’être of the exercise but vagueness over which now risks erecting a bogeyman. The ECI also refused to accept widely-held identity documents — most of the poor, the illiterate, women, Scheduled Castes and Other Backward Classes lack the ones it did demand, including birth certificates and caste and domicile papers.A nationwide SIR conducted under the same requirements used in Bihar would likely replicate the same risks of exclusion. Electoral management research, including studies by the International Institute for Democracy and Electoral Assistance, points to three practices that enhance inclusion in roll revision: door-to-door verification by enumerators to supplement self-reporting; the use of widely held identity documents, such as Aadhaar and ration cards in India, to minimise barriers for citizens without birth or caste certificates; and advance publication of reasons for proposed deletions combined with an accessible appeals process. India’s prior revisions, particularly in the early 2000s, depended more extensively on local booth-level officers and physical checks, which helped to identify errors without shifting the burden entirely onto the electors. A national SIR could also draw on digital tools to consolidate and publish exclusion data while ensuring physical notice at the constituency level, balancing transparency with privacy. Such measures would help the ECI ensure that no legitimate voter is excluded, especially at a time when Karnataka’s Aland incident has raised sharp doubts on its technical competency. Published - October 03, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        election\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2025\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        migration\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        Karnataka\n                    \n                            /                      \n                        \n                        Aadhaar",
        "headline_1": "​Fraught franchise: On a nationwide Special Intensive Revision exercise",
        "headline_2": "A nationwide SIR will replicate the risks revealed in Bihar",
        "link": "https://www.thehindu.com/opinion/editorial/fraught-franchise-on-a-nationwide-special-intensive-revision-exercise/article70117354.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "India received 8% more monsoon rain this year than normal. From a bird’s eye view, this is bountiful. Official numbers suggest that the total area sown under kharif crops, until mid-September, increased by around 15 lakh hectares to about 1,110 lakh hectares. Rice cultivation has seen significant growth of over 8.45 lakh hectares to over 438 lakh hectares, compared to 430 lakh hectares during the same period last year. Pulses, coarse cereals and oilseeds have shown similar trends. In India’s main reservoirs, the total available water capacity is, as of late September, 163 BCM (billion cubic metres) up from the 157.8 BCM last year. 1 BCM is trillion litres. However, torrential rains, particularly in August and September, saw several districts in Himachal Pradesh, Jammu and Kashmir and Punjab inundated — even cut off — after swollen rivers breached their flood marks. In Punjab, entire villages have been inundated, sinking farmland. While not a story unique to this year, there have been several landslides and flooding (urban and rural). Land erosion and siltation were widespread across the country leading to colossal damage.Seasonal rainfall over northwest India, central India and the south peninsula were 27%, 15% and 10% more than their seasonal averages. In several instances, there were reports of ‘cloudburst’ — in meteorological terms, a very specific definition when State officials reported a deluge. Only in a single instance, in Tamil Nadu, did this actually bear out. While technical definitions might appear as a quibble, they influence the public perception of such events. A ‘cloudburst’ suggests something that is exceedingly rare and unforeseen, whose brunt must only be borne. On the other hand, even terms such as ‘normal’ rainfall — even though their visible impact can be, frequently, as damaging — also tend to convey fait accompli. A resignation to fate. Since April, the India Meteorological Department (IMD) has consistently pointed to seasonal rainfall being “above normal” or at least 4% more than the long period average of 87 cm as per its forecast. Whenever its figures bear out, it is framed as a victory of forecasting and less a failure of adequately preparing for calamity. While the establishment has forever been psychologically primed to treat a warning of drought as worth bracing for on a ‘war footing’, excess rains are seen as natural munificence. With developments in forecasting technology and the know-how to improve infrastructure, it is high time that this framing is modified. Failure to do so ought to be seen as an abdication of the government’s responsibility to the public. Published - October 03, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        Monsoon\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        water\n                    \n                            /                      \n                        \n                        Himachal Pradesh\n                    \n                            /                      \n                        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        Punjab\n                    \n                            /                      \n                        \n                        flood\n                    \n                            /                      \n                        \n                        rivers\n                    \n                            /                      \n                        \n                        avalanche/landslide\n                    \n                            /                      \n                        \n                        natural disasters\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        government",
        "headline_1": "Changing the frame: On India, forecasting and natural events",
        "headline_2": "India must use forecast to better prepare for calamities",
        "link": "https://www.thehindu.com/opinion/editorial/changing-the-frame-on-india-forecasting-and-natural-events/article70117364.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "Caste acquired a bigger profile in the state’s politics after Nitish Kumar’s caste survey. But this very fragmentation of caste groups also stops his ally BJP from emerging as the state’s uber-dominant party\nAmid Bihar’s electoral rolls row, and state polls mere weeks away, political parties have been refining their electoral strategies. But as usual, caste remains at the centre of candidate selection.\nThere is a temptation to present any election in bipolar terms. Five years ago, Lalu Prasad declared that the election was a fight between agda (forwards) and pichhda (backwards), pitching BJP as the party of traditional upper caste elites. In 2024, INDIA coalition had also sought to present the campaign in dual terms, advocating for more substantive care of backward groups.\nRead full story on TOI+\n\n",
        "headline_1": "Bihar’s Janta & Parties",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/bihars-janta-parties/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "America’s MAGAtma & our Mahatma\nMAGAlomaniacs make the merely mega ones seem like models of Gandhian humility. Oct 2 is the right day to appreciate how many of the Mahatma’s 11 vows Doland-ji has made his own.\nSatya. Trump’s Experiments with Truth are unending. Not just bending it to his whim, he has X-ed out other platforms and expanded this core principle to ‘Truth Social’. He has thus cleverly incorporated the Gandhian message of social justice.\nAhimsa. Hear this: ‘Only the PREJUDICED LYING MEDIA damns me the ANTITHESIS of non-violence. Nothing can be further from the TRUTH SOCIAL. You don’t believe I stopped Operation Sindoor? Go ask that Paki fella who came with his box of coloured rocks to IMPRESS ME. More important, by siding alternately with ‘Pootin’ and ‘Whatshisname’, I’ve warned them that neither of you can depend on the US of Arms, So you better make peace. And let me get my much-deserved Nobel.’\nSwadeshi. No one has made a bigger impact in getting so many countries to boycott American goods and turn to self-reliance. His ‘good friend Narrendur’ acknowledges this in every speech. ‘Hey Vance, what’s that word Injuns like yer wife have for praise? Ah yeah, tarrif.’\nAparigraha. Trumpji’s H-1B tightening is ‘selflessness’ personified. The world’s brightest and best will now stay home or flock to non-American countries. This will level the economic playing field, endorsing his mantra, MOGA: Make Others Great Again.\nAsprishyata/Sparshbhavana. Remember how, till recently, no one could touch America, or even come near its excellence in every sphere? Trumpji has singlehandedly succeeded in removing that ‘untouchability’.\nSatyagraha. Gee!, POTUS non-cooperates with countries begging for more reasonable tariffs. Wow!, he’s even made Lotus one non-cooperate with his demands. Non-violently.\nSarva dharma sambhav. Doesn’t he treat all faiths, other than his own, with equal contempt?\nSharira shrama. MahaTrump has manifestly internalised the principle of ‘bodily labour’. Have you any idea how much time he labours over just his hair?!\nSee, the MAGAtma clearly believes in ‘Gandhisn’ vows. Only, his spelling’s not too good.\n                                          ***\nAlec Smart said: “UNESCO tag for Chhat puja ok. But religion and politics should be kept polls apart.”\n\n",
        "headline_1": "Dos and Don’s",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/dos-and-dons/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "6-point-something GDP growth won’t make India a developed country. The asking rate is 12-plus now\nA surplus monsoon bodes well for agriculture and rural demand this year. GST reforms, which kicked in 10 days ago, are also expected to spur consumption. So, RBI’s revised growth forecast of 6.8% isn’t surprising. It seems like a small increment from 6.5%, but in a $4tn economy each fraction of a percentage point amounts to billions of dollars. Yet, it’s nothing to celebrate when Trump’s tariffs have cast a shadow over roughly $50bn worth of goods exports.\nEven otherwise, 6.5% or 6.8% isn’t an aspirational growth rate for India. As the finance ministry has said more than once this year, India needs to grow at 8% “every year, at least for a decade” to become a developed country by 2047. Yes, India remains the fastest growing major economy, but relative performance doesn’t improve living standards. In the late 1990s, when India’s population was growing at 2% per annum, economists recommended a 9% growth target for 7% effective growth – to double income every 10 years. Now, although population growth has slowed to about 1% per year – based on estimates in the absence of a census – 8% is the slowest acceptable GDP growth target.\nHowever, a new Morgan Stanley analysis shows even 8% might be too slow. To address the growing problem of unemployment, the asking rate must be 12.2%, it says. The report points to record youth unemployment – 17.6% – and a surge in agricultural employment, which are faces of the same coin. Growing farm employment is in fact the clearest sign of a jobs crisis. As countries develop, agriculture’s share in employment and output shrinks. Farm work accounts for only 1.2% of employment in US. But in India, this year’s Economic Survey showed agriculture’s share in employment increased from 44.1% in 2017-18 to 46.1% in 2023-24.\nOver the next 10 years, 84mn Indians – equal to the population of Germany – will hit working age. So, creating good jobs for them has to be a national priority. Long-neglected manufacturing, whose share in GDP had slipped to 15.9% in 2023-24 from 16.7% in 2013-14, should be the preferred engine for this, because it creates more related jobs than services. That’s how US built its middle class in the 1950s, and China in the 2000s. The vision of developed India hinges on this.\n\n",
        "headline_1": "2 Sixes, Please",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/2-sixes-please/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "ICMR study shows how ruinous our diets are to our health. Policymakers, sit up \nListen carefully to what ICMR-India Diabetes study has to say – a cross-sectional population based survey weighted for region, age and gender, conducted from Nov 2008 to Dec 2020. Prevalence of generalised obesity is at a huge high of 29%, abdominal obesity at almost 40%, type 2 diabetes (T2D) at over 11%, prediabetes at over 15%. To put this in context, take the fact that non-communicable diseases (NCDs) account for almost 70% of deaths in India. And NCDs are caused by conditions substantially created by poor diet – low quality carbs (white rice, milled whole grains, and added sugar), low intake of protein and high levels of saturated fats. Now, the argumentative Indian would insist that pan India’s basic rice-atta/maida staple has no parallel – at her own peril. For India has rapidly undergone dietary transition alongside ever-increasing physical inactivity. And it’s not as simple as just replacing ‘bad’ carbs with fancy organics.\nIn fact, ICMR found that replacing refined cereals with whole wheat/ millet flour without decreasing overall carbohydrate quantity doesn’t reduce risk of T2D or abdominal obesity. The survey found that risk of T2D or prediabetes can be reduced by 6-10% if carbs are replaced with fish or egg – but meat does not have the same impact. Also, barring Jharkhand, Chhattisgarh, Arunachal and Manipur, no state met recommended saturated fat intake. While urban India is more overweight, and leads far more sedentary lifestyles than rural India, a total of 61% pan India was physically inactive, 43% overweight, 26% obese. The north had the highest rates of overweight people (54%). Nearly a third of India’s population has hypertension (27%). This highly significant ICMR study comes not a day too early – policymakers must get down to formulating the changes that will help fix diets, increase protein intake, cut sugars, etc to eventually reduce NCDs, a ticking health bomb. \n\n",
        "headline_1": "Curb The Carbs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/curb-the-carbs/",
        "news_paper_name": "The Times of India",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "He had moments of discomfort and embarrassment—pressed into calling the Qatari prime minister by his host to apologise for striking Doha and made to pay lip service to the prospect of a Palestinian state—but Israel's Benjamin Netanyahu had many reasons to be pleased. On September 29, US President Donald Trump advanced a peace proposal that essentially preserves Israeli pre-eminence regarding the fate of Palestinians, though it entails a cessation of hostilities, an affirmation that Gazans would not be expelled (those leaving would have the right to return), and an injunction against Israeli annexation of the strip. But Hamas, militarily and politically, would have to surrender all claims, with the Palestinian Authority shepherded and supervised by foreign powers.\nTrump's peace proposal comprises 20 points. They include a \"deradicalised terror-free zone,\" Gaza's redevelopment for the benefit of its people aided by \"a panel of experts who have helped birth some of the thriving miracle cities in the Middle East,\" and an immediate end to the war on its acceptance by the parties. Israel would withdraw to an agreed upon line in anticipation of a hostage release, during which all military operations would cease pending complete withdrawal. All hostages, dead and alive, would be returned within 72 hours, to be followed by the release of 250 Palestinian life sentence prisoners and Gazans detained since October 7, 2023. \nHamas and militant factions will forfeit any role in governing Gaza, with any offensive infrastructure and equipment destroyed, but any of its members wishing to commit to \"peaceful co-existence\" and decommissioning of weapons will be granted amnesty, with those wishing to leave given safe passage to receiving countries. Compliance by the militant group will be overseen by \"regional partners.\" Full aid would resume, with the UN and Red Crescent restored to their role as chief distributors.\nOn the issue of governance, a temporary technocratic \"apolitical Palestinian committee\" of qualified Palestinians and \"international experts\" would form a temporary transitional body, subject to a \"Board of Peace\" personally chaired by Trump. Most unfortunately, it is likely to include such figures as Sir Tony Blair, the Middle East's typhoid Mary when it comes to peace. The transitional authority would hold the reins till reforms by the Palestinian Authority (PA) are completed. With immediacy, however, the US would work with Arab and international partners to deploy an \"International Stabilisation Force\" (ISF) to Gaza. The ISF will be responsible for training Palestinian police forces and provide support in terms of vetting recruits, with assistance from Jordan and Egypt.\nThe proposal clearly envisages a significant role for the ISF, though it says who will comprise it. Israel will not, under the plan, occupy or annex Gaza, surrendering what territory it has taken to the ISF. Even if Hamas were to delay or reject the proposal, the Israeli Defense Forces (IDF) would still hand over occupied territory of \"terror-free areas\" to the stabilisation force but retain a security perimeter to stem \"any resurgent terror threat.\"\nThe plan also envisages the establishment of an interfaith dialogue to promote the values of peace between the parties, and a \"credible pathway to Palestinian self-determination and statehood\" if the programmes for Gaza's redevelopment and PA reform take place as planned. A vague US promise to \"establish a dialogue\" between Israel and the Palestinians regarding peaceful and prosperous co-existence rounds off the points.\nThere was palpable grumbling from the Israeli camp. Netanyahu undoubtedly harbours ambitions of finishing \"the job,\" and there is little to say the war will not resume once the Israeli hostages are returned. Having previously rejected any governing role of the Palestinian Authority in Gaza, he now reluctantly accepts the idea subject to a \"radical and genuine overhaul\" of the body. \nFinance Minister Bezalel Smotrich, one of the right-wing heavies in the Israeli cabinet, is threatening to withdraw his Religious Zionist Party from the coalition. Agreeing with the plan had been \"an act of wilful blindness that ignores every lesson of October 7,\" and it would only \"end in tears,\" he said. Fellow zealot, National Security Minister Itamar Ben-Gvir, is also likely to be seething.\nOpposition leader Yair Lapid is also suspicious of Netanyahu, who tends to say \"yes\" when visiting Washington, \"standing in front of the cameras at the White House, feeling like a breakthrough statesman.\" On returning to Israel, however, he always seemed to add a qualifying \"but,\" his political base always reminding him \"who the boss is.\"\nIn keeping with history, the Trump plan, even if it were to be implemented to the letter, enshrines the essential subordination of Palestinian goals to the dictates of other powers. Palestinian military presence is not only to be curtailed but essentially eliminated altogether. Hamas, never consulted regarding the peace terms, is to accept its own effacing. The PA is to accept its own subservience and infantilisation. The Gazans are also to accept an economic and development programme dictated and directed from without. Statehood is to be kept in cold storage till appropriate, controlled conditions for its release are approved—and certainly not by the Palestinians themselves. They, it would seem, remain the considered errant children of international relations, mistrusted and requiring permanent, stern invigilation.\nThis article first appeared on Countercurrents.org and Scoops International News on October 2, 2025.\n\nDr Binoy Kampmark was a Commonwealth scholar at Selwyn College, Cambridge. He is a senior lecturer at RMIT University, Australia. He can be reached at [email protected].\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Palestinian subordination: Donald Trump’s Gaza peace plan",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/palestinian-subordination-donald-trumps-gaza-peace-plan-4000126",
        "news_paper_name": "The Daily Star",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 03, 2025 00:00:00  \nThe introduction of the Public Procurement Rules (PPR)-2025, in place of the earlier 2008 framework, represents a major policy shift in management of one of the largest channels of public expenditure in Bangladesh. With government procurement estimated at around $30 billion annually, the implications of these reforms extend far beyond purchasing-it is about governance, accountability and the credibility of public institutions. At the heart of the new rules is the mandatory use of electronic government procurement (e-GP) for all public agencies. This move decisively ends decades of manual tender submissions, which were notorious for inefficiency and systemic corruption. According to the Bangladesh Public Procurement Authority (BPPA), nearly 35 per cent of government purchases were still conducted through paper-based processes even after the e-GP's introduction in 2011. This loophole left ample space for manipulation and syndication. The PPR-2025 closes that door, mandating that even the smallest procurements must be carried out digitally.\nThe abolition of the long-debated 10 per cent price cap is another bold step. While originally intended to prevent abnormal bidding, in practice, it fostered collusion and political interference by allowing bidders to manipulate outcomes within a controlled margin. Removing the cap is expected to bring more competition, although it also demands stronger evaluation mechanisms to prevent underpricing or reckless bidding, leading to compromise on quality. Beyond digitisation and pricing reforms, the PPR-2025 embeds sustainability and international best practices into procurement. The rules expand procurement categories to formally include physical services like maintenance and security, introduce framework agreements for efficiency and create a debarment board to blacklist habitual offenders. By requiring disclosure of beneficial ownership, the system also strikes at the use of proxy contractors-a common route for vested interests to capture tenders. These measures, if enforced rigorously, could elevate procurement from being a breeding ground of corruption to a platform for fair competition and responsible governance.\nAnalysts note that the reform is not merely technical but also structural. Public procurement has long had a trickle-down effect on governance: when contracts are awarded through manipulation, project costs rise, service quality falls and public trust erodes. By enforcing transparency and accountability in procurement, the government indirectly strengthens governance in infrastructure, health, education and other vital sectors. However, the success of the PPR-2025 will hinge on institutional capacity. Digitisation alone does not eliminate malpractice unless officials are trained, systems monitored and violations penalised. Many ministries and agencies still lack adequate technical expertise and administrative readiness to fully operate within a digital-only environment. Without capacity-building and strict enforcement, loopholes may re-emerge in new forms. Similarly, sustainable procurement, while commendable in principle, requires well-developed evaluation criteria and sectoral guidelines to avoid maintenance of a mere formality.\nThe reforms have rightly drawn appreciation from diverse quarters. Yet their true test will be in implementation-whether the rules translate into fairer competition, improved service delivery and greater public trust. In this sense, the PPR-2025 is not just about procurement but also about the state's ability to modernise governance and align public spending with accountability and development priorities.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "PPR-2025: A step towards transparent governance",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ppr-2025-a-step-towards-transparent-governance-1759415158",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Nilratan Halder   |  \n       October 03, 2025 00:00:00  \nLoss and waste of foods have ever remained a cause for serious concern. This has prompted the United Nations (UN) to observe the International Day of Awareness of Food Loss and Waste (IDAFLW) since 2020. Clearly, the global attention to this critical issue was belated. Even after the UN General Assembly proclaimed September 29 as the IDAFLW and co-convened by the Food and Agriculture Organisation (FAO) and the United Nations Environment Programme (UNEP), there has hardly been any progress in reducing loss and waste of food at the time of observing the sixth edition of the day. One-third of the food produced globally is lost or wasted until now. \nRaising the international community's awareness of food loss and waste can make a huge difference in availability of food for those who need it most. The Sustainable Development Goal Target 12.3 aims at halving per capita food waste at the retail and consumer levels by 2030 and cut food losses during harvest and post harvest periods all along the supply chain. These include transportation, storage and distribution among the consumers at affordable prices. \nHappily, a conference titled \"Towards Zero Food Waste and Loss: Building a Food Value Chain in Bangladesh\" was jointly organised by the Centre for Policy Dialogue (CPD), the embassy of Denmark in Bangladesh, the World Bank (WB) and the FAO. The title of the conference speaks for itself. But the food losses sustained by this country are little higher at 34 per cent than the global rate. The loss amounts to 4.0 per cent of its GDP. Studies show that 8.0-15 per cent paddy is lost after harvest and 20-40 per cent vegetables wasted. The combined loss is valued at $2.4 billion annually. \nA study titled \"Bangladesh Food Loss and Waste Diagnostic\" unveiled at the conference reports that of the 34 per cent food losses, the share of rice is 23 per cent, fish 36 per cent and mango 29 per cent. Bangladesh can ill afford such losses of food. A lack of proper storage facilities for perishable produce is largely to blame. Last year the country produced more onions than it needs and yet it had to import this tunicate bulb because of post-harvest losses. Apart from the direct economic loss, its implication is far-reaching. \nRoughly, a little over one-third of agricultural land on an average could be spared on-farm activities, avoid greenhouse gas emission and environmental degradation. Yet the output would be the same had there been no such losses. The shortfall of supply in the value chain triggers inflation of agricultural commodities in question. While food waste is more common in rich and developed countries, food loss is a major concern for poorer parts of the world. However, the rich segment of society in underdeveloped nations is also prone to waste food. \nIn countries like Bangladesh known for their vulnerabilities to climate change, stemming losses of agricultural produce is a prerequisite for their food security. Production alone is no guarantee for ensuring this. Involved in the system are storage facilities, transportation and distribution. This year's potato cultivation has exposed the policy failure of the agriculture ministry. Cropping of any farm produce should not be overwhelming. \nEven then production of a popular crop like potato in excess could be fairly disposed of if only farmers were guided to follow the best of agricultural practices. This starts with improved seeds and ends with maintenance of phytosanitary standards. There are demands for potato in many countries. But unless issues like phytosanitary concerns are addressed, export of potato or other vegetables will be impossible. Thus the importance of storage facilities, modern cold storage to be precise, comes to the fore. The cold storages are in the private sector. Owners of those cold storages can dictate terms in the bargain because of the perishable nature of the crops. \nThe government has warehouses for stocking staples like rice. It should have its own cold storages for farm produce, particularly for perishable ones. The stages at which onions, potato, fruits and vegetables go to waste are well known. So, the transportation of delicate produce must also follow the rules to avoid degradation of qualities. If adequate modern cold storages are built by the government, the unilateral diktat of the private sector can be brought to an end. Then a pool of modern cargo vehicles can be developed under the supervision of the Bangladesh Road Transport Corporation (BRTC) in order to facilitate transportation of perishable commodities. \nThe loss sustained every year outweighs the cost of developing facilities for storage and transportation. Infrastructure development is nothing temporary as the facilities continue to serve for years together. The country's population will grow until 2050 and demand for food will also increase. With the climate change, challenges will be more daunting to feed the population. Smart agriculture can meet the challenges with doubling or tripling production of crops. Agricultural land will shrink further on account of housing for more people. Then there is the threat of the country losing 17 per cent of its territory to sea level rising. All this unfolds an ominous prospect for this land-scarce country. This country can ill afford loss or waste of food.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Addressing the problem of loss and waste of food",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/addressing-the-problem-of-loss-and-waste-of-food-1759415191",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       October 03, 2025 00:00:00  \nResidents in Dhaka woke up to find the city under water on October 1 when there was a staggering 132 millimetres of rainfall in just six hours between midnight and 6:00 am. By the end of the day, the total rainfall reached 203 millimetres, the highest recorded in the country during this period. October 1 is Ashwin 16 on the Bengali calendar with Ashwin 1 marking the late Autumn season. Bangladesh is not used to seeing such cloudbursts in late Autumn. It is unimaginable for anyone that rain in this season will turn streets into streams, leave low-lying neighbourhoods inundated, and bring the daily life to a halt for millions of residents.\n Why is it happening? Experts and environmentalists believe it is one of the bizarre developments triggered by climate change. They believe what Dhaka witnessed on October 1 cannot be seen in isolation. It is part of a global trend where climate change is responsible for erratic weather patterns.\nBangladesh has always been vulnerable to natural disasters like floods and cyclones, but climate change is amplifying both the frequency and intensity of the disasters. The country is not alone to suffer from climate change impact. The entire South Asian region is witnessing a rise in frequency and intensity of natural disasters. Cities like Mumbai in India and Karachi in Pakistan have also faced record-breaking rainfalls in recent years.\nBut in Dhaka, rapid unplanned urbanisation, clogged drainage, loss of wetlands and plastered surface area worsen the situation. Rainwater here finds fewer escape routes to pass. So even moderate rainfall results in waterlogging and when 132 millimetres of water falls in six hours, the city's system is overwhelmed.\nThe implications of heavy rain often go beyond temporary waterlogging. Water stagnation affects public health, damages infrastructure and reduces productivity. It creates fertile breeding grounds for mosquitoes, raising the risk of dengue, chikungunya and other vector-borne diseases. For the urban poor who live in slums or other informal settlements, downpour means losing bedding, clothes, and cooking materials to rainwater. The economic cost of such a cloudburst is immense, though often underestimated. It forces small businesses to shut down, causes loss of perishable food items, and compels daily wage earners to stay home. For example, the October 1 downpour inundated most parts of the Karwanbazar kitchen market, damaging huge quantities of goods and leaving the traders struggling to pump out water from the market. The rain-induced transport paralysis translates into crores of taka in lost productivity. Delays in delivery of goods, absence at workplaces and damage to vehicles and property are not fully measured, but anyone can guess that cumulatively they weigh heavily on the national economy.\nNow the pressing question is what can be done to prevent Dhaka from sinking further into crisis with every downpour. Urban planners have long been arguing that the city's wetlands and canals must be protected and restored. Despite their call, unplanned real estate development has filled up natural drainage channels over the past few decades, leaving rainwater with fewer places to go. The Buriganga, Turag, and Balu rivers, once considered lifelines for Dhaka, are now choked with encroachments and pollution while many of the city's drains are clogged with solid waste and polythene bags. The city requires urgent measures to restore its natural water flows. It also needs massive improvement in its drainage system and drainage management. At the same time, citizens must be encouraged not to dump waste into canals and drains.\nThe October 1 rainfall also highlights a lapse in our climate adaptation policies at the national level. Bangladesh has earned international recognition for its climate resilience strategies in rural areas, particularly in cyclone preparedness, but urban resilience is lagging behind. The government must prioritise urban climate adaptation, ensuring that infrastructure keeps pace with changing climate realities.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Record October rainfall and its implications",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/record-october-rainfall-and-its-implications-1759415229",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 03, 2025 00:00:00  \nIn today's fast-paced world, multitasking is often celebrated as a sign of capability. Students handle classes, side projects and club work simultaneously, while professionals hop between emails, meetings and deadlines without pause. At a first glance, this seems admirable, being busy feels productive. But the hidden truth is that excellence in one craft outweighs mediocrity in many.\nDespite its popularity, multitasking is not real productivity; it is rapid task-switching. Neuroscience shows that our brains cannot fully focus on two demanding tasks at once. Attention constantly shifts back and forth, and every switch comes at a cost: lower accuracy, slower execution, and reduced focus. We feel active, but our output suffers. Multitasking creates the illusion of progress. Errors increase, memory retention drops and complex understanding rarely develops.\nCreative and intellectually demanding tasks, such as writing, problem-solving, or learning a new concept, rely on uninterrupted focus. These tasks require entering a state of flow, where ideas connect and originality emerges. When the mind is constantly interrupted, results remain surface-level: they may look complete, but lack depth and innovation. Over time, this approach fragments progress, leaving us doing many things halfway instead of mastering anything fully.\nThe emotional cost of multitasking is also significant. Constantly juggling multiple responsibilities can increase anxiety, as it is impossible to give 100 per cent to any task. Even when several items are completed, satisfaction is short-lived. There is a brief dopamine hit, the fleeting sense of accomplishment, but it quickly fades, leaving us questioning whether we truly achieved something meaningful or merely stayed busy following everyone else's path. This is the hidden cost of multitasking: not just reduced efficiency but a loss of depth, originality and fulfilment.\nThe solution is simple: doing more does not create better results; doing better things does. Focusing on one task at a time allows us to learn more, perform better and create work that truly represents our ideas and capabilities. \nMultitasking may offer the illusion of progress but mastery, depth and originality are born from sustained focus. The question we should ask ourselves is not, \"How much can I do at once?\" but rather, \"What could I achieve if I gave one thing my full attention to?\"\nMusrat Jahan Efat\nDepartment of Accounting and Finance\nNorth South University\nmusrat.efat.232@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why doing more makes us learn less",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-doing-more-makes-us-learn-less-1759415274",
        "news_paper_name": "The Financial Express",
        "publish_date": "03-10-2025"
    }
]