[
    {
        "full_article": "Three sets of data — January’s industrial production, February’s retail inflation and the performance of mutual funds in February — present a contrast between India’s real economy and the financial markets, that is both concerning and heartening. In the real economy, February’s 3.61% retail inflation is a seven-month low aided by a steady and welcome fall in food inflation, which had reached a 15-month high of 10.87% last October. February’s food inflation, which is a barometer of people’s spending on monthly groceries, fell to an almost two-year low of 3.75%. This would come as a relief to India’s policymakers who had hoped for a spike in consumption demand to buttress the government’s full year GDP growth target of 6.5% for the 2025 financial year. February’s 3.61% retail inflation is also well within the Reserve Bank of India’s (RBI) medium-term 4% inflation target, signalling a probable, albeit much-needed, repo rate cut at a time when there has been a liquidity squeeze in the domestic financial system due to the worrisome flight of foreign investors as they hedge against a depreciating rupee, the U.S.’s proposed tariffs-induced inflation and global uncertainties.The RBI’s February 7 0.25 basis point repo rate cut, from 6.50% to 6.25%, after a gap of five years, signalled the central bank’s intent to raise capital flows in the real economy, to spur economic activity while continuing to focus on inflation moderation. Amid the ₹1.7 trillion liquidity squeeze in the banking system due to the flight of foreign portfolio and institutional investors, the RBI conducted two tranches of dollar/rupee swap auctions, with another one slated for later this month. This is expected to inject over ₹2 trillion into the banking system to address long-term liquidity concerns. Despite such concerns in the financial system, January’s industrial production print at an eight-month high of 5%, up from December’s 3.55%, is another indicator of the resilience in the real economy, as growth was led by an increase in the output of primary, intermediate, and infrastructure and construction goods. Meanwhile, the panic among retail investors was palpable from the February equity mutual funds (MF) reporting numbers. Inflows into MFs plunged 27% with the fourth month of declining stock returns. Retail investors, largely from the salaried middle and upper-middle classes, had flocked to the stock markets post COVID-19, but fresh Systematic Investment Plans dipped to 44.6 lakh, the lowest in the fiscal year. Therefore, while the volatility in the financial markets could be worrisome, but temporary, the buoyancy in the real economy makes the hit bearable. Published - March 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        economy (general)\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        food\n                    \n                            /                      \n                        \n                        inflation and deflation\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        construction and property\n                    \n                            /                      \n                        \n                        mutual funds\n                    \n                            /                      \n                        \n                        Coronavirus",
        "headline_1": "​Acceptable contrast: on the real economy",
        "headline_2": "A buoyancy in the real economy could provide long-term relief",
        "link": "https://www.thehindu.com/opinion/editorial/acceptable-contrast-on-the-real-economy/article69326763.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "Prime Minister Narendra Modi’s visit to Mauritius this week, and his meeting with its newly elected Prime Minister Navin Ramgoolam, marked a decade since his last visit. His trip aimed to strengthen the India-Mauritius strategic partnership and launch new economic and development initiatives. While Mr. Ramgoolam’s previous tenure (2005–14) overlapped briefly with Mr. Modi’s, the two leaders have maintained close ties. Even during India’s strict COVID-19 lockdown, the Indian government facilitated Mr. Ramgoolam’s medical evacuation to India. Acknowledging this support, Mr. Ramgoolam warmly welcomed Mr. Modi as a guest at Mauritius’ National Day celebrations where he was also conferred the highest national award. Though not India’s closest geographical neighbour, Mauritius remains deeply connected to India. Over 70% of Mauritians are of Indian descent, with enduring cultural ties to India. While Mr. Modi’s engagements highlighted these shared historical and cultural bonds, the visit was primarily focused on strategic priorities. India seeks to strengthen its partnership with Mauritius as a key player in the Indian Ocean, an African nation, and a link to the Global South.As part of this deepening partnership, the two leaders upgraded their strategic ties and committed to increased defence cooperation. India also announced several major economic initiatives, that include bilateral trade in national currencies, support for a new Mauritius parliament building, and a ₹487 crore credit facility to improve water infrastructure. These projects build upon previous Indian-led developments, such as an airstrip and jetty in the Agalega islands, the Mauritius Metro rail project, and the New Supreme Court Building. The visit also carried geopolitical implications. Mr. Ramgoolam has expressed a desire to renegotiate Mauritius’ agreement with the U.K. regarding sovereignty over the Chagos Archipelago, home to a U.S. military base in Diego Garcia. While India helped broker the previous deal under Prime Minister Pravind Jugnauth’s government, it has assured Mr. Ramgoolam of its full support in whatever course he chooses. Meanwhile, India is also watching China’s growing footprint. China’s strategic partnership with Mauritius includes a free trade agreement and bilateral trade worth $1.1 billion — double that of India-Mauritius trade at $554 million. With the PLA Navy’s increased presence in the Indian Ocean, Mr. Modi’s announcement of the MAHASAGAR doctrine is significant. At a time when shifting U.S. foreign policy threatens the international rules-based order, disrupts trade, and risks fragmenting global alliances into rigid spheres of influence, Mr. Modi’s visit has underscored India’s commitment to strengthening regional ties and reinforcing partnerships with trusted friends. Published - March 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Mauritius\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Coronavirus\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Maldives\n                    \n                            /                      \n                        \n                        Seychelles\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        history and culture\n                    \n                            /                      \n                        \n                        railway\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        armed Forces\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        award and prize",
        "headline_1": "​Old ties, new priorities: On India-Mauritius ties",
        "headline_2": "The Modi visit to Mauritius focused on present-day imperatives",
        "link": "https://www.thehindu.com/opinion/editorial/old-ties-new-priorities-on-india-mauritius-ties/article69326695.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "The Greek god who gave fire to humans has a lot to answer for, from internet to nuclear bombs\nThe other day I fell into the Prometheus trap; or rather, my car did. When the ignition button was pressed the engine wouldn’t start. Bunny suggested we use the ignition key to start it. I said that our three-year-old car doesn’t have an old-fashioned ignition key. It has a battery-operated fob that opens and shuts the vehicle’s doors and starts the engine.\nOn that day the fob wouldn’t work because the battery was dead. So for the sake of a two-rupee battery, a large and complex machine costing several lakhs had been rendered totally useless.\nFortunately, we had a spare battery at home and we managed to get the car moving and be on our way. But what if we hadn’t been at home, but on some desolate nocturnal highway and the fob had decided to go on strike, leaving us stranded, at the mercy of prowling brigands and assorted antisocial elements?\nThat’s when I thought of Prometheus, the Greek god who gifted fire to humankind, which provoked a wrathful Zeus, the CEO of Gods Inc, to punish the gift-giver by chaining him to a rock where his liver was daily snacked upon by an eagle.\nThe gift of Prometheus, the patron of arts and sciences, liberated humans from the dark confines of night, enabling them by the light of the flame to keep awake and have extra time to think and invent things.\nAnd the next thing you knew, we’d gone and invented the wheel, and then a car to put the wheels on, and then a car with not an ignition key, but a battery fob to start it with. Which it won’t do if the battery’s defunct.\nThanks to the Promethean flame of creativity, we have internet, and X, and deepfakes, and the multi-billion-dollar enterprise of cyber fraud.\nThe spark of fire gave rise to molecular science, the splitting of the atom, and nuclear energy, and warheads that can annihilate all of humanity.\nTechnological advancement is like an enormous unstoppable boulder rolling downhill, gathering speed as it does. That’s the Promethean trap. Which is also known as Progress. \n\n",
        "headline_1": "The Prometheus trap",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/the-prometheus-trap/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "The power of colours is never about the colour itself. It’s what we make of them, for good or bad\nWhether you are brave on Holi, or buried in a hidey-hole, you can’t avoid colour. Mandatory songs, which someone always plays full blast, will soak you in ‘rang’, like it or not. If you don’t, console yourself that colour is not real. It’s in the software of your mind, not in nature’s hardware. The physical world only has wavelengths of reflected energy. What you process as green may be red to an alien. It’s alright as long as you don’t run into them at a traffic light.\nLike many unreal things – ghosts, money, to name two – colour is powerful. It unites us under flags. It divides us by race, and faith. And in just those three ways it has shaped history. We aspire to gold and settle for silver, or bronze. We desire greenbacks and green cards, not red and yellow cards. Clearly, the power of colour is never about colour itself. Blue sky and sea, and green tree canopies are pretty. Not so blue skin and green bread. Context matters. Kings wore purple because it was scarce, hence expensive. Had alchemy worked, gold would have fallen off its pedestal.\nWithout being real, colour conveys reality, as when fruit is ripe, bread toasted and coffee roasted. Black is not even a colour, but ignore black clouds at your own peril. Henry Ford was famously happy making Model-Ts in black, but choice is better for business. How many black pants and white shirts can you have in your wardrobe? Trump’s ‘Beast’ is black but he just picked a red Tesla. And don’t scoff – red is not the colour of youth. Stars turn redder with age. Our Sun is middle-aged and still white. Will you be red, yellow, green and blue by afternoon? If you haven’t made up your mind, pick a pill like Neo in The Matrix. Red or blue? \n\n",
        "headline_1": "Tinted ‘Truths’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tinted-truths/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "Putin has to say yes or no to Trump’s Ukraine deal. Neither answer’s easy for him\nIt’s decision time for Putin. After Ukraine agreed to a US proposal for an interim 30-day ceasefire earlier this week, Putin now has to take a call on accepting the proposal unconditionally. Trump’s envoy Steve Witkoff is already in Russia for talks. But in what could be a negative signal, Putin’s key aide Yuri Ushakov has said that Russia will prioritise a long-term settlement of the conflict over a temporary pause. If Moscow rebuffs the deal, Ukrainians will be proved right that Russians aren’t interested in peace. For the past three years, Putin has framed the Ukraine war as one provoked by Kyiv and its Western partners. That was used to justify a nationalist vision to reclaim the ‘Russkiy Mir’, Russian sphere of influence. But this project is incomplete for Moscow without subjugation of Ukraine. A pause in the fighting right now would mean Russia would lose battlefield momentum just when it’s made some advances.\nSo, Trump called Putin’s bluff. Either Putin agrees to the interim ceasefire or confirms to the entire world that Russia’s military aggression was always driven by an imperial desire. Trump has threatened to keep supporting Ukraine if Putin says ‘no’. Note that US restored military aid and intelligence sharing with Ukraine after it agreed to the ceasefire proposal. Now, the Polish leadership has called on US to deploy its nukes in Poland, an ominous sign for Moscow.\nBut taking that call will be difficult for Putin. Reuters, speaking to Russian sources, revealed that many in the Russian system believe the ceasefire proposal to be a trap, and accepting it at this stage would allow Ukrainian forces to recover and rearm. There are also those who believe that Russia’s acceptance of the deal ought to be linked to lifting of sanctions or recognition of Russia’s ‘annexation’ of four Ukrainian regions – that Moscow doesn’t fully control – plus Crimea. That, however, is not on the cards. Plus, pro-war voices in Russia who count as Putin’s core political support base have trashed the ceasefire proposal. Putin himself told a group of war widows that Moscow has no intention of stopping.\nBut Putin has to take a call at some point. Trump is staking a lot of political capital on this ceasefire. Moscow’s reluctance could see him turn his Republican MAGA base against Russia, creating truly bipartisan support for Ukraine in the US Congress. Putin can no longer keep his cards close to his chest. The dangerous ball is in his court. \n\n",
        "headline_1": "War and pause",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/war-and-pause/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "It worked for so many greats. Ask Mr Birla \nThey have all the Deewar-appointed swag, but like Shashi Kapoor’s character these guys put mater above material goods. Kumara Mangalam Birla didn’t quote the now-iconic ‘Mere paas maa hai’ line, but came close at the ET Awards for Corporate Excellence  last Saturday. Accepting the Business Leader of the Year trophy, he rewound to Class 1 when he was called on stage to receive the Best Student prize from the Chief Guest – but forgot to thank that worthie. The next day the Principal severely berated him for this inexcusable lapse . The six-year-old heard out the tirade, and then said, ‘Sir, I didn’t remember to do this because I was busy looking at the shining eyes of my proud parents in the audience.’ Mr Birla, now 57, then added, ‘Today, I’m again holding a valued award, but looking at the shining eyes of my proud mother in the first row.”   \nAll other eyes in the power-packed theatre glistened too.\nThanking everyone  bar  pet pooch and part-time help is mandatory at all  award ceremonies, but this was the choke-up moment. My mind spiralled to two other tycoons, Rai Bahadur M.S Oberoi and Captain CP Krishnan Nair. While researching their biographies, I was constantly reminded that both owed first debt to their mother — indigent women far from ‘Tata-Birla’ shorthand for immeasurable wealth. \nBhagwanti Oberoi was a doughty Sardarni who, widowed at 18 and hating the taunts,  had simply picked up her one-year-old and walked to her maternal home in Bhaun, now in Pakistan. She didn’t stick to the parathas, but instead learnt from her moneylender father, all the while pushing little Mohan along on her intrepid drive. How else would a callow youth have found the audacitiy to waylay the English manager to ask for a job at The Cecil Hotel, Raj Simla’s snootiest? Years later, he could mop up funds to buy his own first hotel there thanks to Bhagwanti’s network of Punjab fief lords; even princes get strapped for ready cash. \nMadhavi Amma lived in even more obscure Kunnavil in Kerala’s Kannaur district, tirelessly drying coconuts for copra, oil and husk. She forced ambition down the throat of her  little ‘kochukrishnan’ along with the meagre breakfast of fermented rice-water spiked with lime pickle – and nightly tales of mythic Malabar warriors. She badgered a local politician to get him into Raja High School instead of  dropping out after  Oorpozhassikavu Elementary like his poor, Vaniya peers. Madhavi Amma’s instilling of self-worth gave our Dalit lad the gumption  to  stride to the dais and deliver a spontaneous paean to chief guest, Valiya Chirrakal Raja himself — who, as impressed as flattered, paid his  fees right through college. Next, Madhavi Amma astutely used a humble prawn pickle to push Krishnan on the radar  of  powerful VP Menon, who would become mentor and door opener.  \nTo their dying day, both legendary hoteliers said ‘mum’s the word’. Loud, clear and gratefully.\n                                             ***\nAlec Smart said: “Yes, we need delimitation – on boundaryless politicking.”\n\n",
        "headline_1": "The ‘Maa’ paas-word",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/247615/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "Moody's recent downgrade of Bangladesh's banking system outlook from \"stable\" to \"negative\" is deeply concerning. This marks the third time since 2023 that Moody's has downgraded Bangladesh's rating. Initially, the agency downgraded Bangladesh's sovereign rating, followed by the ratings of specific banks—though the impact extended beyond them. Now, it has downgraded the entire banking sector. Unfortunately, this series of events paints a bleak picture of the country's economy.\nGiven the previous downgrades, this latest development was not entirely unexpected. However, it could have been avoided had earlier concerns been addressed and negative trends reversed. As Moody's highlighted, key issues—such as deteriorating asset quality, high inflation, and slowing economic growth—continue to undermine banks' profitability and financial stability. The agency also pointed to \"structural risks to banks' asset quality, such as lax regulations and poor corporate governance,\" which remain unaddressed. Meanwhile, the government is expected to continue supporting banks through regulatory forbearance and liquidity measures to mitigate contagion risks.\nWith non-performing loans (NPLs) on the rise, Bangladesh's banking sector faces mounting asset risks. In this context, the negative outlook also reflects the government's declining capacity to support banks in times of crisis. However, one silver lining is that Moody's expects liquidity across the banking system to remain stable, albeit tight.\nThis downgrade is likely to further erode investor confidence. Foreign investors may become even more reluctant to invest in Bangladesh, while existing investors could consider withdrawing. Additionally, banking transaction costs may rise, and opening letters of credit (LCs) could become more expensive, placing further strain on businesses and the economy.\nThe negative outlook reflects broader economic challenges, including prolonged instability and deepening financial sector vulnerabilities. Political uncertainty, concerns over law and order, and various forms of unrest are likely to have an even greater economic impact. Moreover, disruptions in supply chains—particularly within the garment sector—and weakening demand both domestically and internationally pose significant risks that the government must urgently address.\nTo restore confidence and improve its credit rating, Bangladesh must implement urgent reforms in both the banking sector and the broader economy. Strengthening corporate governance, enforcing stricter banking regulations, and addressing NPLs should be top priorities. The government must also enhance regulatory oversight, ensure better risk management practices, and increase capital buffers in line with Basel III standards to bolster financial resilience. Additionally, fostering transparency, reducing political influence in lending decisions, and promoting financial inclusion are essential to help rebuild investor trust.\n",
        "headline_1": "Moody’s recent downgrade is a big blow",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/moodys-recent-downgrade-big-blow-3847296",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "It was quite an experience to be invited by the National Citizen Party (NCP) to attend their inaugural Iftar party last Tuesday. I enjoyed being there. I remembered my own first attendance as a student at a somewhat similar event. It was the 10th National Conference of the East Pakistan Students Union (EPSU), held in the late sixties at the Engineers' Institute. The similarity lay in the composition of the participants—mostly young students. Their energy, their dreamy eyes, and the eagerness in everything they did took me back nearly six decades to my own young dreams of building an egalitarian society, as most of us then were fully converted to the Marxist views that permeated the progressive ideologies of that era.\nBangladesh needs a new political party with youthful energy, spirited patriotism, and genuine love for the poor and downtrodden. We need a party full of dreams for a future without any shackles of oppression and exploitation. We need a party that will take us to the future and not drag us into the past. For too long, we have been governed by a politics and politicians whose only interest was to promote personal and partisan interests. We need a political party truly devoted to serving the interests of democracy, the rights of all, and prosperity for the masses.\nThe NCP seem full of potential. Some fundamental issues remain unclear—its ideological orientation, acceptance of our diversity, approach to our cultural heritage, views on the role of religion in politics, short- and long-term goals, etc. It should publish its party charter as soon as possible.\nA smell of change was mildly, almost imperceptibly, floating in the air. There was an atmosphere of expectation that most of us strongly felt, and a definite sense of determination that I silently admired. As I sat amidst a splendidly diverse group of students and guests, I realised the wide appeal of NCP and its potential to emerge—if not immediately—as a significant political party.\nWhile I sat and watched the event unfold and heard the three speeches of their top leaders—the very fact that only three spoke and not a plethora of them impressed me—the question that was repeatedly crossing my mind was: are these students and their leaders fully equipped to handle the challenges of setting up a new political party, especially in the face of the disappointing performance of past political parties? Are they aware that thousands of venomous snakes were hovering around them, waiting with boxes full of ill-gotten money to flood them with? Will they be able to judge which offers of help are genuine and which ones are traps? Will they be able to change the culture of sycophancy that so afflicted our traditional parties?\nThe history of Bangladesh from 1972-1991 is a mixture of euphoric beginnings with endless dreams of making a modern, secular, democratic, and prosperous country, which ended with the formation of a one-party state and the assassination of Bangabandhu. This was followed by two military coups that brought in two generals—General Ziaur Rahman and General HM Ershad—into power, both of whom formed their respective parties while in power—Bangladesh Nationalist Party (BNP) and Jatiya Party (JP)—that ruled Bangladesh in the subsequent years.\nThree of our major political parties—AL, BNP, and JP—all became dynastic, with the founding family driving them. Their inner democracy was non-existent, with the various levels of party hierarchy being selected rather than elected, and that also at the whim of one person. Ironically, Jamaat was the only one that followed some structure of bottom-up representation.\nLooking back over the last 54 years of independent Bangladesh, and especially over the last 34 years since the restoration of democracy and elected government, there are vital lessons to be learned about the role of political parties.\nThe saddest part was that they always put the leader's interest above that of the party, and the party's above that of the nation. Not public interest, but the party's benefit was the goal. None of the big parties had any internal democracy, and their inner workings were totally centralised to the extent of one person making all the decisions—his or her wish was the command. Nepotism and cronyism were the order of the day, which inevitably led to the emergence of loyal groups that usurped the party hierarchy and destroyed discipline. They never held their annual organisational elections on time and in a free and independent manner. It was always top-down selection of leadership from the lowest tier to the very top, except for the top post and a few of their favourites.\nOver the years, party positions could be \"availed of\" for money, and the term \"nomination trade\" became prominent every time we had national elections. MP nomination seekers had to spend enormous amounts to get the party ticket. All of that money was retrieved after becoming an MP, as a large portion of the development funds became means of \"returns for investment,\" which, of course, was many times over the original. What was called a donation for the party fund was, in effect, extortion for personal gain, not necessarily always for the top person but for everyone along the way who could influence the process.\nCorruption was ingrained in the political parties, which spread to the bureaucracy, and the corrupt elements within it took full advantage and quickly, enthusiastically, and irretrievably aligned themselves with that process. The police became an instrument of coercion, abuse, and extortion. The involvement of the political parties in widespread corruption ensured that the bureaucracy, the police, the judiciary, and, of course, the corporate world would never be held accountable. A section of the media, forced by its owners and some willing journalists, became a part of it.\nIt is in this background of myopic, shortsighted, and self-serving history of our political parties that a new political party, led by students of the July-August movement that liberated us from the clutches of corrupt dictatorship, is being formed. How they will fare is the big question of the moment.\nThe fact that NCP avoids terms like party president, secretary-general, etc, and calls themselves \"convenors\" is a good sign. It narrows the differences in their hierarchy. At the Iftar referred to above, I heard one over-enthusiastic announcer calling their leader \"jana neta\" and \"ek dafar ghoshok.\" This should be avoided. Let's not fall into the trap of self-promotion and let history judge who is what.\nGetting into power should not be the main motivator of NCP, but public service. The most important party culture to pursue, and one that will distinguish it from others, will be accountability—both to the public but equally importantly, to its own grassroots workers. A vital practice to be inculcated is financial transparency. The absence of this mostly destroyed all our traditional political parties. Today, AL looks like the most rotten party ever because it was in power with total impunity. BNP looks good because it has been oppressed and forcibly kept out of power through rigged elections. One can only guess what it would look like if things were different. As Jamaat has mostly been out of power, we have no data to judge them on the \"money\" issue. During the period it held two vital ministries in a coalition government with BNP, questions did circulate about its unethical behaviour. Today, it is mostly accused of pushing its candidate into vital posts, not on the basis of merit but party loyalty. This is corruption in another name.\nNCP held two expensive but necessary events—the Manik Mia Avenue launch and the Intercontinental Iftar. We think they both were sponsored, which can be accepted only if the sponsors' names are made public. As a new party, it will obviously need sponsors. A good idea would be to take multiple sponsors, never one or two, and on the condition that they do not insist on secrecy. Make their names public. This will set NCP apart in a way that will give them tremendous credibility—which is vital in the present context and at this stage of party formation.\nWe need a new political party, and we need one that is rooted in a recent struggle against all forms of abuse of power. But we also need a new political culture, including a change in the functioning of political parties. It must be democratised and made accountable. We repeat, many of our failures can be directly attributed to the culture of putting the leader's interest above that of the party and the party's interest above that of the nation. NCP has the potential to change all of this.\nThree practices—accountability, transparency, and inner democracy—will make all the difference. We wish them all the best on this new journey.\nMahfuz Anam is the editor and publisher of The Daily Star.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Will the new party spark a new political culture?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-third-view/news/will-the-new-party-spark-new-political-culture-3847156",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "The United States has long been the world's premier destination for innovation, drawing the brightest minds from across the globe. With its unmatched financial resources, world-class research institutions, and a risk-taking culture that fuels technological breakthroughs, the US has cultivated an environment where ambitious thinkers thrive. The country has built an ecosystem that rewards talent and creativity, making it a magnet for scientists, engineers, and entrepreneurs who push the boundaries of possibility. This ability to attract and invest in global talent has been a key driver of the US's dominance in artificial intelligence (AI) and other cutting-edge technologies.\nHowever, the landscape is evolving. The recent success of DeepSeek, an AI model developed in China, has disrupted the industry, proving that world-class AI can be created at a fraction of the cost. Unlike models from OpenAI or Google that require immense computational power and financial backing, DeepSeek demonstrated remarkable efficiency by utilising only a fraction of the GPUs typically needed for large-scale language models. This milestone underscores a broader shift: Asian countries are no longer just suppliers of talent for US companies; they are becoming AI powerhouses themselves. This shift is further reflected in the increasing presence of Asian talent in the US tech industry. With 71 percent of AI researchers in the US being foreign-born and a majority hailing from Asia, the statistics speak for themselves—35.9 percent of Microsoft's AI team and 44.8 percent of Google's AI researchers are of Asian descent. \nWhat makes Asian talent so exceptional? The answer lies in the unique motivations that drive these individuals. Unlike their Western counterparts, who often have access to ample resources, many Asian innovators grow up in environments where they must navigate scarcity and intense competition. This fosters a problem-solving mindset, resilience, and an ability to maximise efficiency with limited means. In countries like Bangladesh, students develop an extraordinary work ethic from a young age, competing for a limited number of top university spots and thriving in challenging conditions. Despite the increase in higher education institutions, the quality of education remains a pressing issue. Many universities focus on infrastructure rather than investing in skilled faculty or research facilities, and there is no robust mechanism to measure educational quality. As a result, students seek better opportunities abroad, where they can specialise and gain practical knowledge tailored to industry demands.\nMany of Bangladesh's brightest students have showcased their talents on the global stage, excelling in international competitions and pursuing higher studies at prestigious institutions abroad. A notable example of local ingenuity is Avro Keyboard, a free and open-source Bangla keyboard developed in 2003 by young innovator Mehdi Hasan Khan and his team. Over the years, it has become an indispensable tool for Bangla typing and was honoured with the 2025 Ekushey Padak in recognition. This innovation underscores Bangladesh's potential to contribute meaningfully to the technological landscape, demonstrating how the country's youth can drive innovation and make significant strides in the global tech arena.\nBangladesh, a country with immense intellectual potential, finds itself at a crossroads in this shifting global dynamic. The number of students going abroad for higher studies has tripled in 15 years, despite significant growth in local higher education institutions. In 2022, at least 49,151 Bangladeshi students went abroad to study in 58 countries, a sharp rise from 16,609 in 2008. Although the number of universities has doubled in the same period, the outflow of students has not slowed due to challenges such as limited research opportunities, outdated lab facilities, and political instability. The lack of skilled faculty, research funding, and infrastructure prevents them from thriving within the country, leading to a continuous brain drain. \nTo harness the potential of its bright population, Bangladesh must learn from countries that have successfully reversed the brain drain. China, for instance, implemented policies to bring back top researchers by offering competitive salaries, advanced research facilities, and government-backed funding programmes. Similarly, India's expanding AI and tech ecosystem is creating opportunities that encourage talent to return home. Bangladesh can adopt similar strategies by investing in AI research centres, fostering collaboration between academia and industry, and providing financial incentives for researchers to develop groundbreaking technology within the country. Creating a startup-friendly environment and strengthening AI infrastructure will allow Bangladesh to not only retain talent but also attract global investments.\nThe global AI race is no longer just about talent migration—it is about fostering innovation at home. While the US continues to benefit from Asia's intellectual capital, the balance is shifting. However, Bangladesh has a golden opportunity to leverage its human potential and become a significant player in AI. By investing in its brightest minds and providing them with the resources they need, the country can position itself at the forefront of the AI revolution. If Bangladesh embraces the momentum of innovation, it can transform from a talent exporter to a leader in global AI innovation.\nRuhina Tabasshum Prome is research associate at Bangladesh Institute of Governance and Management (BIGM).\n\nShirin Sultana is research associate at BIGM.\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "DeepSeek’s AI triumph: A call for Bangladesh to retain its brightest minds",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/deepseeks-ai-triumph-call-bangladesh-retain-its-brightest-minds-3846976",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Disaster insurance: A tool to help farmers",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/disaster-insurance-a-tool-to-help-farmers-1741878306",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Restoring due process of law",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/restoring-due-process-of-law-1741878370",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Construction trouble in Dhaka",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/construction-trouble-in-dhaka-1741878417",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Air pollution hindering brain development",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/air-pollution-hindering-brain-development-1741878444",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-03-2025"
    }
]