[
    {
        "full_article": "Jammu and Kashmir bore the brunt of Pakistan’s response to Operation Sindoor, and Union Home Minister Amit Shah rightly focused on both security and development during his visit to Poonch, where residential areas were hit by shelling from across the border. A comprehensive relief package is planned alongside the construction of more underground shelters for civilians. The J&K government is still in the process of assessing damages, but Poonch was by far the worst-affected district. A preliminary report submitted by a committee set up by the BJP to the Ministry of Home Affairs identified 1,500 houses — 690 in Poonch and 534 in Uri — that were damaged in the indiscriminate shelling. At least 18 civilians — 14 in Poonch alone — lost their lives. Pakistani shelling hit towns in Poonch, Baramulla, Kupwara and Rajouri, and the damage to civilian infrastructure was considerable. Mr. Shah on Friday visited the affected regions, expressed solidarity with the people, and handed out job appointment letters to the kin of those who lost their lives. Earlier, the Leader of the Opposition, Rahul Gandhi, and representatives of the Trinamool Congress visited the victims.These border residents felt heard, their sense of fear dissipated to some extent, and their morale boosted by these visits. The Indian Army’s statement on the India and Pakistan ceasefire “not having an expiry date” is reassuring for the border residents. Life is limping back to normalcy with residents returning to their homes, many of them shattered by the shelling. The J&K government is struggling to meet the demands of the affected population. This was evident from the relief amount approved up to ₹1.2 lakh to fully damaged houses. The affected and displaced residents described it as “insufficient” for them to return to their once-concrete and multi-storey houses. Against this backdrop, Mr. Shah’s promise of a relief package is a ray of hope. Around 9,500 bunkers — 8,000 in the Jammu division and 1,500 in the Kashmir Valley — have been built by the Centre so far. However, there is a growing demand for individual bunkers in sparsely located populations in border areas of J&K, especially in the Kashmir Valley, to ensure civilians manage to shift to safer locations immediately in case of shelling by Pakistan. The Centre and the elected government in J&K should work in tandem to help border residents who are in distress. Published - May 31, 2025 01:08 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025",
        "headline_1": "Rebuilding J&K: On Amit Shah’s visit",
        "headline_2": "Civilians need physical and economic security to recover from the shelling",
        "link": "https://www.thehindu.com/opinion/editorial/rebuilding-jk-on-amit-shahs-visit/article69638862.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "India’s factory output performance measured monthly by the Index of Industrial Production (IIP) and released by the Ministry of Statistics and Program Implementation (MoSPI) slowed to an eight-month low of 2.7% in April, at the start of fiscal 2026. It also marked a steep decline, almost halving from last April’s 5.2% growth. This correlates with the monthly gauge of the eight core sectors by the Ministry of Commerce and Industry, which posted a 0.5% growth in April, also an eight-month low. More significantly, it is a steep decline from last April’s 6.9%. The eight core sectors make up about 40% of the weight of items included in the IIP. This comes on the back of a 4% growth in industrial output for the last fiscal, which was the lowest in the past four years. Of particular concern is the contraction in mining by 0.2%, the first since August 2024. While the absolute value of mining exports has risen in the past decade from $25 billion in FY15 to $42 billion in FY25, its share in exports has fallen from 8.1% to 5.1%. This still constitutes a not-so-insignificant share in India’s overall goods exports at a time of great trade volatility. However, both manufacturing and power production also slowed to 3.4% (4.2%) and 1.1% (10.2%), respectively, in April.While trade and tariff-related uncertainties are most likely to have impacted goods output, the continuing contraction in consumer non-durables’ output for the third consecutive month suggests persistently low rural consumption, as essentials such as food make up a significant portion of consumer non-durables. This is a clear indication that despite retail inflation hitting an almost 6-year low at 3.16% in April, it has not translated into higher spending power for rural communities, where consumer non-durables have the most demand. Food prices contracted for the sixth straight month to 2.14%, which led to below MSP rates for most staples at mandis. The government must focus on raising rural incomes by implementing MSPs for farm produce more systematically. This would aid in increasing rural consumption. However, a surge in capital goods output to 20.3% in April, albeit from a low base, indicates confidence in the domestic economy as investors continue with their plans to diversify exports, attempting to rely less on the U.S. With trade-related sectors expected to continue to stay volatile in the near-term, the Centre must push the private sector to increase capital expenditure at home. This will increase incomes, and aid in raising consumption demand. Export-oriented sectors must also aim to ring-fence themselves from tariff, price and supply chain shocks by ensuring a robust domestic presence, while also diversifying outside the traditional export regions of the U.S. and the EU. Published - May 31, 2025 01:05 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        economic indicator",
        "headline_1": "Steep decline: On the Index of Industrial Production",
        "headline_2": "Rural consumption remains poor despite the lowering of inflation",
        "link": "https://www.thehindu.com/opinion/editorial/steep-decline-on-the-index-of-industrial-production/article69638881.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "Women at the frontlines, men in the kitchen\nIndian women remain officially excluded from frontline combat roles. But led by Assistant Commandant Neha Bhandari, half a dozen women BSF personnel deployed at the international border in Akhnoor, found themselves defending two forward posts during Op Sindoor. Seizing this opportunity, they battled heavy Pak fire for three days and nights, leaving their post only after forcing the enemy to retreat. The first co-ed batch has also graduated from NDA. These developments mark women overcoming some of the most entrenched resistance in society’s prestige roles.\nWhat’s weird is how widely women are still waiting for their ‘firsts’. India has never had a woman CJI. Many Indian cities are yet to see a woman cabbie, in many others there are few women behind the wheel at all. If their representation remains sparse across vast civilian spaces, it is not because of formal rules or regulations. These can be as gender evolved as in Scandinavia, but also a total chimera. Because our social norms remain of a medieval variety. Statistics ministry’s new Time Use Survey says this starkly. Female participation in ‘food and meals management and preparation’ is 76%, male 6%. So, though women’s literacy has expanded to 77% from 9% at Independence, their domestic shackles haven’t loosened much.\nThis is why India’s 37% female labour force participation shamefully lags Japan’s 55%, China’s 60% and Vietnam’s 63%. However much this hurts the nation’s growth, the drag on individuals is more acutely painful. Young women don’t just have to find a job in a tough job market, they have to beg their family to let them do it. And now, AI is about to remake the jobscape. The only way for India to ride this sea change is to let women navigate it on strong, independent terms. As for meals, the men better cook their fair share. \n\n",
        "headline_1": "For tomorrow’s sake",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/for-tomorrows-sake/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "Fascinating research on neuroscience of ideology\nIdeological extremism is usually explained by social, economic and demographic factors. There’s not enough research on how individual thinking patterns can make some people more likely to support violence in defense of their beliefs or group. That’s what Leor Zmigrod dives into in The Ideological Brain: A Radical Science of Susceptible Minds. Does ideology shape our brains, or do our brains shape ideological leanings?\nIs there a neuroscience of free will, could extreme worldviews be rooted in cognition and biology? It all depends on how sharp the brief is. What’s being studied? Political identities or radicalisation or religion? Is the research on brain areas that do the decision-making, or regions for emotional processing? Is focus on brain structure, or on brain function? Is there a ‘how’ in the mix, finding a mechanism, or is it simply a search for an effect?\nThe book asks as many questions as it answers as it threads together neuro-research, politics and philosophy to also shine a light on the scope of future research. Zmigrod and political neuroscientists like her are asking how deeply into our brain can ideological systems penetrate. “How far into the mind and body indoctrination really goes.”\nExperiments included mapping neural/brain activity and the region where it was happening when participants were exposed to political videos, news etc. Obedient actions evoked brain patterns different from free choices. A 2011 study that compared sizes of liberal and conservative brains found more conservative people had a larger right amygdala than political liberals.\nAmygdalae are twin brain bits that store emotional ‘feels’ of negative emotions such as threat, fear & disgust, and information we internalise on social hierarchies. A brain part’s size is linked to its processing capacity, but the degree to which anatomy responds to or depends on function is still under study. Enter the chicken-’n-egg puzzle. Do individuals lean towards more conservative ideologies because they have larger amygdalae or does being immersed in ‘system-justifying ideologies’ – status quo – and conservatism lead to structural brain changes?\nBut, aha, size doesn’t matter, says the book. Two sets of scientists found that liberal participants had a larger ACC – a central sausage-shaped thingamajig incharge of emotional processing and cognitive control – but couldn’t replicate the results in later tests. Zmigrod argues it’s not the size, but function that matters. When it comes to ideological thinking, ACC is “haughtily aware of its own importance”.\nThe queen is the prefrontal cortex (PFC) – that deals with complex decision-making and high-flying mental computations. More the damage or injury to PFC, more conservative the person. Those with a damaged PFC would identify extreme statements as moderate. Those with intact PFC would spot extreme for what it is. So, to be progressive, all you need is an undamaged PFC?\n“Not so fast,” says Zmigrod. Because PFC’s like a transport hub making sense of all the info zigging in and zagging out to and from all parts of the brain – it’s never a standalone. And then there’s dopamine. Most rigid individuals have specific genes that impact how and where dopamine is distributed through the brain – less in PFC, more in parts that control instinct. These pathways can be traced to discover the neurochemistry of ideology.\nSumming up: The book says, greater the uncertainty, the more susceptible the brain is to dogmatism. Most leaders are creating ever-new uncertainties. What’s that doing to people?\n\n",
        "headline_1": "Do our brains shape our political views?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/do-our-brains-shape-our-political-views/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "You got plenty to worry about\nMusk has left the DOGE building. It’s hard to say who’s happier – Musk himself, or his baiters – but odds are, Vivek Ramaswamy marked the day with a platter of cheese enchiladas. Like taxes and death, Musk’s exit was a given. US law allowed him a maximum of 130 days, and he left with one remaining. As an EV maker, he knows the importance of reserve charge. And range anxiety is a terrible thing. You aim to drive $2tn out of the federal budget but stall at $160bn. That’s 8% mission accomplished. Poor, but better than a hat-trick of SpaceX’s Starship failures in five months.\nSo, Musk should pull over and take stock. On the net worth front, allying with Trump has been good for him. Yes, some Teslas were burnt, and Tesla stock nosedived, but it’s much higher than at this time last year, and Musk is about $175bn richer than he was at the same time. And while he’s leaving after describing Trump’s Big Beautiful Bill as disappointing, Trump’s not nursing a grudge – “He will, always, be with us…Elon is terrific.” That means, govt contracts for SpaceX won’t dry up, and Lil X can pick his nose in the Oval Office. What Musk should worry about is BYD’s fast-charging tech, Tesla’s falling sales, bursting Starships, and Neuralink’s competition. Nobody will remember Musk as Trump’s beancounter, but as ‘Rocket Man’ – who once went shopping for Russian ICBMs to launch satellites – he has better odds.\n\n",
        "headline_1": "Memo to Musk",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/memo-to-musk/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "When the Make in India initiative was launched in 2014, it set a target of achieving 25% of GDP from manufacturing by 2025. In reality, the share of manufacturing has remained almost constant at about 16%. Amidst this underperformance, one state that stands out for getting 25% of GSDP from manufacturing is Tamil Nadu. Read full story on TOI+\n\n",
        "headline_1": "Tamilian dollar answer",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/tamilian-dollar-answer/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "It is deeply regrettable that even now—nearly 10 months since the August 5 political changeover—dubious cases filed in connection with the atrocities committed during the July uprising continue to make a mockery of our justice system. The latest victim to face the guillotine of such a case is SM Anowara Begum, a retired professor of Jagannath University (JnU) and a freedom fighter. Reportedly, Dr Anowara was sent to jail by a Dhaka court on Thursday, following her arrest the previous day. She, along with 192 others, faces the charge of attempted murder in a case filed by former JnU Chhatra Dal general secretary Sujon Molla, who was injured during clashes in July.\nFiled about seven months after the incident, the case naturally raises questions about not only the motive behind its lodging but also the lack of credible evidence linking the accused to the alleged crime. In fact, all such cases can be distinguished by their mass listing of accused and the incredulous nature of the allegations themselves. And as we have argued before, the lumping together of those who aided or committed the July atrocities and those who merely extended moral support to the Awami League regime is not just legally tenuous; it also opens the door to exploitations, complicates the trial process, and invites question marks over the outcome of ongoing trials.\n\nThe current process for filing cases does not require police officers to verify claims at the outset, allowing anyone to lodge complaints. But officers were instructed not to arrest innocent individuals implicated in such cases. Why, then, did they arrest a 69-year-old struggling widow, who could not possibly have been involved in the crime she was accused of? Why did the investigation officer demand in court that she be denied bail, calling her a flight risk? Why did the magistrate concerned accept it and send her to Kashimpur? And why could the home or law ministry not intervene over the two days when this saga played out? \nThe implication of Anowara, with no known history of violent activism, further reeks of personal/political vendetta as evidenced by the list of the accused, which includes, among others, 10 teachers and five officials from JnU itself. Only fair investigations may reveal whether their selection was random or carefully orchestrated to settle old scores. The question is, why do the police keep accepting or acting on cases that clearly exhibit such red flags?\nWe understand that the current process for filing cases does not require officers to verify claims at the outset, allowing anyone to lodge complaints. But officers were instructed not to arrest innocent individuals implicated in such cases. Why, then, did they arrest a 69-year-old struggling widow, who could not possibly have been involved in the crime she was accused of? Why did the investigation officer demand in court that she be denied bail, calling her a flight risk? Why did the magistrate concerned accept it and send her to Kashimpur? And why could the home or law ministry not intervene over the two days when this saga played out? We cannot just blame the justice system or those filing dubious and retaliatory cases if those involved in the very system keep failing to do their jobs properly.\nWe talk about these failures mostly when people of some repute are implicated in dubious cases. But what about the many ordinary citizens and professionals whose lives are being quietly ruined? All the talk of police and judicial reforms would be meaningless if such state-enabled injustices are allowed to persist unchecked. Reforms must begin with mechanisms to prevent and penalise the misuse of legal provisions, ensure accountability of police officers and magistrates, and guarantee that no citizen is denied justice or protection from legal harassment. The interim government can no longer look the other way.\n",
        "headline_1": "Stop the state machinery quietly enabling dubious cases",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/stop-the-state-machinery-quietly-enabling-dubious-cases-3907401",
        "news_paper_name": "The Daily Star",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "We are concerned about the relentless forest grabbing in Sonadia Island. During the AL regime, individuals connected to the government razed vast acres of forest on the island, and alarmingly, the destruction has continued even after the regime's fall. Since August 5, over 1,000 acres of protected mangrove forest have been reportedly cleared for shrimp and crab farming. This came to light after grabbers recently set fire to piles of felled trees to destroy evidence of their activities.\nOver the years, Sonadia's encroachers have cleared more than 3,000 acres of mangrove forest to establish shrimp enclosures. With the latest 1,000 acres encroached, the total now stands at 4,000. We wonder why the concerned authorities are unable to stop these illegal activities. In October last year, the High Court ordered relevant officials to remove illegal shrimp projects, take legal action against those destroying the mangroves, and submit a compliance report within 90 days. On November 28, the Supreme Court upheld this order, directing the government to stop mangrove destruction immediately. Yet forest grabbing, along with shrimp and crab farming, continues in this ecologically critical area. This is deeply unfortunate.\n\nLast July, the Department of Environment (DoE) filed a case against 26 individuals, mostly linked to the AL, for seizing 128 acres of forest land in Sonadia, temporarily halting their action. But they soon resumed it in the absence of administrative follow-ups and legal consequences. Again, on May 18 this year, the DoE filed a case against 20 individuals, including a local BNP leader this time. This shows how the encroachment business has continued to enjoy political support regardless of the political transition, for which BNP and other parties must answer.\nWhile the relevant officials have sometimes taken actions, those have been mostly ineffective. For instance, last July, the Department of Environment (DoE) filed a case against 26 individuals, mostly linked to the AL, for seizing 128 acres of forest land, temporarily halting their action. But they soon resumed it in the absence of administrative follow-ups and legal consequences. Again, on May 18 this year, the DoE filed a case against 20 individuals, including a local BNP leader this time. This shows how the encroachment business has continued to enjoy political support regardless of the political transition, for which BNP and other parties must answer.\nWe urge the authorities to make lawsuits against forest grabbers effective by ensuring swift case disposal and strict punishment. While the Sonadia administration has reportedly conducted some drives to stop the grabbers, these were insufficient. Such efforts must be increased. Moreover, the DoE must assess the actual scale of forest loss as the figures mentioned in official cases reportedly fall far short of reality. While the interim government's cancellation of land allocated to the Bangladesh Economic Zones Authority (BEZA) for establishing an eco-tourism park on the island is reassuring, it must now take comprehensive actions to stop the culture of forest grabbing.\n",
        "headline_1": "Save Sonadia Island’s mangrove forests",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/save-sonadia-islands-mangrove-forests-3907236",
        "news_paper_name": "The Daily Star",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "Food safety in public hospitals is not merely an operational issue but a legal right for patients. It goes without saying that hospital-prepared food should be tailored to a patient's medical condition. Furthermore, the hygiene, safety, and nutritional value of the food must be ensured. Reports from hospital food vendors, unfortunately, point to unhygienic food preparation and vending environments, with a lack of adequate food safety measures. There is also insufficient data on hygienic food practices, availability of food safety facilities, and perspectives of hospital food vendors. This creates a knowledge gap that can be quite impactful.\nIn a country where more than 654 public hospitals serve millions of people—particularly low-income patients—access to safe, nutritious, and medically appropriate food is a crucial issue. Most patients seek care at public hospitals due to their affordability, especially for those without insurance or the means to access private care. These hospitals are often the only available option in underserved or rural areas. Despite this, patients' rights to proper treatment are being violated through unhygienic and poor-quality food.\nEarlier, the food budget per patient was Tk 125, which increased to Tk 175 after the COVID pandemic. For patients in the intensive care unit (ICU) and high dependency unit (HDU) at the National Institute of Burn and Plastic Surgery, the allocation is Tk 300 per patient. Despite these increases, complaints about food quality persist. Common issues include coarse, foul-smelling rice; watery lentils; and flavourless curries. There is no system to customise meals based on caloric needs, age, weight, or medical condition. Dietitians are often only nominally involved, with little influence on meal planning or monitoring. Oversight of food quality and nutritional care remains weak. This state of affairs can have severe consequences for patients.\nThe Bangladesh Food Safety Authority (BFSA), established under the Food Safety Act, 2013, is responsible for regulating food safety, including in public hospitals. The BFSA oversees various aspects of the food supply chain, including import, production, storage, and distribution. However, enforcement in public healthcare settings has been weak and inconsistent. This gap between policy and practice further endangers patient health.\nOver the years, there has been a surge in the number of public hospitals and health facilities. However, a substantial portion of the population still faces significant barriers to healthcare access. Over 60 percent of people lack access to basic healthcare, and fewer than 40 percent receive essential medical care. These figures highlight broader structural problems including underuse of government hospitals, cost-effectiveness concerns, and sustainability challenges. They also reflect the urgent need to improve the quality of care—starting with something as fundamental as safe food.\nTo identify gaps in hospital nutrition care, we should consider issues such as a lack of proper staff training, inconsistent implementation of guidelines, poor teamwork, failure to focus on individual patient needs, limited screening for malnutrition, and challenges related to technology. Additionally, we must evaluate food quality, follow up on patient outcomes, assess resource limitations, and measure how well nutrition is integrated into overall care. Evidence-based research is essential to addressing these gaps effectively.\nBut first, we must acknowledge that food safety is a basic patient right—not a luxury—and that poor hygiene, low food quality, and weak enforcement of food safety laws in public hospitals are endangering patients. Simply increasing food budgets is not enough without proper management, monitoring, and trained personnel.\nTo resolve this problem, the government should strictly enforce the Food Safety Act of 2013, hire trained dietitians, ensure regular hygiene training for food handlers, and customise meals according to patient needs. Collecting data from hospitals and vendors is also crucial to closing existing knowledge gaps. Safe food in hospitals can lead to better recovery outcomes, reinforce patient dignity, and strengthen the healthcare system overall.\nSabrina Pervin Shanta is an LLM student at North South University.\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Food safety in public hospitals is a basic right, not luxury",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/food-safety-public-hospitals-basic-right-not-luxury-3907301",
        "news_paper_name": "The Daily Star",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "We are concerned by the recent spate of crime in Dhaka that put its law and order situation once again under the spotlight. Since the political changeover in August last year, public security in the city has been an area of concern with a persistent rise in various criminal activities. Although the authorities have taken a number of measures to address the situation, things have proven difficult to manage. The spike in criminal incidents—with CCTV footage of several going viral on social media—is understandably fuelling fear among the general public. The government, therefore, must increase its efforts to comprehensively address these security concerns.\nAccording to data from the Police Headquarters, Dhaka witnessed a noticeable rise in violent crimes in the first four months of this year, with robbery cases almost doubling and dacoity and murder cases nearly tripling compared to the same period last year. Over time, the criminals appear to be growing more audacious, often attacking people in broad daylight. On Tuesday morning, muggers attacked a currency trader, shot him, and robbed him of currencies worth Tk 22 lakh in the city's Mirpur area. On Sunday night, a BNP leader was shot dead by two assailants. Some perpetrators have even been seen carrying machetes, using them to intimidate or attack their victims.\nWhat does it say about our law enforcement if gun-toting, machete-wielding criminals can roam freely in public? In some cases, police appeared reluctant to take action. For instance, a victim of mugging in Nikunja, who was attacked with machetes, reported the incident to Pallabi Police Station but no action was taken until a video of the incident went viral. Speaking to The Daily Star, he said the incident had shattered his sense of security, and—one may easily assume—that of many others.\nThis situation has persisted more or less since August. While the interim government has taken some initiatives, including deploying army troops with magistracy powers to assist in maintaining law and order, these efforts have often proven insufficient. Unfortunately, the police have yet to fully regain their footing, and criminals continue to take advantage of the vacuum. This is unacceptable. Law enforcement agencies must reassert control over the city's law and order using whatever means necessary. It is unacceptable for people to continue living in fear for their safety.\n",
        "headline_1": "Dhaka’s law and order situation demands better interventions",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/dhakas-law-and-order-situation-demands-better-interventions-3905361",
        "news_paper_name": "The Daily Star",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 31, 2025 00:00:00  \nChattogram-Dhaka oil pipeline project has been encountering delays in multiple forms. First, its launching was delayed following its approval by the Executive Committee of the National Economic Council (ECNEC) in October 2018. Thus its original completion deadline by December 2020 was missed. The deadline was extended twice first, to December 2022 and then to December 2024. Consequently, the original project cost has soared from Tk28.61 billion to Tk 36.99 billion. On project completion, the operation, that is, transportation of the petroleum fuel through the pipeline was scheduled to begin early this month.\nBut it has not yet started due to non-completion of some pre-commissioning work. Whatever the nature of the pre-commissioning formalities may be, it must not cause inordinate delay to transportation of the fuel oil through the 237.71- kilometre pipeline from Padma oil installations in Patenga of Chattogram to Narayanganj's Godanail tank terminal. The more the delay in actual commissioning of the operational part of the project is the more the transportation of fuel oil by private tanker lorries and coastal tankers. The nexus pilfering oil during transportation will also share the loot. It is an entire chain of vested interests from transportation points to political high-ups that was engaged in stealing the state's precious fuel oils during the autocracy. The scale of operation gives some measure of profit with 200 tankers reportedly deployed to carry 90 per cent of oil by waterways. \nNow that the autocracy has gone, what is then standing on the way of making the oil pipeline functional? If it is due to the usual bureaucratic tardiness, indecision or laxity on the part of BPC's administration, or, say, appointment of an operating company to run the pipeline, the delay should not be inordinate. That would call for bringing those responsible for the sloppiness in the administration to book. The main objective of installing the pipeline was to save about Tk2.30 billion annually in transportation cost. That objective is being defeated. \nMore than the money in the form of transportation cost, the time saved is the most critical part of the project. Once the pipeline begins to carry 2.62 million metric tonnes of petroleum products from Chittagong port to the capital city annually without all the hassles, risks, costs and lengthy time, the productivity of the national economic engine oil fires will increase manifold. It is not just the industries in the urban areas that the piped oil promises to serve, the 2.7 million tonnes of High Speed Diesel (HSD), the crucial fuel for agriculture in the northern districts to be transported through the pipeline would also help ensure the country's food security better. Notably, from Godanail and Fatullah in Narayanganj, tankers are used to carry the oil along the waterways to the depots in the northern districts such as Baghabari in Pabna, Chilmari in Kurigram and Sachnabazar of Sunamganj in the northeast. Obviously, after commissioning, the northern agricultural districts would also benefit greatly. In sum, every hour lost to commissioning delay of the pipeline would amount to huge loss in economic terms. This is the last thing expected of the current interim government.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Expediting operation of oil pipeline",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/expediting-operation-of-oil-pipeline-1748620440",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       May 31, 2025 00:00:00  \n\nHumans sit at the top of the food chain and kill animals for food. But even in killing, there are moral boundaries. Animals are not starved for weeks or subjected to unnecessary suffering before being killed. Yet in Gaza today, such basic mercy is not extended to people. Around two million human beings living there are enduring a level of cruelty that would be deemed unacceptable even in a slaughterhouse. For three months, Israel has systematically denied food, water and basic supplies to Gaza's civilian population, weaponising hunger in what constitutes a clear crime against humanity. The deprivation has been so extreme that on May 20, the UN warned that 14,000 infants could die within 48 hours if aid did not reach them. Even the US president Donald Trump, a staunch ally of Israel, was compelled to acknowledge the severity of the crisis. Under mounting international pressure, Israel finally allowed a small amount of food into Gaza which aid workers described as a drop in the ocean compared to the overwhelming need. \nBeyond the deliberate starvation of civilians, since October 8, 2023, Israel has waged an unrelenting campaign of bombardment and military violence in Gaza. Israeli forces have killed civilians on a massive scale, with the official death toll exceeding 62,000 and thousands more remaining buried under rubble, presumed dead. This is beyond tragic. This is madness. No sane country, no professional army, kills innocent civilians as a matter of routine, shoots babies in the head and chest with sniper rifles, executes people waving white flags, or bombs hospitals with impunity. Yet in Gaza, these horrors occur daily. \nThe people there have nowhere to flee. Borders are sealed, the sea patrolled by warships, and even so-called safe zones are bombed. Schools have turned into overcrowded shelters where strangers share bare floors. Food is gone, clean water non-existent, and the constant roar of explosions never stops.\nThe language of Israel's own leadership makes the intention of their campaign abundantly clear. Just last week, Israeli Finance Minister Bezalel Smotrich said, \"We are there to conquer, cleanse and remain. We are disassembling Gaza into piles of rubble.\" He even boasted, \"We're doing something that no one's done in the world before. Yes, the Gazans will have to leave.\" \nWhat is perhaps most tragic is that these atrocities are unfolding in full view of the world. Many Western countries continue to provide the weapons, funding and diplomatic backing that enable the violence. For instance, according to Israel's Defence Ministry, since October 8, 2023, the US has delivered more than 90,000 tons of military aid in Israel via 800 transport planes and 140 ships which include armoured vehicles, munitions and protective gear. European governments like Germany and France banned demonstrations in support of Palestinians, along with Palestinian flag and symbols. In this atmosphere, even appeals for Israel to adhere to basic humanitarian norms are often denounced as antisemitic. \nThis is a moral unravelling of the Western civilisation which has long claimed to champion human rights. A civilisation that watches the weaponisation of starvation and does nothing has forfeited any claim to ethical leadership and is inching closer to collapse. The only meaningful challenge to the moral failure of the West has come from the US university campuses, where students and faculty have protested to call out the ongoing genocide. But their resistance has come at a cost. For speaking out against Israeli atrocities, these institutions have faced punitive measures including withdrawal of federal funding, research contracts, grants, and even the right to enrol foreign students. \nThe International Criminal Court (ICC) has taken a historic step by seeking arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former IDF chief Yoav Gallant on charges of war crimes and crimes against humanity. In the wake of these developments, many around the world who once sympathised with the historical suffering of the Jewish people are now turning away in disillusionment. Attempts to dismiss criticism as antisemitism are losing their power. The façade is cracking, and a growing number now recognise the devastation of Gaza as a deliberate campaign to destroy a people. \nDefenders of Israel often frame the onslaught in Gaza as a justified response to Hamas' October 7 assault which killed 1,200 Israelis. But this narrative deliberately ignores the context. The October 7 attack did not occur in isolation. It was the explosion of a pressure cooker sealed shut for decades. It followed 75 years of displacement, 56 years of military occupation and 17 years of a suffocating blockade on Gaza. Since 2007, two million Palestinians have been trapped in what Human Rights Watch called an \"open-air prison.\" Their borders are guarded by snipers, their fishermen fired upon at sea, and even food imports are monitored with strict limits, down to calorie count. October 7 emerged from this despair. As historian Norman Finkelstein notes, the Hamas' attack on Israel is akin to a slave revolt against colonial masters.\nHad Israel limited its response to targeting Hamas within the bounds of international law, the world might have viewed it as a harsh but legitimate military operation. But what is happening goes far beyond that. It is the wholesale slaughter of a captive population, most of whom had no part in the initial attack. When even infants are stripped of innocence and treated as legitimate targets, no justification can stand. No matter how loudly this campaign of extermination in Gaza is defended by voices in Western media and political circles, it perfectly fits the definition of genocide and ethnic cleansing under international law. \nPerhaps one day this nightmare will end. When it does and the dust finally settles, the world will have to confront hard and uncomfortable truths. Accountability must extend to every journalist, politician, propagandist and online voice who enabled, excused, financed or shielded these atrocities. None should be allowed to escape the judgment of history. This reckoning will be essential, not merely as justice for the victims, but as the only way to reclaim collective humanity. \n\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Gaza and the collapse of Western morality",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/gaza-and-the-collapse-of-western-morality-1748620489",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       May 31, 2025 00:00:00  \n\nOver the decades, government employees in the country have enjoyed exclusive perks and benefits regardless of their performance. Almost every government extended various benefits to them, ignoring the budget constraints and their due accountability to the people. The primary reason for providing such benefits is to foster loyalty to the government, but it's crucial to remember that public perception is critical and should guide their actions. \nDuring the now-ousted Hasina regime, government employees were awarded numerous privileges, a deliberate move to bias the bureaucracy towards the regime. The employees who were supporters and loyalists to Hasina easily superseded others, their inferior qualification notwithstanding. Instead of enforcing transparency and accountability among government employees, they were rewarded for wrong reasons. \nThe polarisation and politicisation of government employees severely undermine performance-based evaluation, and many qualified employees are not evaluated. Thus, a distorted public administration structure has developed in the country, and the culture of violating and ignoring citizens' rights has also spread.\nThe absence of a well-designed carrot and stick policy has also intensified the distortion, as many government employees have started to forget that they are the servants of the country and ultimately accountable to its citizens. They have also forgotten that their salaries and perks come from the taxes paid by the citizens and also public borrowings. \nThere is a widespread allegation that a large number of government employees fail to deliver their work properly. Many of them are also corrupt and frequently seek bribes. There is also a bad practice of absenteeism at work, which compels citizens to suffer. Poor service delivery is a routine affair in many government offices. \nThere is no doubt that a good number of employees are efficient and work honestly, maintaining smooth functioning of the government machinery. Their reasonable efforts, however, are undermined by those who are inefficient, corrupt, and greedy. \nAgainst this backdrop, the movement launched by government employees protesting the \"Public Service (Amendment) Ordinance, 2025\" needs to be reviewed. For the last few days, several government employees have been demanding the cancellation of the ordinance, terming it repressive. The interim government issued the ordinance the previous week amending the Government Service Act, 2018.\nThe ordinance outlines four offences that constitute misconduct: inciting disobedience or disrupting discipline among employees; being absent or neglecting duties without leave or valid reason, whether individually or collectively; encouraging others to skip work or avoid responsibilities; and obstructing colleagues from performing their duties. Under the ordinance, penalties may include demotion to a lower grade or pay scale, removal from service, or outright dismissal.\nThe provision of harsh punishments and penalties is the main reason for the protest movement, as government employees, specifically those of the republic, fear that the punishments may be imposed discriminatorily and unfairly. As the protest intensified, along with absenteeism from daily work, the government has indicated a review of the ordinance, along with softening the harsh provisions.\nIn the meantime, social media have also been flooded with sharp criticism of the inefficiencies of government employees and their various misconducts. Netizens have blasted the public servants, reminding them about their duties and responsibilities, reflecting the people's perception of the government employees. They have raised some critical questions in this connection. For instance, when all private jobs are subject to hire and fire, why are public jobs so protected? Generally, dismissal of a government employee is subject to a complicated procedure, and thus, the individual is safe from such severe punishment. \nFor decades, government employees have consolidated their positions in various forms. A large number of them have also proved less capable and less efficient and, as a result, unable to provide optimal service. Why the taxpayers have to pay for such inefficiency and inability is a serious question. Instead, taxpayers have no objection to bearing the cost of efficient and dedicated employees. It is, thus, time to overhaul the public administration through substantive reforms. The need for reform is compelling and government employees need to keep in mind that they are neither the owners of the country nor superior to ordinary citizens. A change in mindset is necessary to realise their fundamental roles and responsibilities. \nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Accountability of  govt employees",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/accountability-of-govt-employees-1748620563",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-05-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       May 31, 2025 00:00:00  \n\nEid ul Adha is one of the most significant Islamic festivals in Bangladesh. Beyond its religious importance, it also serves as a major economic event. Every year, thousands of Muslims perform Qurbani-the ritual sacrifice of animals such as cows, goats, and sheep.\nThis religious tradition drives a massive wave of seasonal economic activity centred around livestock. In the months leading up to Eid, rural farmers rear animals with the aim of making a profit. It is estimated that almost 20 millions animals are traded during this period, generating billions of taka in economic transactions. For many farmers, this is the most profitable time of the year and often constitutes their primary source of income.\nTemporary cattle markets set up ahead of Eid become bustling economic hubs. These markets create seasonal employment opportunities for traders, transporters, labourers, and butchers, further contributing to local economies. Blacksmiths become very busy with making knives and billhooks. Ancillary industries-such as veterinary services, livestock feed suppliers, and hide processing businesses-also benefit from this seasonal boom, making the Eid economy multi-layered and far-reaching.\nHowever, this seasonal livestock sector also faces several challenges, including price fluctuations, inadequate animal welfare standards, and environmental concerns related to waste management. Moreover, illegal cattle imports from neighbouring countries continue to undermine the earnings of local animal rearers. If such practices are addressed through strict legal enforcement, domestic traders would have greater opportunities to thrive and expand this vital sector.\nThere is also a growing need to modernise cattle markets with better infrastructure, digital payment options, and proper sanitation to ensure a smoother and more transparent trading experience. Public awareness campaigns on ethical animal treatment and environmentally safe disposal of waste could further enhance the sustainability of this practice.\nUltimately, Eid ul Adha is not only a religious observance but also a powerful economic engine for Bangladesh-one that deserves strategic support and better regulation to unlock its full potential.\nBipa Khandoker\nStudent, BBA\nNorth South University\nbipa.khandoker@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Economics of livestock trades",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/economics-of-livestock-trades-1748620598",
        "news_paper_name": "The Financial Express",
        "publish_date": "31-05-2025"
    }
]