[
    {
        "full_article": "The expansion of the Bihar Council of Ministers — seven new members, all from the Bharatiya Janata Party (BJP), have been inducted — is the clearest public statement that the party wants to rewrite its terms of engagement with its partner, the Janata Dal (United), or the JD(U). The BJP now has 21 of 36 cabinet positions, while the JD(U) has 13, including Chief Minister Nitish Kumar. The Hindustani Awam Morcha (Secular) has one Minister while the remaining post is an independent. With the Assembly elections only a few months away, the BJP has made it clear to the JD(U) that it will now act as the senior partner of the alliance. The expansion was after Mr. Kumar’s meeting with BJP president J.P. Nadda and the visit of Prime Minister Narendra Modi to the State, marking an early beginning of the election campaign in his characteristic style. The Assembly election in 2020 was a turning point. The JD(U) contested 115 seats but won only 43, while the BJP won 74 out of the 110 seats it contested. The partners flipped their positions within the alliance, with the BJP emerging as the senior partner after playing a supportive role to Mr. Kumar for nearly four decades. The BJP conceded the Chief Minister’s post to Mr. Kumar in order to avoid any potential blowback from the Extremely Backward Classes (EBC) which continue to support Mr. Kumar.At 73, Mr. Kumar is younger to both Prime Minister Narendra Modi, who is 74, and the Rashtriya Janata Dal (RJD)’s Lalu Prasad Yadav, who is 76, the other key figure in Bihar. The JD(U) supremo, however, is at a vulnerable moment in his career after having been the Chief Minister for two decades, hopping between the RJD and the BJP for partnership. The BJP is trying to capitalise on this and consolidate its dominance. The caste composition of its Ministers is a clear indicator of the party’s strategy to directly engage with a wide array of communities and reduce its dependence on Mr. Kumar even further. This is in keeping with a pattern that the BJP has been following over the years — the party reaches out to newer electorates by making alliances with parties first and then gradually expands its own direct contacts with them. The most recent example of this was in Maharashtra where the BJP replaced the Shiv Sena as the dominant party. While Mr. Kumar may sense the danger involved in his partnership with the BJP, his options are limited. Having switched between the BJP and the RJD several times in the past, he only managed to delay, but not avoid, this moment of utter helplessness. Published - March 01, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Bihar\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Janata Dal (United)\n                    \n                            /                      \n                        \n                        Hindustani Awam Morcha\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        Shiv Sena\n                    \n                            /                      \n                        \n                        Rashtriya Janata Dal\n                    \n                            /                      \n                        \n                        Bihar Assembly Elections 2020",
        "headline_1": "​Turning point: On the BJP, JD(U) and politics in Bihar",
        "headline_2": "In Bihar, the BJP is now clearly the senior partner in the alliance with the JD(U)",
        "link": "https://www.thehindu.com/opinion/editorial/turning-point-on-the-bjp-jdu-and-politics-in-bihar/article69275192.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "As the first phase of the Israel-Hamas ceasefire comes to an end on Saturday (March 1, 2025), there are growing signs that the already fragile truce is under enormous strain. When the deal was reached in mid-January, the understanding was that it would be implemented in three phases. In the first, Israel was required to reposition some of its troops, letting displaced Palestinians move from the south to the north, and release more than a thousand security prisoners in return for some 32 hostages. In the second phase, both sides are required to bring the war to an end, while the third phase is about the reconstruction of Gaza. In the first 42 days, both sides stuck to their commitments despite challenges — Hamas released 38 hostages and Israel freed hundreds of prisoners. Talks for the second phase were to begin days earlier — Prime Minister Benjamin Netanyahu sent a delegation to Cairo only on Thursday (February 27, 2025). And, according to the deal, Israel was to complete the withdrawal of its troops from the Philadelphi corridor, the 14-kilometre stretch along southern Gaza’s border with Egypt, by Saturday. But on Thursday, an Israeli soldier ruled out an Israeli pull back from the corridor, casting doubts on the future of the ceasefire.When Israel launched the war on Gaza, following Hamas’s October 7, 2023 cross-border attack in which 1,200 people were killed, Mr. Netanyahu’s declared objectives were the dismantling of Hamas and the release of the hostages. But after 15 months of war, in which nearly 48,000 Palestinians have been killed and more than 1,00,000 wounded, Israel achieved neither of the goals, which eventually forced Mr. Netanyahu to strike a deal with Hamas to get the hostages out. For a permanent end of the war, Israel has to leave Gaza. If Mr. Netanyahu withdraws his troops, Hamas will remain in power in the enclave, an outcome that could lead to the collapse of his right-religious government. The proposal by United States President Donald Trump to “own Gaza” and ethnically cleanse the strip’s 2.3 million Palestinians seems to have hardened Israel’s position further. But by keeping its troops in Gaza, Israel is not only violating the terms of the ceasefire but is also stepping into the abyss. Despite its superior forces and unmatchable fire power, Israel has failed to destroy Hamas, which, in the words of Israel Defense Forces spokesperson Daniel Hagari, is “rooted in the hearts” of Palestinians. After the first phase of the ceasefire, Hamas will still have over 60 hostages. So, if Israel refuses to exit Gaza and extend the ceasefire, what is awaiting the enclave is a war of attrition. Instead, the Jewish state should honour its commitments under the agreement. The U.S., rather than make outlandish statements such as ethnically cleansing Palestinians, should use its leverage over Israel and its Arab neighbours to implement the ceasefire and draw up a plan for post-war Gaza, that includes its governance and reconstruction. Published - March 01, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        peace negotiations\n                    \n                            /                      \n                        \n                        Egypt\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "​Truce under fire: On the first phase of the Israel-Hamas ceasefire",
        "headline_2": "All sides must ensure that the war in Gaza ends permanently",
        "link": "https://www.thehindu.com/opinion/editorial/truce-under-fire-on-the-first-phase-of-the-israel-hamas-ceasefire/article69275164.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "If every trick in the book is recommended but the most obvious, then it’s clearly from a govt manual. To get our economy to top speed, we have gone from encouraging vocational training, to handholding MSMEs, to export promotional policies, to the Production Linked Incentive schemes (PLIs), but have missed out on the obvious, namely, Research and Development (R&D).\n \nRead full story on TOI+\n\n",
        "headline_1": "Labs to riches story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/labs-to-riches-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "By- Swami Achyutananda\nVedanta declares that only Brahmn is true, and the world is false. But what is meant by false? Everything we perceive around us appears for a time, and eventually, will be destroyed. This impermanence is why it’s considered false. The existence of the universe is borrowed, not inherent.\nConsider a pot of water placed on fire. As the water boils, the potatoes in it become hot. However, this heat is not an intrinsic property of potatoes; it’s borrowed from the boiling water. Similarly, heat is borrowed from fire, but the fire’s heat is intrinsic to it. The universe is an appearance of Brahmn, existing and manifesting through it.\n\nBrahmn is existence, consciousness, and bliss. We cannot perceive Brahmn as an object because it is the ultimate subject, the essence of all experience. Whatever we see, feel, or touch is experienced by Brahmn. There are objects, and Brahmn is the subject; therefore, the subject cannot be the object.\nVedanta describes Brahmn as ‘vastuparicched sunyam, deshaparicched sunyam, and kalaparicched sunyam.’ Vastuparicched refers to the limitation of matter. For instance, a pen is just a pen, not a duster, blackboard, or microphone. Brahmn, however, is unlimited; everything is Brahmn. Therefore, Brahmn is vastuparicched sunyam.\nDeshaparicched refers to spatial limitation. If i am in a room, i cannot be anywhere else in the universe at the same time. This is my spatial limitation. However, Brahmn is omnipresent, existing everywhere. So, Brahmn is deshaparicched sunyam.\nKalaparicched refers to temporal limitation. I was born in a particular year, and before that, i did not exist. I will die, and my existence will cease. This is my temporal limitation. However, Brahmn exists beyond time; it was, is, and will be forever. Brahmn is kalaparicched sunyam.\nNow, the question arises: Where is Brahmn? Vedanta boldly declares that Brahmn is none other than you. You are that Brahmn. This realisation creates confusion, as we identify ourselves with our bodies and minds. All suffering stems from this ignorance. You are suffering because you think of yourself as limited by your body and mind. Therefore, you must embark on a journey from ignorance to knowledge. This journey is not through space but through the realms of understanding. You must transcend your ignorance.\nVedanta invokes the prayer – “Asato ma satgamaya/tamaso ma jyotirgamaya/ mrityor ma amritamgamya.” This means: Lead us from the unreal to the real, from darkness to light, and mortality to immortality. Everything we perceive is impermanent. Lead us to Brahmn, which is permanent and all-pervading. Lead us to the light that dispels our inner darkness, ignorance. And finally, lead us to immortality, for we are eternal and ever existing.\nThe beauty of Vedanta lies in its declaration that you don’t need to acquire anything because you are already that Brahmn. You need to realise it. Vedanta asserts that you are everexisting, ever-pure, knowledge itself, and ever-free. The Mahavakya from the Chandogya Upanishad states: “Tat tvam asi” – That thou art; it means Brahmn and you are the same. Rise above your limitations – body, mind, intellect, memory, and ego – for they are not your true existence. After transcending these limitations, you will realise that you are that existence, consciousness, and bliss.\n\n",
        "headline_1": "The truth of Brahmn satyam jagat mithya",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-truth-of-brahmn-satyam-jagat-mithya/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "Some merit-based lateral entry is good, period\nSebi’s first woman chief, Madhabi Puri Buch, signed out on Friday. Like all records, hers is a mixed bag. On the plus side, she brought stricter norms for stockbrokers, and curbed retail participation in high-risk derivatives. But she couldn’t, or didn’t, reduce mutual fund expense ratios. Also, the conflict-of-interest charges she faced in the last few months of her three-year term will mar her record. As a lateral hire – first private sector executive to helm Sebi – she should have cleared the air. Her long silence and reluctance to appear before Parliament’s public accounts committee now seem like own goals.\nSebi is back with a career bureaucrat, Tuhin Kanta Pandey. And after last August’s retreat on lateral entry, GoI may not have the stomach for pushing more direct appointments. Which is unfortunate because lateral entry has served India well for decades. Amul is among the world’s strongest food brands now, but who made it a juggernaut? Verghese Kurien, a lateral hire, long before the term was coined. Bimal Jalan, Jagdish Bhagwati, Raghuram Rajan and many others proved the wisdom of the policy. They had already made their mark outside govt, and brought fresh ideas and energy to the system.\nGoI formally announced its lateral entry scheme in mid-2018, and hired 63 specialists over the next five years. Transparent hiring and background checks to spot conflicts of interest were going to be key to its success. However, it wasn’t the Buch case but politics that stalled lateral entry. It’s nobody’s case that career bureaucrats don’t make good leaders – look at Maruti chairman RC Bhargava. But equally, if private sector experts want to serve govt, doors shouldn’t be shut. There will always be cutting-edge areas like AI and clean energy where in-house talent may not suffice. GOI shouldn’t be wary of merit-based lateral entry.\n\n",
        "headline_1": "Buch the trend",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/buch-the-trend/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "An argument for established religion \nThe modern world is wary of religion. But Believe:  Why Everyone Should be Religious by Ross Douthat makes an intellectual case for faith, and why we would be better off committing to the ritual and ethical practices of established religion. The instinct for the spiritual and supernatural has always been with us, the book says. It argues religion might still offer a reasonable perspective on reality and human destiny. Instead of the pick-and-choose spirituality, it advocates commitment to an established religious tradition.\nReligion is a system of belief and practice that tries to connect humans to a supernatural order, offers moral guidance, and preparation for a possible hereafter. While written from a Christian believer point of view, the book offers examples from world’s major faith traditions, polytheistic and monotheistic.\nThe book offers specific reasons for belief. The intricate design of the world – science added new facts, but didn’t discredit the fine-tuned wonder of our world. Quantum physics only provides wider evidence for the religious worldview. We are not just matter in motion, human minds are not just biochemical arrangements, and AI only deepens the mystery of consciousness. Another reason for belief, according to the book, is empirical – widely documented miracles and mystical visions, in regular life or at the brink of death.\nWhat of the eternal question: If god is all-powerful, why do terrible things happen in the world? The book says humans facing suffering have, paradoxically, less trouble reconciling their experience with a strong belief in God. Another question: why do religious institutions do so many wicked things? Douthat’s answer: Family, business and govt are all replete with abuse – but we don’t give up on them, we try to reform them. There is no evidence, he argues, that religious causes are a source of violence and persecution any more than motives like conquest or resource control. In fact, international law, human rights, and movements for progress and peace have also been religiously inspired.\nWhile some object to traditional religion’s views on gender and sexual ethics, all mainstream religions offer more open-minded interpretations – though the book also suggests religion’s rules may be right, in some cases.\nWe often inherit our religious beliefs, rather than investigating the metaphysical truth of each faith. But the book says even if, for argument’s sake, the truest religion is Sunni Islam but you’re raised as a Protestant Christian, you’re still better off worshipping the same god through a mediating figure of Jesus. Christian practices of prayer tiptoe toward mediation, the Eightfold Path has ethical overlaps with the Ten Commandments, and so on.\nReligious faiths have a common core, and those who believe in any one are better off than those of no faith at all. Just as there is no shame in returning to your parents’ faith, there is no shame in converting to a faith that calls out to you, for whatever reason. The act of questing, of following spiritual threads, might take us to unforeseen destinations, but what matters is the exploration, the book says.\n\n",
        "headline_1": "God isn’t dead, so we better believe",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/god-isnt-dead-so-we-better-believe/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "We welcome the launch of the National Citizen Party (NCP), led by individuals from the July uprising that toppled the regime of the Awami League in August 2024. The party has been formed at a time when the people of the country are eagerly looking forward to new political leadership, expecting positive change in our political culture. As the leaders of the newly formed party shared their vision for a new Bangladesh, the public's response was overwhelmingly supportive. Students, activists, young professionals, and ordinary citizens from across the country participated in the inauguration ceremony to show their backing.\nNahid Islam, the convener of the NCP, vowed to reshape Bangladesh's political landscape. He declared that the common people will be the supreme source of power in Bangladesh and that their mission is to dismantle constitutional autocracy and establish a robust democratic framework. Nahid also emphasised that the NCP is committed to rebuilding the country's political and economic institutions, combating corruption and nepotism, and prioritising inclusion, equity, and national sovereignty. While these promises are encouraging, the true challenge for the new party will be in staying true to its word.\nOver the past few decades, we have witnessed the failure of major political parties to uphold the democratic spirit of the nation. During the 15 years of AL rule, all major institutions were politicised, rendering them inefficient and incapable of performing their duties. The party's failure to ensure democratic practices within itself, coupled with widespread corruption and a lack of transparency and accountability, severely damaged our political culture. As a result, the people of Bangladesh are eager for change. Therefore, if the NCP genuinely seeks to become a people's party, it must first practice democracy within the party itself. It needs to foster an environment where disagreement and debate are welcomed, and everyone's voice is heard. It is encouraging to see that the party has included people with diverse views and beliefs, with three of the top 10 positions in the committee held by women.\nTransparency and accountability will be key factors in determining the future of this party. A lack of transparency has long distanced people from mainstream political parties. The NCP must, therefore, ensure transparency in all its activities, especially regarding its finances. Understandably, launching and running a new political party requires substantial funding, and the NCP must make its sources of funding public—both now and in the future—to ensure transparency. As Nahid has affirmed that the NCP will be a truly democratic, egalitarian, and people-centred political force, it must remain accountable to the people.\nWe hope that the NCP will set a positive example for other political parties to follow. It has emerged directly from the heart of a mass uprising—led by the very youth who spearheaded it. We wish them success in building the inclusive society they have pledged to create.\n",
        "headline_1": "A new party with new hope",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/new-party-new-hope-3836966",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "Blacklisting union leaders and labour activists is one of the most common yet legally confusing parts of labour law that violates fundamental labour rights. This practice continues despite national labour laws and international labour treaties that protect workers' rights. \nAccording to the ITUC Global Rights Index 2023, about 90 percent of countries violated workers' right to strike, with 79 percent obstructing collective bargaining. The Global Rights Index 2024 reports that 49 percent of countries randomly arrested or jailed union members, an increase from 46 percent in 2023. Additionally, over 40 percent of these countries limited or refused people the right to speak freely or to gather. Blacklisting is accomplished through hidden tactics, such as industry-wide databases managed by employer groups, retaliatory terminations disguised as disciplinary actions, and hiring prohibitions that hinder discharged union members from finding jobs in a wide range of industries.\nAccording to a report by McKinsey & Company, published on March 25, 2021, the RMG sector in Bangladesh employs over 4 million people and accounts for approximately 84 percent of the country's total exports. However, after all the input, workers who opposed the proposed minimum wage increase in 2018, considering it too low, went silent in the following years. In mid-January 2019, water cannons, tear gas, rubber bullets, and batons were used by law enforcement officials to disperse workers at pre-pay board rallies. During protests, one worker was killed, dozens were injured and thousands were dismissed. Factory owners charged hundreds of workers with vandalism and property damage. A report published by Clean Clothes Campaign on February 21, 2024, claimed factory owners oppressed discharged workers by broadcasting their names and photos on billboards at facility gates and utilising biometric data systems to track and swap profiles. It was claimed by the Business & Human Rights Resource Centre that around 11,000 garment workers were fired, with countless identities circulated among employers to prevent re-employment. At that time, the Bangladeshi law minister labelled the protests as \"labour unrest to disrupt democratic process\" and \"acts of sabotage\" before the 44th Universal Periodic Review Working Group Session at the UN Human Rights Council on November 13, 2023.\nThis demonstrates a systemic failure to implement labour standards, notwithstanding the Bangladesh Labour Act 2006, which expressly forbids discrimination between union and non-union employees under Section 195 and criminalises unfair labour practices under Section 196. Section 291 further establishes consequences for firms that engage in anti-union action. However, poor enforcement mechanisms and insufficient oversight render these safeguards ineffective.\nInternational labour standards, specifically ILO Convention No 87 on Freedom of Association and Protection of the Right to Organise and ILO Convention No 98 on the Right to Organise and Collective Bargaining, require that anti-union discrimination protections cover all aspects of employment, including recruitment, termination, and workplace conditions. Despite having ratified both conventions, Bangladesh has made little attempt to implement them. The Department of Labour lacks the necessary resources to investigate blacklisting allegations effectively, and employers commonly face legal consequences due to insufficient sanctions and lengthy judicial procedures. Labour courts can take years to resolve disagreements, discouraging employees from filing grievances.\nA review of many jurisdictions reveals outstanding techniques that might be used in Bangladesh. The UK has adopted specific legislation, the Employment Relations Act 1999 (Blacklists) Regulations 2010, which outlaws the development and use of blacklists based on union activity. Workers are entitled to compensation under the Act, which imposes criminal penalties. In the United States, Section 8(a)(3) of the National Labour Relations Act, which the National Labour Relations Board enforces, forbids discrimination against employees who participate in union activities. French labour laws strongly protect employees against retaliatory dismissal, with employers bearing the burden of evidence in cases involving anti-union discrimination. These methods have effectively reduced blacklisting and highlighted the need for explicit, enforceable legislation that carries severe penalties for violators.\nBlacklisting imposes significant human costs, including unemployment, financial uncertainty, social marginalisation, and psychological distress. The threat of blacklisting discourages workers from participating in collective bargaining or challenging unsafe working conditions, hence sustaining exploitative labour practices. In Bangladesh, significant decrease in union registration applications following the 2018-2019 protests indicate a prevalent sense of dread. Union sympathisers are routinely subjected to pressure, harassment, and physical violence, which exacerbates legal violations.\nSeveral critical legal amendments could help to resolve blacklisting and prevent violations of workers' rights. The amended Bangladesh Labour Act should include unambiguous provisions against blacklisting and increased penalties for breaches to avoid future violations. Enhancements could be done by strengthened enforcement measures, such as increasing the Labour Court's ability to expedite cases of union discrimination and establishing an independent labour ombudsman to investigate blacklisting charges. Regulating employer-maintained databases to avoid their misuse in recruitment decisions and publicising cases of unfair labour practices would increase transparency. This includes the development of a Whistleblower Protection Act to protect employees from retaliation.\nBlacklisting in the labour market is a complex issue that requires a multifaceted approach that includes legal enforcement, institutional control, and creative solutions. Improving national labour legislation and implementing international conventions are critical steps; nonetheless, a paradigm shift is required—from reactive legal measures to proactive solutions. To prevent blacklists from distorting employment prospects, countries such as Bangladesh must not only improve their labour laws but also establish independent monitoring entities, implement transparent hiring practices, and construct digital worker records. \nThe international community can take a proactive approach through trade agreements and corporate accountability systems, creating incentives for good worker practices. Technological alternatives, such as blockchain-based employment records that prevent manipulation might disrupt blacklisting practices and empower workers. Without significant reforms, blacklisting will continue to undermine workers' rights, economic justice, and industry stability. Progress is defined by creating conditions that allow workers to seek their rights without fear, and the legal protections of labour movements are genuinely supported by societal approbation.\nMd Fahmedul Islam Dewan is lecturer at the Department of Law, World University of Bangladesh, and an alumni of the DLA Piper Global Scholarship Programme.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Blacklisting labour activists: A legal violation",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/blacklisting-labour-activists-legal-violation-3836856",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "We are concerned about the crisis of space and resources at the nephrology ward of Chattogram Medical College Hospital (CMCH). According to a recent report by this daily, despite increasing demand for kidney treatment, this unit remains overcrowded, forcing many patients to receive treatment on the floor. Established with 25 beds in 1991, it now has 40 beds, but this is too inadequate considering the huge number of patients that flock to the facility from Chattogram and the neighbouring districts.\nThe bed shortage is not the only problem here, however. Dialysis facilities at the CMCH are also quite inadequate. There are nine haemodialysis machines that can serve only 32 patients twice a week. A public-private partnership initiative, comprising 31 machines, has extended services to more patients, but the number of patients seeking dialysis is still almost three times the hospital's capacity. While private clinics offer haemodialysis, their cost is prohibitive for most. Unfortunately, dialysis is the only viable treatment for end-stage kidney failure (ESKF) patients, so a lack of access can have devastating consequences for them. Moreover, a kidney transplant initiative launched at the CMCH in 2008 was later suspended due to a lack of resources and trained personnel.\n\nThe bed shortage is not the only problem here, however. Dialysis facilities at the CMCH are also quite inadequate. There are nine haemodialysis machines that can serve only 32 patients twice a week. A public-private partnership initiative, comprising 31 machines, has extended services to more patients, but the number of patients seeking dialysis is still almost three times the hospital's capacity. While private clinics offer haemodialysis, their cost is prohibitive for most. Unfortunately, dialysis is the only viable treatment for end-stage kidney failure (ESKF) patients, so a lack of access can have devastating consequences for them.\nThe CMCH case sums up the overall experience of kidney patients in Bangladesh: lack of treatment options as well as their exorbitant costs. According to a BIDS study unveiled in December, 93 percent of the families of kidney patients experienced financial distress in accessing dialysis across public, private, and NGO-run hospitals. In a country where an estimated 200-250 people per million develop ESKF every year and require dialysis, the average monthly treatment cost of Tk 46,426 is too high, given that our average monthly household income is just Tk 32,422. As per the BIDS study, 19.5 percent of the surveyed kidney patients received fewer dialysis sessions than medically recommended because of the high cost, jeopardising their health further.\nThis situation deserves to be addressed with the highest priority. Given the dependence on the CMCH in the broader region of Chattogram, the nephrology ward there must be expanded to accommodate more patients, while new specialised kidney care facilities should also be established. Given the growing number of kidney patients in Bangladesh, a similar approach should also be adopted across the country.\n",
        "headline_1": "Kidney patients need better care at CMCH",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/kidney-patients-need-better-care-cmch-3836611",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Bankrolling dev projects through Islamic bonds",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bankrolling-dev-projects-through-islamic-bonds-1740839958",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "On obligatory charities  in Ramadan",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/on-obligatory-charities-in-ramadan-1740840023",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Enhancing transparency in public procurement",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/enhancing-transparency-in-public-procurement-1740840089",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Strengthening security of tourist spots",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/strengthening-security-of-tourist-spots-1740840124",
        "news_paper_name": "The Financial Express",
        "publish_date": "02-03-2025"
    }
]