[
    {
        "full_article": "Prime Minister Narendra Modi’s 12th consecutive Independence Day address from the Red Fort was notable not only for highlighting national security and self-reliance but also for laying stress on a communally coloured demographic threat to the country. While showering praise on the Rashtriya Swayamsevak Sangh, Mr. Modi repeated its refrain by saying that the seeds of a new crisis were being sown. The launch of a High-Powered Demography Mission, to address what he described as “a deliberate conspiracy” to alter the demography of the country, is little more than a thinly disguised effort to polarise the country on religious lines by pointing to the different rates of growth in population among different communities and to the “infiltration” of undocumented migrants from the neighbouring countries. However, the speech also dwelt on substantive issues with a considerable focus on self-reliance in all fields including the economy, defence and technology, and youth empowerment. Mr. Modi also presented an account of the developments in India’s national security and developmental landscape in the last year, and previewed what to anticipate ahead.Mr. Modi lauded the armed forces for Operation Sindoor, which, he said, showcased the effectiveness of India’s defence capabilities and indigenous weaponry. He also used the occasion to warn India’s adversaries, particularly Pakistan, underscoring the policy of zero tolerance toward terrorism and cross-border attacks. Recent successes in the combat against the Maoist insurgency also found a mention. As in a plan announced by Mr. Modi, Mission Sudarshan Chakra, a fully indigenous defence system, will be developed and deployed by 2035. The details were scarce, but he described it as “a powerful weapon system” which “will not only neutralise the enemy’s attack but will also hit back at the enemy many times more”. Speaking amid rapid changes in global power equations, Mr. Modi’s Independence Day message was also aimed at the United States, which has announced tariffs as high as 50% on many Indian products. While promising to focus on revving up the domestic economy, Mr. Modi showed an awareness of the challenges that the Indian economy is facing. The next generation GST reforms would be rolled out by Deepavali 2025, which would reduce the tax burden on core goods and services and boost business. On the one hand, Mr. Modi is trying to cultivate his ideological ecosystem while on the other, he is trying to tackle the material challenges facing the nation. The success of one, however, can only come at the cost of the other. Published - August 16, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Independence Day\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        demography\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        national security\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        defence equipment\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        illegal immigrants\n                    \n                            /                      \n                        \n                        armed Forces",
        "headline_1": "Figure of speech: On the Prime Minister’s Independence Day address",
        "headline_2": "The Prime Minister held out assurances even while feeding apprehension",
        "link": "https://www.thehindu.com/opinion/editorial/figure-of-speech-on-the-prime-ministers-independence-day-address/article69937815.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "On August 11, 2025, the central government implored India’s seafood industry, that provides livelihoods to about 28 million people, to “bravely face” the U.S.’s tariffs of 25% that kicked in on August 7, 2025 and which could be raised to 50% on August 27, 2025, contingent upon the outcome of trade negotiations. On August 13, 2025, highly placed sources in the Commerce and Finance Ministries told The Hindu that the government is exploring “tweaking” the Export Promotion Mission (EPM), that was announced in the 2025 Union Budget, with an outlay of ₹2,250 crore for the current fiscal year. The EPM, a multi-Ministry project to drive access to cheaper export credit, overcome non-trade barriers and insure payments from overseas buyers, focuses on India’s micro, small and medium enterprises (MSME). Initially meant to be driven by the Ministries of Commerce, MSME and Finance, discussions are on to include the Textiles and Fisheries Ministries. These two industries, which collectively support about 135 million Indians, form among the largest segment of MSMEs that are likely to face the most impact due to the sanctions. The U.S. typically accounts for roughly a third of India’s apparel and seafood exports annually.The government’s imploration to also diversify into other markets is a tacit admission that the Bilateral Trade Agreement negotiations with the U.S. are deadlocked, and that the personal equations between Prime Minister Narendra Modi and U.S President Donald Trump have not translated into a win for either side. Bilateral relations have arguably hit a level lower than during the Cold War, as the two nations were not as enmeshed as they are now, economically, culturally and militarily. Trade and service routes and supply chains take decades to build and undoing them overnight is not possible. This has been clear from the European Union’s reliance on Russian oil and the global dependence on rare earth elements from China. While consultations have been ongoing between the government and MSME sector stakeholders ever since Mr. Trump announced “reciprocal tariffs” in April, there is a chorus now for drastic governmental intervention to safeguard the backbone of the economy — it contributes nearly half (45.79% in FY25) of goods exports and employs over 28 crore people. The fisheries sector has sought a 240-day moratorium on pre- and post-shipment credit repayment, while the textiles, apparel and gem and jewellery sectors want interest subvention. The government has, however, ruled out direct subsidies. But unprecedented challenges require novel responses. The government must include in its arsenal a drastic refashioning of near-term trade ties with neighbours, in particular, China, which it had ignored in the hope that the assiduous cultivation of ties with Washington would pay off.\r Published - August 16, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        seafood\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Union Budget\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        jewelry\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        rare earths",
        "headline_1": "A paradigm shift: On India and its trade relations",
        "headline_2": "India needs to think anew on its trade relations and strategies",
        "link": "https://www.thehindu.com/opinion/editorial/a-paradigm-shift-on-india-and-its-trade-relations/article69937141.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "When I meet a millennial for lunch, usually I hear tales of complicated romance. Millennials are the last generation still caught up in l’amour with a certain earnestness and sense of genuine surprise at their own repeating cycles.\nBy any standards, 41-year-old B is gorgeous, brilliant, sweet-natured — and very much committed to having a good time. Her definition of a good time is, you could say, Punjabi by nature. It can include ordering every exciting item on the menu and in fact consuming it, dancing a lot, aided or not by substances, travelling, hanging aimlessly with friends, or being sensually steeped in her own intellectual life. It definitely involves a series of amorous adventures, which are the subject matter of intent conversations accompanied by day drinking.\nRead full article on TOI+\n\n",
        "headline_1": "Open-Ended Love? Why He And She Ever Did Part",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/voices/open-ended-love-why-he-and-she-ever-did-part/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "Modi’s Independence Day speech offers us an opportunity to have a slightly long-term overview of the Modi era – a period that has significantly changed the contours of Indian politics. Although economic self-reliance, technological development, national security and patriotism were the core themes of yesterday’s address, Modi also underlined some serious issues of contemporary public life, which makes this speech analytically relevant.\nMore specifically, there were three important considerations that were invoked rather indirectly to provide a context to proposed policy initiatives: State’s role as a facilitator; nationalism as a driving force of politics and finally, the idea of transformation.\n\nState as a facilitator | Modi govt inherited a state that was already committed to a liberalisedglobalised market economy. There has always been consensus that free market can regulate itself, hence there is no need for any outside intervention in the economic sphere. The state, in this framework, is expected to function as a facilitator in two ways.\n \nRead full story on TOI+\n\n",
        "headline_1": "The India Of His I-Day Speech",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-india-of-his-i-day-speech/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "By Radhanath Swami\nJanmashtami marks the most sacred occasion of the divine appearance of Krishn, the Supreme Personality of Godhead. It naturally raises a question – how can someone who is unborn and eternal take birth? Krishn’s birth is not a result of his karm, it is an act of divine compassion. Out of his causeless mercy, he descends in a personal form at a particular time and place to reclaim his lost children. He performs enchanting pastimes, destroys evil, and brings victory to the righteous.\nWe do not celebrate Janmashtami because Krishn needs it. We celebrate for our own purification and absorption, to reconnect with Krishn and reawaken our lost relationship with Him.\nKrishn’s parents, Vasudev and Devaki, were known as Sutapa and Prshni in their previous life. They performed great austerities to have Krishn as their son. Pleased with them, Krishn promised to appear as their child. But that promise came with a price. Devaki and Vasudev were imprisoned by the cruel Kams. One after another, their six newborn sons were slaughtered. Only after enduring that intense grief did Krishn finally appear.\n\nThese six sons symbolically represent the six impurities in the heart, namely lust, anger, greed, arrogance, envy, and illusion. Only when these obstacles are removed can Krishn manifest in our hearts.\nWe may not face the exact hardships of Devaki and Vasudev, but we can prepare our hearts in a similar spirit. The heart, at present, is filled with the misgivings of anger, jealousy, pride, and selfish desires. Janmashtami is about preparing our hearts for Krishn’s arrival by sincerely striving to cleanse our inner space.\nWhen an important guest is expected, we thoroughly clean our home and make the best arrangements to ensure they feel welcomed and pleased. Krishn, who is supremely pure, is not affected by any amount of impurity. In fact, he has the power to purify even the deepest layers of sin within our hearts. By taking shelter of him and earnestly chanting his holy name, we can purify our hearts and make them a worthy place for Krishn to reside.\nAnother beautiful way to celebrate Janmashtami is by offering a birthday gift to Krishn. But what can we give to someone who already owns everything in creation? I remember as a child, i once gave my mother a rose from her own garden on her birthday. She was moved to tears and expressed heartfelt gratitude. Curious, i asked her why she was so touched by a gift that was already hers. She smiled and said, “It is the thought that counts.”\nIn the same way, whatever we have, whether it is speech, art, music, intelligence, or even just a little time, when offered to Krishn with love, it pleases him deeply.\nJanmashtami is more than just dressing like a devotee for a day. For a sincere seeker, it is a chance to realign our lives towards Krishn, to make the heart a welcoming place for him, not just for one day, but for all days to come.\nLet this Janmashtami not pass as just another date on the calendar. Let us try to make this Janmashtami special, not just with decorations and fasting, but by opening our hearts for Krishn to reside there forever.\nThe author is spiritual guru, International Society for Krishna Consciousness\n\n",
        "headline_1": "Inviting Krishn In Our Hearts On Janmashtami",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/inviting-krishn-in-our-hearts-on-janmashtami/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "PM’s 2 key promises from Red Fort\nTwo themes stood out in Modi’s I-Day address. Mission Sudarshan Chakra, he said, will be a powerful platform that will protect both public places and critical infra, and be operational by 2035. This is evoking comparisons with Israel’s Iron Dome. More relevant is the stellar performance of the Integrated Air Command and Control System (IACCS) and Akashteer during Op Sindoor. But air defence is an evolving tech. India faces two issues. First, versatile and rapidly improving battlefield drones. IACCS and Akashteer need upgrades for this. Second, we are still using diverse platforms – Indian, Russian, Israeli, etc. This is less than ideal. If Sudarshan Chakra can address both these concerns, it will be a massive boost for military self-reliance. \nOn GST, Modi promised Indians will pay a whole lot less for a lot of stuff they buy. Pegging this to Diwali was classic Modi. From what he said and what officials briefed later, the biggest GST reform since its inception will make it basically a 2-rate system – 5% and 18% (a few ’sin’ goods will be taxed at 40%). That will be a huge improvement on the current, complicated 5%, 12%, 18% and 28% structure. Consumers are likely to benefit from a large number of consumer goods moving from the 12% to 5% rate, some from 18% to 5%, and axing of the eye-watering 28% rate. Health insurance premiums may finally get taxed at a lower rate. That there’ll be procedural rationalisation, too, makes this mithai sweeter. And that GOI seems ready to take a revenue hit initially and bet on higher consumption to make this up down the line, is welcome reformist spirit. BJP will hope lower prices will be a vote attractor in poll-bound Bihar, a densely populated poor state. But that takes nothing away from the significance of what Modi promised.\n\n",
        "headline_1": "Chakra & consumption",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/chakra-consumption/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 17, 2025 00:00:00  \nA strong consensus seems to have emerged among Bangladesh's business leaders and trade bodies that the country's scheduled graduation from the Least Developed Country (LDC) category in November 2026 should be deferred. While such graduation signifies significant socioeconomic progress, a combination of domestic and international economic factors indicate that the export sector is far from ready to make this leap. At a recent seminar in Dhaka, representatives from major trade bodies including the Bangladesh Garment Manufacturers and Exporters Association (BGMEA), the Bangladesh Association of Pharmaceutical Industries (BAPI) and the International Chamber of Commerce-Bangladesh (ICC-B) have all voiced concerns that the economy is simply not prepared for the withdrawal of international support measures. The after-effects of the pandemic, the Russia-Ukraine war, soaring global inflation, high domestic interest rates and the July-August 2024 political upheaval have contributed to a fragile economic situation. Rushing into graduation now, they argue, would be a \"suicidal decision\" that could jeopardise the very progress that made graduation a possibility in the first place. \nOne of the most significant consequences of graduation will be the loss of duty-free access to major markets like the European Union and the UK, which together account for nearly half of Bangladesh's exports. Experts estimate that tariffs could rise by as much as 12 per cent, potentially reducing export earnings by 6-14 per cent. For the crucial ready-made garments (RMG) sector, which generates more than 80 per cent of the country's total exports, this would be a severe setback. Additionally, graduation will end special flexibilities under World Trade Organisation (WTO) rules. For instance, the pharmaceutical sector will lose the right to produce generic versions of patented medicines, which could dramatically increase the cost of essential drugs. A legal adviser and senior researcher at The Third World Network (TWN) highlighted that the price of insulin, for example, could become 11 times more expensive, worsening poverty among households dependent on it. Meanwhile, the introduction of stricter rules of origin would further raise production costs across the board.\nIndustry leaders made it clear that the real issue is not whether Bangladesh graduates, but how and when it does so. With depleting gas reserve that requires billions in annual imports and a weakened financial sector burdened by a large number of defaulted loans, there is a strong case that the current economic environment does not support a smooth transition. However, it is important to remember that graduation is not a matter of choice once the United Nations Committee for Development Policy criteria are met, as Bangladesh has done in 2018 and 2021, although deferment can be requested in cases of exceptional economic distress. History shows that such requests are granted under extraordinary circumstances. Nepal received flexibility after an earthquake and the pandemic, Vanuatu after a devastating cyclone and Bangladesh itself secured an earlier two-year extension from 2024 to 2026.\nDeferring LDC graduation is in no way an admission of failure. It is in Bangladesh's long-term interest to treat LDC graduation not as a ceremonial date on the calendar but as a strategic process tied to national readiness. Extending the timeline by three to five years would be a prudent move to safeguard employment, preserve export earnings and maintain access to affordable medicines. It would also give the government the opportunity to conclude trade negotiations from a position of strength rather than weakness. Given these imperatives, the interim government should heed this unified call from the business community and formally request an extension on LDC graduation in the nation's long-term economic interest.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Delaying LDC graduation amid economic concerns",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/delaying-ldc-graduation-amid-economic-concerns-1755354569",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       August 17, 2025 00:00:00  \nSetting the annual target of exports is a tradition for long in the country though there is no official target for imports. As earnings from export is an important source to support the country's balance of payments (BoP) as well as the economic growth, the strategic target of annual export is considered as a benchmark to determine the performance of the export-oriented industries. Following the tradition, after a modest rise in exports in the last fiscal year, the interim government has set a double digit growth target in earnings from exports of goods and services for the current fiscal year (FY26). The target for merchandise exports is set at US$55 billion for FY 2026 against the actual earnings of $48.28 billion in FY25 when the target was $50 billion. The target for services exports set at $8.50 billion against the target of $7.50 billion in the last fiscal year. Thus, the overall exports target is set at $63.50 billion for the current fiscal year. \nAfter a decline in two consecutive fiscal years, exports of goods surged by 8.50 per cent in the last fiscal year indicating a modest rebound in the economy despite a massive political unrest and changeover in the country. The first quarter of FY25 passed through a sluggish economic activity due to student-led mass uprising in the country that led to downfall of the authoritarian regime of Hasina on August 5 last year. Nevertheless, receipts from exports of goods stood at $11.65 billion in the first quarter which increased to $12.88 billion in the second quarter of the last fiscal year. The third quarter, however, witnessed a slight drop of exports to $12.65 billion and the last quarter ended with the lowest quarterly earnings of $11.12 billion in FY25. \nWhen the domestic economic condition started to rebound, the return of external turbulence did cast a shadow on export growth. In April, Donald Trump, president of the United States (US), announced his reciprocal tariff policy and imposed high rate of tariffs on various trading partners. On Bangladesh, he imposed 37 per cent tariff making the exports from the country excessively costly. The initial reciprocal tariffs were, however, suspended for three months as Trump administration provided a room for negotiation. After a hectic negotiation along with offering a number of benefits, the US has finally agreed to impose 20 per cent reciprocal tariff on all the imports of Bangladesh. It means, the country has to pay 20 per cent additional duty on the existing duties on different products. The tariff blitz has shocked the world and exports from the different countries to the US market also suffered. Bangladesh's export to the US also dropped slightly to $2.35 billion in the last quarter of FY25 from $2.52 billion of the third quarter.\n\nNow, the new export target for FY26 is around 14 per cent higher than the actual earnings of the last fiscal year. The government is optimistic that lower reciprocal tariff will help maintain the exports to the US market. Moreover, the higher reciprocal tariffs on competitors like India will be a boon for Bangladesh. \nThere is a reason to be slightly optimistic about the global trade, as per the World Trade Organization (WTO). The economists of the WTO at the latest update of the trade forecast said that global merchandise trade is to grow 0.9 per cent in 2025, up from the 0.2 per cent contraction forecasted in April. The latest projection of tiny trade growth is, however, significantly down from the 2.7 per cent growth estimated before the Trump's tariff blitz.\nTwo factors drive the WTO to make a modest growth projection for the current year. First is the surge of the US imports in the first half of 2025 by 11 per cent in terms of volume due to 'frontloading and inventory accumulation.' Simply put, frontloading means the practice of importing goods in large quantitities or earlier than usual time to avoid possible challenges that may rise in costs or obstruct supply chains. Second is the better macroeconomic outlook than predicted in April last. Nevertheless, the WTO projection also pointed out that recent tariff changes are expected to have an overall negative impact on the outlook for global trade compared to the April forecast. It was of the view that the US-China truce and exemptions for motor vehicles are contributing positively. At the same time higher reciprocal tariff rates, introduced on 7 August, are likely to weigh increasingly on imports in the US and depress exports of its trading partners in the second half of 2025. Bangladesh is one of the US trading partners which is set to face at least 35 per cent tariff on average due to 20 per cent reciprocal tariff besides the current 15 per cent average tariff. \nEuropean Union (EU) is another big market for Bangladesh and the country is likely to enhance its exports to the market as there is no tariff barrier. The challenge is that those who are facing the higher tariffs in the US will try to redirect some of the exports to the EU market and that may put Bangladesh into some extra competition. Moreover, as India has already signed a free trade agreement (FTA) with the United Kingdom (UK), there will be a competitive pressure for Bangladesh in near future. It is also not unlikely that India will try to re-export to the US through UK. \nFor Bangladesh, Indian market is also set to shrink as New Delhi has already put a number of trade barriers since the fall of Hasina regime which was a close ally of the Indian government. The trade barriers are clearly political although some economic justifications have been given. Though the interim government has requested for consultation to resolve the issue of trade restriction, Modi government continues to cold-shoulder the gesture and hinted that more trade restrictions on Bangladesh are in the offing. \nFinally, the country is likely to enter into the election business cycle by the end of the second quarter of the current fiscal year, and the cycle would continue in the third quarter, provided that the national election takes place in February next year. As the previous election business cycles showed, it will be marked by sluggish economic growth, and so exports may not gear up as expected. So, achieving the target will no doubt be challenging.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Challenges to achieving the export target",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/challenges-to-achieving-the-export-target-1755354925",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       August 17, 2025 00:00:00  \nAs Bangladesh's population grows and the demand for food rises, efficient fertiliser use has become more critical than ever to safeguard food security. Farmers in the country rely heavily on chemical fertilisers and pesticides, a long-standing practice that has caused soil degradation, biodiversity loss, water pollution and contamination of the food chain. Researchers warn that overuse of fertiliser has become a pressing concern, reducing fertiliser efficiency, lowering farm profitability, and contributing to environmental damage, including greenhouse gas emissions.\nProfessor Shahla Hosseini-Bai of Griffith University, Australia, in collaboration with researchers in Bangladesh, is leading a project to understand farming practices in rice systems and identify sustainable strategies to improve fertiliser efficiency and increase yields. Sharing the research team's recent findings, she said many farmers apply extra fertiliser, believing it will boost yields. However, the study revealed that over-fertilisation not only failed to increase yields but also led to unnecessary expenses and environmental harm. Under-fertilisation, though less common, was also observed due to farmers' financial constraints.\nTo address these challenges, researchers are exploring innovative technologies to improve fertiliser efficiency. One promising approach, according to Professor Hosseini-Bai, is the use of biochar - a charcoal-like substance produced from agricultural residues and waste through pyrolysis, a process that involves heating in the absence of oxygen. Often referred to as \"black gold\" for soil, biochar offers a multitude of benefits, including enhancing soil health and fertility, promoting sustainable waste management and mitigating climate change.\nExplaining its effects, Professor Hosseini-Bai said, \"Biochar enhances soil's ability to retain nutrients and water, reducing the need for excessive fertiliser and irrigation. Its water-retention capacity is particularly valuable during drought. Because it is highly stable, biochar can remain in the soil for centuries, significantly increasing carbon storage.\"\nBiochar also acts as a carbon sink by locking CO2 underground for hundreds of years. Its porous structure functions like a sponge, retaining moisture, micro-organisms, and essential nutrients such as nitrogen and phosphorus, as well as gases like carbon dioxide and nitrous oxide. Considering these benefits, the Intergovernmental Panel on Climate Change (IPCC) recognised biochar as a potential tool for climate change mitigation. \nDespite its potential, biochar adoption remains limited by cost and accessibility. Professor Hosseini-Bai has developed both liquid and solid biochar-based fertilisers that are nutrient-efficient, reduce dependence on conventional inputs, and are effective across a wide range of crops. She notes that wider adoption is hampered by limited commercial production - an obstacle that could be addressed by introducing low-cost kilns into formal markets.\nHer research also shows that combining biochar or other organic matter with fertilisers can substantially improve yields. Biochar's properties vary according to the feedstock and production method, allowing it to be tailored to specific soil conditions. Smallholder farmers can design their own kilns and produce biochar on-site. Farmers can also compost or mulch organic farm and household waste such as rice husks, straw, fruit scraps, or manure, and apply it alongside fertilisers for similar benefits. Even simple techniques, such as burying organic matter, igniting it, and covering it to limit oxygen, can make biochar production feasible in resource-scarce settings. However, organic matters like manure and straw are often used as fuel or livestock feed, which may limit their availability for soil improvement.\nUnlocking biochar's full potential will require concerted action by government, researchers, and farmers. Public investment in production facilities, training programmes, and farmer support can accelerate adoption. At the same time, academic and research institutions can play a pivotal role in this regard by sharing knowledge, making research findings widely available, and establishing demonstration sites to showcase biochar's effectiveness in real farming conditions.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How biochar can boost fertiliser efficiency",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-biochar-can-boost-fertiliser-efficiency-1755355026",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 17, 2025 00:00:00  \n\n \nSince October 7, 2023 Israel has killed 64 thousand Palestinians by incessant bombing on Gaza, West Bank and Jerusalem. From the very beginning of their invasion, Organizations of Islamic Conference (OIC) reacted very sharply and summoned an Islamic Summit Conference in Jeddah, Saudi Arabia in response to the Gaza war and to discuss overall Middle East security and threats. \nWe were very optimistic that the OIC would stand with solidarity and take stern action to resolve the crisis and put pressure on Israel to stop the bombing and killing of civilians. The world media swept through the headlines with the summit's outcomes and published a group photograph of the OIC Leaders where they were seen with an airy smile that ultimately shocked the whole Muslism Ummah. \nWe did not expect their smiles in response to the Gaza war and the killing of unarmed Muslims. The photograph told us thousands of words which reflected the Muslim countries' inactiveness and submissive policy on Gaza crisis. Once again it was proved that they were utterly fragile and divided regarding their commitment to resolve the crisis.\nGaza is now fighting alone when 57 member states of OIC are standing cynically to see how the Muslim brotherhood is buried in Palestine, Muslim brotherhood shattered and they failed to uphold the spirit and sentiment of billions of Muslims. Rather countries prefer to issue statements and provide medical and food aids to them while they are indifferent to Israel's demonic attitude towards the Palestinians. \nWhen OIC gathered in Jeddah, Saudi Arabia in November 2023 the death toll in Gaza was then raised to 12 thousand. \nOIC's action is limited to issuing statements while America and Europe have been providing all out support with weapons, missiles, bombs and ammunitions. Not only that, they are flying from country to country to glean support for Zionists.\nAs Muslim we are ashamed as we have lost our strength, unity and fellow feelings of Muslim brotherhood. Sympathy is not enough for the affected Muslim brothers and sisters in Palestine. Now it is high time for Muslim states to put pressure by all means on Zionists to stop the war. \nAbu Taher\nSenior Deputy Director (P & P)\n Institute of Chartered Accountants of Bangladesh\n abutaher011@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Sympathy not enough for Palestine",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/sympathy-not-enough-for-palestine-1755355049",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-08-2025"
    }
]