[
    {
        "full_article": "With President Droupadi Murmu withholding assent for the Tamil Nadu Admission to Undergraduate Medical Degree Courses Bill 2021, the State is bracing for another battle against National Eligibility cum Entrance Test (NEET)-based admissions. State Chief Minister M.K. Stalin has convened a meeting of legislature party leaders on April 9 to strategise the next move. With the admission season approaching, the development is bound to cause uncertainty and make medical aspirants anxious. Exemption from NEET now remains an inconclusive chapter in the State’s decade-old policy discourse. No other State effort to legislate against a central mandate has been so protracted and unpredictable. In September 2017, two anti-NEET Bills met with a similar fate in Rashtrapati Bhavan. Four years later, the ruling DMK — having made NEET exemption a central electoral promise — passed the Bill in the Assembly based on the recommendations of the Justice A.K. Rajan Committee. Instead of forwarding it for presidential assent, Governor R.N. Ravi returned it to the House after five months. In a historic first, the Assembly unanimously re-adopted the Bill and sent it back to him; the Governor subsequently forwarded it to the President. Last week, Mr. Stalin informed the Assembly that assent had been denied, without specifying when Rashtrapati Bhavan had communicated the decision.This delay in the matter attaining finality is concerning as students have been left facing a state of perpetual uncertainty. The State remains firm in its policy of conducting admission for government quota medical seats based on the Class 12 Board examination scores. Early on, the Ministry of Home Affairs had asked “whether the Bill endangered the sovereignty, unity and integrity of the nation” to which the AYUSH Ministry responded affirmatively. The framers of the Constitution had incorporated Article 254 (2) empowering the President to grant assent to Bills repugnant to central laws on Concurrent List matters. NEET has been consistently upheld by the Supreme Court of India too. The President is under no obligation to give assent, although the Bill reflects the collective will of Tamil Nadu’s legislature: it was passed unanimously. True, NEET is neither foolproof nor an absolute measure of academic competency, but Tamil Nadu’s legal options are limited. The judiciary is unlikely to settle the issue with any urgency. The State must prepare for a legal struggle, and in the interim, coach students to face NEET with confidence. Published - April 08, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        entrance examination\n                    \n                            /                      \n                        \n                        medical education\n                    \n                            /                      \n                        \n                        medicine\n                    \n                            /                      \n                        \n                        Tamil Nadu\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Dravida Munnetra Kazhagam\n                    \n                            /                      \n                        \n                        Governor\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        test/examination\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        judiciary (system of justice)",
        "headline_1": "Inconclusive chapter: On Tamil Nadu and NEET",
        "headline_2": "Tamil Nadu should help prepare its students for clearing NEET",
        "link": "https://www.thehindu.com/opinion/editorial/inconclusive-chapter-on-tamil-nadu-and-neet/article69423400.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "Prime Minister Narendra Modi’s visit to Sri Lanka, (April 4-6), his first after 2019, demonstrated, beyond optics, the close ties between the two countries. Colombo, under the Janatha Vimukthi Peramuna (JVP)-led National People’s Power (NPP) regime, is serious about improving relations with New Delhi. This was evident from the conferment of its highest honour for foreign leaders on Mr. Modi and a memorandum of understanding (MoU) on defence cooperation, billed as the first of its kind in bilateral ties. The JVP’s ascension to power, following Anura Kumara Dissanayake’s victory in the presidential poll in September 2024, and the NPP’s resounding parliamentary election victory two months later, gave room to the perception that there would be a strictly formal, if not cold, relationship with India, given the JVP’s anti-India posture of the past. There was also apprehension that Colombo might not be sensitive to New Delhi’s security concerns. However, to be fair to him, Mr. Dissanayake reiterated his country’s long-standing position that Sri Lanka would not permit its territory to be used against India’s security and regional stability. Mr. Modi captured the rationale behind the MoU by saying that “the security of both countries is interconnected and co-dependent”. Even though the MoU may have formalised certain arrangements in the area of defence, bilaterally, it is up to the NPP regime to establish that Sri Lanka means business in defence cooperation. But still, Sri Lanka is sure to be conscious that an understanding in 1987 not to let Trincomalee or any other Sri Lankan port be used for military purposes by a third country against India has not helped dispel India’s concerns.On the vexatious fishermen’s issue — one of importance to Tamil Nadu — it was a good sign that there were detailed discussions. But Mr. Modi’s visit should trigger a full-fledged discussion between the fishing communities of the two countries, and one that is overseen by government officials. Recently, fishers on either side of the Palk Bay met and exchanged their views. If this meeting is to have some meaning, it should be followed up with another round of talks. A flexible approach will help create a lasting solution. Another significant outcome of the visit is that Tamil parties, in their meeting with Mr. Modi, conveyed the point that they recognised the significance of the Indo-Lanka Accord of 1987 in pursuit of achieving a political settlement for the Tamils and sought India’s “legitimate involvement”. There has been criticism even in Sri Lanka that many of the parties had not fully supported the Accord, which paved the way for the establishment of provincial councils as a measure of devolution. New Delhi, which can provide liberal economic aid for the war-torn Northern and Eastern provinces, should play the role of a dispassionate observer and urge every stakeholder to pursue democratic means to arrive at a consensus. Published - April 08, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        India-Sri Lanka\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        award and prize\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        national security\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        fishing industry\n                    \n                            /                      \n                        \n                        economic policy\n                    \n                            /                      \n                        \n                        democracy",
        "headline_1": "Dispelling concerns: On Modi visit and India-Sri Lanka ties",
        "headline_2": "Modi’s visit to Colombo should help advance ties and resolve disputes",
        "link": "https://www.thehindu.com/opinion/editorial/dispelling-concerns-on-modi-visit-and-india-sri-lanka-ties/article69423431.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "By B Purushartha\nThe idea of Ram is unparalleled in its character, contribution, and impact. Ram has been understood in multiple ways. For many, Ram is a historical man, but for some, Ram means good qualities, and the Ram-Ravan war is an inner war between good and evil.\nRam is so ingrained in Indian life and culture that we all accept him. He is ishtde vfor believers of a personal god (like Tulasi) but also dear to believers of an impersonal god (like Kabir). Ram-Rajya is synonymous with the ideal rule, and Ram-Baan with the infallible tool. ‘Hey Ram’ is the mostused sigh of the oppressed. He is an ideal son, brother and friend. While questions are raised about Ram as a husband, Ram and Sita are considered to be the perfect couple. In the Hindi belt, majority of marriage songs are based on Ram. Ram is a common name for many people, and Ram-Ram is a standard greeting in rural and semi-rural setups. Ram is such an integral part of our daily life that our everyday discourse cannot be without using the word ‘ram’.\nRam is not limited to elite class but worshipped by innumerable deen-dukhi people, including those outside brahmanical order: “Jo gati jog birag jatan kari nahin pavat muni jnani/So gati det gidh Shabri kahan prabhu bahut jiya jani” – Ram easily gives that to the downtrodden which is unattainable by high priests. His popularity cutting across caste, creed, religion and geographical boundaries is a puzzle for many who wish to see India through a narrow lens.\nBut how did Ram attain such status and importance? Not just because he is an avatar. Ram is in a different league. This importance comes from the sacrifice and progressive outlook exemplified by him. Ram’s sacrifice is unparalleled, and tapasya is long and painful. Despite being worthy and powerful, he shuns the kingdom for his father’s wish. Being truthful to his vow, he never took comfort from royal patronage during vanvaas. He accepted everyone equally and empowered them. Ram led people to change the world.\nMany felt sorry for Ahilya, but only Ram worked for her social reacceptance. Only Ram wept for his wife. For setting the new maryada, he fought with the high and mighty Ravan, Indra, Jayant and Bali. Ram’s fight was not only for his wife, but it was for the oppressed. He avowed in Atri Muni Ashram to rid the world of oppressors.\nWhile many cultures and civilisations assign the law-giving role to the wealthy and powerful, India assigns this role to the wise and tapasvi, who are beyond material pursuits. Ram is the ideal person tailor-made for this role, and he ensures that he does so while remaining a lifelong tapasvi – Ram tapasvi raja. That is why Allama Iqbal writes: “Hai Ram ke wajood pe Hindostan ko naaz/Ahl-e-nazar samajhte hain is ko Imam-e-Hind” – India is proud of Ram, wise consider him spiritual guide of India.\nThe writer is joint secretary, DEA, Ministry of Finance, GOI. Views are personal\n\n",
        "headline_1": "Ram accepted everyone equally",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/ram-accepted-everyone-equally/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "With Trump slapping reciprocal tariffs on significant US trading partners, and a 10% baseline tariff on almost all countries, markets across the world are in turmoil. Japan was hit with 24% tariff and is planning to invest more both in US and in the domestic market to counter the impact. Tokyo hopes this will be an effective way to persuade Trump to soften the tariffs.\nBut the US-China trade war, in particular, has sharply accelerated. In Feb, US imposed 10% tariff on all products imported from China. In March, it added another 10%. China had responded to this by raising 15% tariff on coal and LNG from US, and 10% on American oil, agricultural and farm machinery, and large-engine cars. In March, China also raised 10-15% tariffs on agricultural products from US.\n\nRead full story on TOI+ \n\n",
        "headline_1": "Trade isn’t why Trump tariffed China",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/trade-isnt-why-trump-tariffed-china/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "Last week, the Waqf Amendment Bill 2025 was passed after two marathon days of debate in both houses of Parliament. There are now protests by some Muslim organisations in different parts of the country. Most opposition parties are backing these protests, and some opposition MPs have already petitioned the Supreme Court against the Bill. It is possible that these protests will fade out, but it is equally possible that they will linger on like the protests against the Citizenship Amendment Act.\nProtesters say this legislation is unconstitutional since it tinkers with the rights guaranteed under Article 26 of the Constitution, which gives any religious group or denomination the right to “establish and maintain institutions for religious and charitable purposes; to manage its own affairs in matters of religion; to own and acquire movable and immovable property; and to administer such property in accordance with law.”\n\nRead full story on TOI+\n\n",
        "headline_1": "It’s not about Waqf",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/its-not-about-waqf/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "Will India or Vietnam make the best of an iconic American company’s supply chain woes?\nBloodbath. For US stock after stock, that was the commonest fate on Liberation Day. Apple, the world’s most valuable company, saw its shares slide 16% over Thursday and Friday. The April 2 tariffs have it in a pincer grip. China, which still assembles about 80% of the about 220mn iPhones sold in a year, has been hit with a 54% tariff. Analysts say this could mean a whopping 40% rise in iPhone prices. They are still lifting their jaws off the ground after watching Trump knocking out American icons like this. Apple has to deal with this blow in a flattening smartphone market. In its woes is the story of all businesses scrambling to rejig their global supply chain in the stormy new tariffverse.\nAs TOI reported yesterday, the company has already made “unusually high” number of shipments to US, from factories in India and China. So it may be able to hold off a retail price hike for a bit. India, which assembles around 15% of iPhones, has been hit with a 26% tariff. This is lower than China’s but way more than companies planned for when they started diversifying here, impelled by Trump’s first term and then by Covid. India, however, saw limited benefits from this China Plus strategy compared to countries like Vietnam. Factors ranging from simplifying tax laws to proactively signing FTAs helped the others pull ahead of us in expanding their export shares. This time around, the stakes are even higher. China’s now thrown retaliatory tariffs into the ring. “They panicked – the one thing they cannot afford to do,” Trump said. But our columnist today suggests that Washington will not be engaging in tariff negotiations with China anyway.\n\nBetween them things are bound to get worse. Other countries hope to get a happier hearing. Vietnam, hit with a 49% tariff, has talked to Trump already, offering to pull down its own tariff wall altogether in exchange for US softening. Vietnam has a $123.46bn trade surplus with US, compared to India’s $45.66bn. They will both do what it takes to benefit from the strategic decoupling of US from China. If the April 2 tariffs stay sticky, it should be advantage India. But the ifs are infinite. One thing that’s certain is that any smartphone manufacturing that moves to US is less likely to be done by Americans – than by their robots.\n\n",
        "headline_1": "Who’ll grab Apple pie",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/wholl-grab-apple-pie/",
        "news_paper_name": "The Times of India",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Irrational rice price hike and govt's role",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/irrational-rice-price-hike-and-govts-role-1744041153",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Yunus-Modi meeting: Rebooting Indo-Bangla ties",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/yunus-modi-meeting-rebooting-indo-bangla-ties-1744041260",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Dhaka's lost lungs",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dhakas-lost-lungs-1744041360",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Training new investors in stock market",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/training-new-investors-in-stock-market-1744041377",
        "news_paper_name": "The Financial Express",
        "publish_date": "08-04-2025"
    }
]