[
    {
        "full_article": "The G-20 leaders’ summit in Johannesburg, the first ever held in an African country, was unique in many positive, and some not-so-positive ways. The summit has an added voice as the African Union was made a member during India’s G20 Presidency in 2023. As a result, the deliberations and the declaration seemed imbued by the spirit of the “Global South”, as they listed the multiple challenges the world faces including conflicts, deepening inequality and increasing economic uncertainty. In particular, the nations gathered called for a “just, comprehensive, and lasting peace” in “Sudan, the Democratic Republic of Congo, the Occupied Palestinian Territory [and] Ukraine”, invoking the UN charter. Prime Minister Narendra Modi spoke at all three sessions of the G-20, suggesting six initiatives that India could lead in order to address some of those issues, particularly on the need to “reconsider” the parameters of global development. These initiatives included a Traditional Knowledge Repository, a G20-Africa Skills Multiplier Initiative (where India proposed to train a million people across Africa), a Global Healthcare Response Team, an Initiative on Countering the Drug–Terror Nexus, an “Open Satellite Data Partnership” to share agriculture, fishing and disaster-related information, and a “G20 Critical Minerals Circularity initiative”. The government asserted that it had a role in drafting the declaration, but would have been disappointed by the brief condemnation of terrorism when compared to the 2023 New Delhi declaration, given the Delhi blast and the Pahalgam attack.The leaders present spoke volubly about the need for bolstering the G-20’s role in managing global challenges, but were silent on the absence of the most important dignitary — U.S. President Donald Trump did not just skip the Summit, but the U.S. government also boycotted it, sending only a diplomat as an observer. This is the first time that the U.S., that has cited tensions with South Africa over “alleged discrimination” against “White minority farmers”, has walked away from the summit of the biggest economies. Aside from the irony of a “boycott” against South Africa, which suffered apartheid under the Afrikaner-led regime, the U.S.’s decision also raises questions over its commitment to the G-20 even as it takes over its presidency for 2026. The absence of the leader of the largest economy and the lack of universal criticism of the decision run counter to the hope and hype of the G-20 finally representing a more democratic world order over the last few years. The spirit of ‘Ubuntu’ or “I am because we are”, referred to in this year’s declaration, must be heeded by the very powers that would seek to sideline the grouping today. Published - November 25, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        G20\n                    \n                            /                      \n                        \n                        South Africa\n                    \n                            /                      \n                        \n                        international law\n                    \n                            /                      \n                        \n                        Indonesia\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Brazil\n                    \n                            /                      \n                        \n                        G-20 New Delhi 2023\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        Sudan\n                    \n                            /                      \n                        \n                        Democratic Republic of Congo\n                    \n                            /                      \n                        \n                        Palestine\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Africa\n                    \n                            /                      \n                        \n                        narcotics & drug trafficking\n                    \n                            /                      \n                        \n                        critical minerals\n                    \n                            /                      \n                        \n                        mining\n                    \n                            /                      \n                        \n                        recycling",
        "headline_1": "Missing ‘Ubuntu’: On the G-20 leaders’ summit in Johannesburg",
        "headline_2": "The U.S. boycott of the G-20 summit in Johannesburg was impolitic",
        "link": "https://www.thehindu.com/opinion/editorial/missing-ubuntu-on-the-g-20-leaders-summit-in-johannesburg/article70318310.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "New US franchise has no golden arches. Instead, the American megaphone is now being used to cheer the inversion of norms, from South Korea to Brazil\nA hardline politician who complained about immigrants’ propensity to eat a favoured animal species wins a party leadership contest.\nA billionaire businessman in his 70s celebrates re-election with jubilant supporters wearing red baseball caps emblazoned with a message about national strength.\n\nPoliticians spout words such as “Antifa”, “DOGE” and “ICE”.\nRead the full story on TOI+.\n\n",
        "headline_1": "MAGA gone global",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/maga-gone-global/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "Lanka’s PM is popular and was given a grand welcome by New Delhi. Knotty bilateral issues remain as difficult though\nOnce again highlighting legacy issues between India and Sri Lanka, the Madrashigh court recently directed the Centre to consider and pass orders on the representation by a Tamil repatriate from Lanka seeking Indian citizenship for himself and his family.\nR Thiyagavijayan asserts his repatriate identity.\nHe has been treated as a refugee thus far, and his is but one example of the many complicated strands of the India-Lanka relationship.\n\nAnd managing this relationship will require considerable resolve from both sides.\nBut who’s really in charge in Colombo’s parliament?\nRead the full story on TOI+.\n\n",
        "headline_1": "She gets headlines but does she have answers?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/she-gets-headlines-but-does-she-have-answers/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "By Narayani Ganesh\nWho thought that ‘6-7’ would be selected as ‘word’ of the year 2025 by Dictionary.com, while conceding that ‘6-7’ is a usage that is impossible to define? And on his talk show, an exasperated Stephen Colbert lamented that ‘6-7’ is not even a word; it is a numeral!\nMany may be familiar with the idiomatic phrase, to be ‘at sixes and sevens’ denoting a state of confusion, uncertainty or simply put, when one feels addled. What does ‘6-7’ mean, something that the Alpha generation and Gen Z have made a part of their vocabulary?\nThe numerical term was first heard used by rapper Skrilla in a song, something thrown in for effect or rhythm, perhaps, not intended to mean anything. Now it has gone viral among teens, who delight in the fact that adults are stumped and puzzled, wracking their brains as to what this new slang could possibly mean.\nAnd nothing could delight youngsters more than their communications to be incomprehensible to adults.\nThat apart, it is interesting to extrapolate on such usages, and ponder over phrases like Unees-bees (19-20 in Hindi) and Comme ci Comme sa (in French).\n\nThe former alludes to a minor difference in measurement or quality and the latter refers to something that is indefinable, neither here nor there, as in saying something like neither are things going well with me nor are they going not-so-well. Delightful uncertainty.\nToday, no one has the patience to listen to word-filled speeches. With digital explosion and short attention spans, acronyms, slang, and emojis have become ubiquitous, as has the amorphous ‘6-7’. Filibusters in Parliament are now history. There is more of aggression, and outbursts, rather than well-thought-out, even literary, expressions of opinion, anguish and concern.\nThe most infuriating response a tween could give to an adult, is to fall silent, say some. For silence can be deafening. In one of his works of science fiction, Arthur C Clarke wrote of how one fine day, all triggers in the world became disenabled. So no guns could fire, and the world fell silent, so to speak, and what else could prevail then, but peace?\nTo live in a soundless world may mean the end of firing and abuse, shouting and screaming, but it may also mean the end of good music and conversations, of the chirping of birds and gurgling of streams, of the crunch of a crisp wafer in your mouth, of waves breaking, of whooshing winds and the pitter-patter of rain.\nA world that falls completely silent would be a dead world. As someone said philosophically, if a tree falls in the forest, and no one is around to hear it, does it make a sound? It is all about observation and perception.\nMany existential questions could arise, like, could something exist outside of our consciousness? That is, if we do not observe or perceive it?\nA sound is a sound, only if it is perceived by the ear. And by that token, 6-7 is a word only if it is perceived so by those using it in the word-sense.\nAnd with all of this, now I am experiencing a kind of 6-7 situation, something that I am unable to put in words, with all the addling going on. Maybe 6-7 is the answer, then.\n\n",
        "headline_1": "At sixes and sevens: Consciousness & 6-7",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/at-sixes-and-sevens-consciousness-6-7/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "Thanks to SIR, bhooth-capturing may become a thing of the past\nIf indeed the 65L names deleted from the records by the Special Intensive Revision (SIR) were of bona fide living residents of Bihar whom the ruling dispensation in the state (and the Centre) allegedly wanted to disenfranchise, there should have been a huge outcry at the polling booths. But there was none. So the inescapable conclusion is that many, if not most, of the electoral rolls in India are haunted – full of ghosts of people long gone.\nAs by their very nature they lack form, these spirits could be persuaded to spectrally arise from the rolls to take on the guise of whoever the ruling dispensation wants at election time. And for decades, the relevant authorities were apparently happy to accommodate these obliging disembodied beings in the rambunctious festival of democracy that we Indians call elections. This eidolic cohort could be called, to coin a phrase, poll bhooths.\nThey came in especially handy for that peculiarly Indian poll-time activity called bhooth-capturing, which was how some political parties facilitated desirable election results. Lakhs of ghostly voters mysteriously cast their ballots without being seen, often leading to improbable victories or victory margins. Those who did not believe in this supernatural adult franchise, of course, had a more mundane name for this phenomenon: scientific rigging.  \nCultivating this phantasmal constituency has its advantages too. They do not have any demands, given their disembodied state. For much the same reason, they also do not have any political loyalties; arguably they can be roped in to bolster the electoral chances of anyone resourceful enough to ‘capture’ these bhooths. But SIR has proved to be a ghostbuster par excellence. Thus, the political bhavishya (future) of these bhooths of elections past appears dim.\nGhosts do not have discernible voices, alas. So even if they still want to rally behind any political party’s ‘vote chori’ clarion call in the future to demand their right to resume or continue participating from the afterlife, they cannot be heard. Even if they became audible somehow, electoral rules debar them as such rights end with, well, death. Poll bhooths have to reconcile themselves to the fact that their incorporeal participation in Indian elections is over. \n\n",
        "headline_1": "Bhooth-proof elections",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/cultural-chromosomes/bhooth-proof-elections/",
        "news_paper_name": "The Times of India",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "When the ground shook violently on November 21, the city's seismic assessment system was, quite literally, locked. For 16 months, the Urban Safety and Resilience Institute (USRI) in Mohakhali has stood as a 10-storey monument to waste. Completed in June 2024 and funded by the World Bank, the Tk 250 crore facility was meant to be the capital's seismic sentinel. Yet, while the fault lines have been active, the bureaucracy has remained comatose.\nThe problem is not a lack of expertise, but the absence of paperwork. Rajdhani Unnayan Kartripakkha (Rajuk), the capital's development authority, claims it has been waiting for ministry approval to operationalise a \"deed of trust.\" Only after last weekend's triple shock did Rajuk hurriedly send the necessary files to the housing and public works ministry, as this newspaper reports. It is a classic case of administrative reflex: a flurry of paper-pushing that begins only after the crisis has arrived.\nIn geology, stasis is usually reassuring. In governance, it is dangerous. Dhaka's residents were reminded of this on Friday, when a magnitude 5.7 earthquake struck Madhabdi, just outside the teeming capital. It was the strongest tremor in decades—cracking walls, claiming at least 10 lives, and sending lakhs into the streets. But the earth had more to say. Over the next 32 hours, two additional tremors followed, including a magnitude 3.7 jolt in Badda, a dense neighbourhood at the city's core.\nNerves are frayed. Yet, the nation's earthquake preparedness remains stuck in the shivering inaction that paralyses USRI, the very institution designed to safeguard the public. Inside the building sits a laboratory stocked with European gadgetry—terrestrial laser scanners, ground-penetrating radar, tri-axial testing systems. These machines can peer into concrete beams and count rebar without scratching the paint. They are the difference between knowing a building will stand and simply hoping it will. The timing makes the negligence even starker. Dhaka's sprawling periphery rests on soft alluvial soil that amplifies seismic waves; it is a vertical city built on hope and, too often, dubious concrete. A pilot assessment under the project examined some 3,250 schools and hospitals, identifying 42 buildings needing immediate demolition and 200 requiring retrofitting. Extrapolate that across a metropolis of over two crore people—where rapid urbanisation has easily outpaced regulation—and the scale of vulnerability becomes painfully clear. Leaving these diagnostic tools unused at USRI while the ground moves beneath us is both negligent and dangerous.\nHigh-tech equipment atrophies when idle. The sensors and scanners at USRI have already missed a year of maintenance. Still, the Rajuk chairman insists he is \"very positive\" that the institute will launch now that the paperwork is moving. One hopes so. But earthquakes do not wait for bureaucrats to approve deeds of trust. If we want to survive the \"big one,\" we must understand that resilience requires more than constructing a building or purchasing expensive equipment; it demands that the equipment is switched on.\n",
        "headline_1": "Quake defences delayed by red tape",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/quake-defences-delayed-red-tape-4042541",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "There was widespread hope that, after the mass uprising, Bangladesh would finally see an end to extrajudicial killings, enforced disappearances, unlawful detention, and other serious human rights violations. The interim government set up a commission to investigate cases of enforced disappearance—a long-awaited step. Sadly, despite this gesture, extrajudicial killings, custodial deaths, mob violence and other forms of abuse have continued during its tenure. This is deeply disappointing.\nAccording to human rights group Odhikar, 40 people have been victims of extrajudicial killings in the 14 months since the interim government assumed responsibility. Among them, 19 were shot dead, 14 died due to torture, and seven were beaten to death. Allegations have surfaced implicating the police, joint forces, and the army. What is particularly noteworthy is that, although the interim government has initiated investigations into enforced disappearances, no comparable initiative has been taken to investigate or prosecute extrajudicial killings and so-called \"crossfires.\"\nThe persistence of such killings under the interim government demonstrates that little has changed within the country's law-enforcement agencies beyond the reshuffling of individuals. Without structural reform of the police, intelligence bodies, and other security forces, even basic human rights cannot be ensured. The UN Human Rights Office had recommended dissolving the Rapid Action Battalion (RAB), restricting the Border Guard Bangladesh (BGB) to border-protection duties, and limiting DGFI strictly to military intelligence. But the interim government changed only the uniform, not the institutions—and the result is visible in the continuing rights violations.\nAlthough the interim government has repeatedly stated that it opposes mob violence, its actions have not reflected a serious commitment. According to the human rights organisation Ain o Salish Kendra (ASK), 220 people were killed in mob violence between August 2024 and September 2025. Many of these incidents were driven by personal, group, or business interests. If the government had ensured swift prosecution and exemplary punishment of the perpetrators, it would have sent a strong message that mob justice would not be tolerated. Instead, arrest rates remain extremely low.\nProthom Alo's investigation into 46 mob violence incidents that killed 67 people over 13 months shows how weak the enforcement response has been. Of the 46 incidents, cases were filed in 36, while no cases were filed in 10. In the incidents where cases were filed, there were over 9,000 accused, including unidentified individuals. Among these, 114 people were arrested in 27 cases, resulting in an arrest rate of just 1.27 percent. Charge sheets have been submitted in only six cases.\nMeanwhile, the military's crackdown on the Bawm ethnic community in Bandarban—initiated during the previous Awami League government under the pretext of suppressing the Kuki-Chin National Front (KNF)—has continued unabated under the interim government. Instead of targeting an armed group, the entire Bawm population appears to have been treated as collectively suspect, subjected to punitive restrictions.\nAccording to Amnesty International, at least 126 Bawm civilians—including 30 women and children—were arrested without specific charges during April-May 2024 under the previous government. Over a year later, during the interim administration, some have obtained bail while others remain detained. Many are physically ill and psychologically distressed. Three Bawm detainees have died in custody.\nUnder the guise of KNF suppression, the military has imposed sweeping restrictions on the daily lives of the Bawm people. They require written permission from army camps to transport crops or travel outside the district. For example, according to an investigation by the Netra News, a Bawm resident from Paitong Para in Ruma upazila had to submit a formal, deferential written request to move 40 maunds of turmeric to market. Another resident needed military approval to travel to Dhaka for dental treatment.\nBy any measure, such blanket restrictions on civilians amount to serious violations of human rights and civil liberties. Collective punishment of an entire ethnic community is characteristic of occupying powers, not of a sovereign state's treatment of its own people. That such practices continue reflects the grim state of human rights in Bangladesh.\nThe human rights violations during the interim regime have drawn international attention as well. Human Rights Watch (HRW) in a statement issued on October 8, 2025, accused that thousands had been arrested under the interim government, many on dubious murder allegations, while scores were being held under the Anti-Terrorism Act, 2009. Between August 2024 and October 2025, there have been 45 custodial deaths, as per ASK data. Even two men died in police custody as recently as this Friday, with the families alleging torture in both cases. Many others also alleged mistreatment in custody, including lack of access to medical care. HRW specifically condemned the arrest of 16 individuals, including journalists and academics, who were detained under the anti-terrorism law on August 28 during a discussion organised by Mancha 71. Reporters Without Borders (RSF), in a statement issued on October 28, 2025, also condemned the arrests, including that of journalist Monjurul Alam (Panna), calling it evidence of the interim government's increasingly authoritarian tendencies.\nJournalist Monjurul Alam was recently released on bail after spending more than two months in jail. Meanwhile, DB police, without a warrant, forcibly picked up a journalist and a businessman from their home late at night. Although the journalist was released after 10 hours, the incident once again revealed that law enforcement behaviour has not changed. In Sylhet, police detained 22 members of Socialist Party of Bangladesh (SPB) from the party's city office and another 16 activists of the Communist Party of Bangladesh (CPB) from various locations for protesting the eviction of battery-run rickshaws. The way Sylhet Metropolitan Police picked up SPB and CPB activists relying merely on suspicion and invoking excuses such as \"third-party instigation\" and \"creating instability\" strongly echoes the repression tactics used by previous authoritarian governments to suppress dissent. In fact, throughout the interim government's tenure, police have often acted aggressively in suppressing protests by workers, teachers and other professional groups.\nTaken together, the persistence of extrajudicial killings, arbitrary detentions, and human rights abuses shows that the expectations raised after the mass uprising have not been fulfilled. With elections approaching and only a few months left for the interim government, it remains to be seen whether any meaningful improvement will occur or whether this troubling continuity will become further entrenched.\nKallol Mustafa is an engineer and writer who focuses on power, energy, environment, and development economics. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Human rights abuses persist under interim government",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/human-rights-abuses-persist-under-interim-government-4041821",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "For many years, leading microfinance institutions (MFIs) and non-governmental organisations (NGOs) have been managed through their respective boards of directors. These boards, usually comprising five to ten members, have long operated with relative autonomy. However, the government is now preparing to introduce a new regulation requiring every medium and large MFIs to include two independent directors on their boards, which is a significant shift in the governance structure of the microfinance sector.\nAlthough the inclusion of independent directors has long been common in banks and other financial institutions, this will be the first such initiative in this industry. The Microcredit Regulatory Authority (MRA), a government body under the Financial Institutions Division of the Ministry of Finance, has reportedly almost finalised the draft of this regulation. The proposed provision aims to enhance transparency, strengthen MRA's supervisory authority, and establish greater discipline in the sector.\nAccording to the draft, only institutions with outstanding loan portfolios exceeding Tk 50 crore will be required to appoint independent directors. It is estimated that about 100 institutions in Bangladesh will fall under this category. Each will propose four candidates, from which the MRA will approve two. To prevent conflicts of interest, close relatives of existing board members will not be eligible. Independent directors must be between 35 and 70 years old, possess at least 10 years of senior-level experience in a government or autonomous body, and preferably have a financial background. Furthermore, no individual may serve as an independent director in more than one MFI at a time.\nWhile the MRA asserts that the initiative will promote good governance and help curb nepotism, critics warn that it could open the door to political influence and excessive control. Many fear a repeat of the bureaucratic culture and political appointments that have plagued state-owned banks, leading to weak governance and corruption. Associations within the microfinance sector argue that such regulation could undermine the independent, community-driven model that has made Bangladesh's microfinance system a global example of financial inclusion.\nThe MRA, however, has clarified that the process will remain institution-driven: MFIs will nominate candidates, and the authority will ensure compliance and transparency. Alongside this move, the MRA has also proposed new requirements for appointing chief executive officers (CEOs) or executive directors. Institutions must obtain MRA approval within one month of appointing a new CEO, who must be between 40 and 65 years old, have at least 15 years of relevant experience, including five in a managerial role, and hold a postgraduate degree. The CEO's tenure will be five years, renewable upon reappointment.\nWhile the government's goal is to enhance accountability, much will depend on effective implementation. The real challenge will be maintaining a balance where oversight is strengthened without compromising the sector's innovative and autonomous nature.\nAcross the world, microfinance institutions and similar organisations operate under governance frameworks that ensure both accountability and independence. Typically, boards include executive, non-executive, and independent members with no conflicts of interest. They oversee specialised committees—such as audit, risk, nomination, and remuneration committees—that monitor specific areas of operation. Clear rules define director appointments, tenure, age limits, and reappointments. Day-to-day operations are managed by a CEO or managing director (MD), who reports directly to the board. The clear separation between governance and oversight is a hallmark of strong institutions. Most MFIs are also regulated by a central bank or financial regulator, which ensures licensing, financial reporting, and compliance.\nComparative studies on MFIs in Bangladesh, Nepal, and Malaysia show that sustainability depends on strong internal audit mechanisms, competent boards, adherence to the rule of law, and independent oversight. These factors are now widely recognised as essential components of sound governance and long-term institutional stability.\nIn countries with more advanced financial systems, governance structures are even more detailed. The definition of independence is clearer, directors' tenure limits are set, and each committee must include at least one independent member. To promote transparency, institutions must disclose directors' qualifications, meeting attendance, and remuneration. In many organisations, the roles of CEO and board chair are deliberately separated to prevent concentration of power. Boards are also subject to regular performance evaluations, often conducted by external reviewers. Strong regulatory supervision and capital adequacy requirements further reinforce financial stability and public confidence.\nUltimately, Bangladesh's proposed reforms align with international best practices, but their success will depend on fair, consistent implementation. Genuine good governance will be achieved only when these reforms enhance transparency, accountability, and credibility, while preserving the independence and community-based spirit that have long made Bangladesh's microfinance sector a global model for inclusive finance.\nNafew Sajed Joy has a master's degree in social sciences from Dhaka University. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Can the draft regulation make the microfinance sector stronger?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/can-the-draft-regulation-make-the-microfinance-sector-stronger-4041831",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "It is deeply disturbing that two men died in the custody of the Detective Branch (DB) of police on Friday in two separate incidents. In both cases, the families of the deceased have alleged that they were tortured to death. It is quite telling that what was quite common during the tenure of an authoritarian regime is still occurring, suggesting that the old, repressive practices of custodial torture have very much remained in place. Just imagine, there have been 45 custodial deaths in the country between August 2024 and October 2025, as per data from Ain o Salish Kendra (ASK).\nIn one of the cases cited above, 40-year-old Moktar Hossain was arrested in connection with the killing of a Jubo Dal leader in Pallabi, Dhaka. A report by this daily says that DB officers raided a location to arrest him on Thursday. Police claimed that Moktar tried to flee and was caught and beaten by local residents. They further claimed Moktar fell ill at around 1:30am on Friday and was then taken to Dhaka Medical College Hospital (DMCH) for treatment before being discharged and returned to custody. At around 10am, officers said they found him unresponsive when they called him to eat and took him back to DMCH, where he was declared dead. Was he really well enough after treatment to be taken back to the DB office? What happened between the time he was returned to custody and the time he was found unresponsive?\n\nThe same day, another suspect in a murder case, Md Shahadat Hossain—an auto-rickshaw driver who was arrested the day before—\"fell ill\" and died at the Sirajganj General Hospital. Shahadat's brother has alleged he was beaten to death while in custody, and that the police had demanded Tk 5 lakh for his release.\nWe may recall that in late January this year, the chief adviser strongly condemned any form of custodial torture and extrajudicial killing, ordering an urgent investigation into the death of Jubo Dal leader Tohidul Islam who died after being arrested by the joint forces. Yet despite the chief adviser's condemnation, custodial torture and deaths have continued. The Torture and Custodial Death (Prevention) Act, 2013 remains a law on paper only. So far, perpetrators have been punished in only one case of custodial death, that too back in 2020.\nReportedly, the government has finalised a draft ordinance to form an independent police commission. This aims to ensure accountability within the force and to make it fair, transparent, and free from politicisation. The commission would investigate citizens' complaints against police members and take necessary action. But will it also monitor police actions when a suspect is detained or interrogated? This must be part of any meaningful police reform. Until the commission is formed, it remains the responsibility of those in charge to ensure the safety of anyone held in custody, regardless of what crime they are accused of. We expect fair probes into these deaths, with the responsible officers brought to book.\n",
        "headline_1": "Two custodial deaths in a single day!",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/two-custodial-deaths-single-day-4041661",
        "news_paper_name": "The Daily Star",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 25, 2025 00:00:00  \nThe imbroglio that the Savar Leather Industrial Park finds itself in is the result of ineptitude and concerns other than the overriding one to turn this facility into a world class leather hub. Begun as early as 2003, the relocation of many tanneries from Dhaka's Hazaribagh took place in 2017 and continued well beyond. The fracas over the industrial estates' central effluent treatment plant (CETP) and the government's false claim for readying the leather park were to blame for no mass shift by tanneries from Hazaribagh to the new location in Savar. So far, 140 of the 155 tanneries allocated plots there have started operating but the rest are yet to complete construction of their factories. Actually, tanners alone are not responsible for such prolonged shifts. It is the deposed government that is accountable for the imbroglio. The malfunctioning CETP is not only acting as a disincentive but has also stood as an impediment to obtaining Leather Working Group (LWG) certificates by deserving leather factories and getting access to high-end export markets. The country's image as a leather and leather goods producer has also seriously been compromised. \nNow the implementation monitoring and evaluation division (IMED) under the ministry of planning (MOP) has assessed the weaknesses and lost opportunities of the leather industrial estate. Apart from the cost escalation and delayed construction of facilities, the number one crisis involves CETP's limited capacity and that too falling short of the standard treatment of effluent. The entire project thus fails to deliver the service it was meant to do. This failure turns out to be the main cause for hindering the prospect of Bangladesh's tannery industry. However, the fact that IMED took such a long time to investigate the tannery park's loopholes smacks either of its limitation or indifference to this potentially crucial foreign exchange earner, perhaps next to the readymade garments (RMG). \nAllegedly, industrial parks or any other mega projects are undertaken mostly for personal gains by quarters involved with the process, not on patriotic consideration. Or, how can one justify the fiasco bedevilling the CETP at the Savar leather estate? The Chinese company that got the working order for the CETP should have been made to account for the useless facility. The environmental damage caused to the River Dhaleshwari and the estate's surrounding because of the failure on the part of the treatment plant is incalculable. Any government anywhere would have filed a lawsuit against the company for non-compliance. \nSo here is a case of mismanagement of a vital project, a lack of monitoring and supervision or misgovernance. This also highlights the underdevelopment of countries under the rule of authoritarian and oligarchic governments which do not have to be accountable to their people. A country's progress is thus pulled down by its backlogs. This country desperately needs to diversify its export basket. The leather could not only fill some of the vacuum but also earn foreign exchange 50-60 per cent more in high-end markets compared to the low-end markets. Quite a number of leather factories are producing world-class leather goods. Reportedly, seven to eight factories have earned the LWG certificates with just one in the Savar leather industrial park, which has its own CETP. If about 150 tanneries could get the LWG certificates, the leather industry here could grab a good share of the around $500 billion global leather goods market, projected to grow to one valued at $855 billion by 2032.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "At last IMED diagnoses leather park's malaise!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/at-last-imed-diagnoses-leather-parks-malaise-1763996511",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       November 25, 2025 00:00:00  \nThere are moments in global affairs when the trajectory of history pauses just long enough for diplomacy to intervene. The latest US-driven effort to broker an end to the war in Ukraine may well be one of those rare moments. After more than 1,370 days of bloodshed, displacement, economic upheaval and escalating geopolitical risk, a faint ray of hope has emerged - fragile, fraught and fiercely contested, but unmistakable.\nLast week, the Trump administration quietly circulated a 28-point proposal to both Kyiv and Moscow. What came next was surprising: neither side rejected it outright. Russia called it a \"potential basis for negotiations.\" Ukraine signalled that, with revisions, the proposal could be workable. And on Sunday, representatives from both nations arrived in Geneva for the first serious talks in months, convened under U.S. auspices.\nThis moment did not materialise by accident. Since returning to power, President Donald Trump has made ending the Ukraine war a top diplomatic priority, hosting several rounds of back-channel consultations, most of which stalled midway. Yet the newest initiative has moved further and faster than previous ones, largely because the battlefield reality - and the global economic situation - is pressing all parties toward a deal.\nThe world, and especially countries like Bangladesh that have already endured the double shock of the COVID-19 pandemic and the Ukraine war, desperately needs a geopolitical ceasefire. The surge in commodity prices, energy instability, disrupted grain exports and volatile financial markets have collectively strained economies that were barely recovering from the pandemic's devastation. For developing countries, there is no path to sustainable recovery without a reduction in geopolitical conflict.\nThe 28-point U.S. proposal - portions of which have been leaked - is not a triumph for either side. It is designed as a compromise that will make many Ukrainians uneasy and many Russians dissatisfied. That, perhaps, is why it has a chance.\nAccording to reports cited by media, the draft envisions Ukrainian troop withdrawal from parts of eastern Donetsk now under Kyiv's control, effectively affirming Russia's de facto control over Donetsk, Luhansk and Crimea - regions that Moscow now considers non-negotiable. It also suggests freezing the front lines in Kherson and Zaporizhzhia along their current positions, even though both territories remain partially occupied.\nSuch concessions would be bitter for Kyiv. But the proposal also demands painful sacrifices from Moscow. Russia would be \"reintegrated into the global economy,\" but only through a complex and staged lifting of sanctions. It would be invited to rejoin the G7, forming a new G8 - a symbolic reversal of its pariah status. Yet it would also be expected to pledge not to invade neighbouring countries again, an assurance Moscow has resisted making.\nThe most controversial element for Kyiv is likely the limitation on Ukraine's armed forces - capping personnel at 600,000 down from nearly 880,000 today - and the requirement that Ukraine abandon its NATO membership aspirations. In exchange, the U.S. promises \"reliable security guarantees,\" though the nature of those guarantees remains murky.\nThis ambiguity is both deliberate and dangerous. Ukraine has long argued that without NATO membership or iron-clad security assurances, any agreement with Russia risks being a temporary pause before the next invasion. Moscow, for its part, has demanded precisely such restrictions as proof that Ukraine will not become a forward operating post for Western military power.\nThe contours of the deal thus reflect a geopolitical trade-off: a reduced Ukrainian military, a frozen conflict line, Russian territorial gains, Western economic reintegration of Moscow - all balanced by a U.S.-backed security framework intended to deter future aggression.\nIt is not perfect. But it may be the best chance available.\nTo understand why, one must confront the evolving battlefield reality. Russia now controls roughly 20 per cent of Ukraine's territory. Its forces, despite suffering heavy casualties, have made incremental gains across eastern Ukraine. Moscow has demonstrated that it is willing to expend considerable lives and resources to secure the Donbas and maintain control of occupied territories. Ukraine's counteroffensives, once emboldened by Western support, have slowed due to ammunition shortages, manpower constraints and growing political fatigue in Washington and European capitals.\nPresident Volodymyr Zelensky knows this. His country's survival has depended on U.S. aid, and without it the military balance may tilt decisively toward Moscow. Trump's ultimatum - urging Kyiv to accept the proposal before Thursday - was blunt, but it reflects the shifting strategic environment. Ukraine's battlefield leverage is diminishing, not expanding, and the promise of indefinite Western support is weakening.\nYet Russia, too, faces limits. Its economy, though resilient under sanctions, is stretched. Its demographic losses are mounting. A prolonged war risks further international isolation and deepening dependence on China. President Vladimir Putin may calculate that a negotiated settlement granting him control over key territories - and restoring Russia's place in global economic institutions - is preferable to an endless, costly conflict.\nStill, optimism must be tempered. The gaps between the parties remain wide. Ukraine will resist any plan that formalises Russian land seizures. Russia will reject any demand that includes full withdrawal. Western governments remain split over the scope of sanctions relief. And Trump's approach - transactional, unpredictable - could fracture the diplomatic consensus needed to enforce any agreement.\nYet there is a deeper truth: the world cannot afford another decade of this war. The economic repercussions have been global, persistent and profound. Every month the conflict continues, food prices surge, supply chains fray, energy markets destabilise, and fragile economies face new strains. For countries like Bangladesh, still grappling with pandemic recovery, the war is an imported catastrophe.\nThe global economy cannot recover without geopolitical stability. And geopolitical stability cannot be restored unless the war in Ukraine - the largest European conflict since 1945 - is brought to an end.\nThat means compromise. It means concessions. And it means accepting a peace that will leave bruises on all sides.\nThe United States, which has shaped the battlefield by supplying weapons and financing Ukraine's defence, now seeks to shape the peace. But the responsibility does not lie with Washington alone. Europe must engage more fully, Ukraine must weigh its long-term survival against short-term losses, and Russia must choose between reintegration and isolation.\nThe alternative is a grinding, endless conflict that will claim tens of thousands more lives, deepen global economic pain, and entrench a dangerous militarised standoff in the heart of Europe.\nPeace requires courage - and not just on the battlefield. It requires political courage, moral courage and strategic imagination. As negotiations continue in Geneva, both Kyiv and Moscow must decide whether they can accept an imperfect settlement for the sake of their own people and the stability of the world.\nHistory rarely offers second chances. This may be one. Let us hope the parties involved do not squander it - because the world cannot bear the cost of failure.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Can the world afford to miss latest US move to end Ukraine war?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/can-the-world-afford-to-miss-latest-us-move-to-end-ukraine-war-1763996576",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       November 25, 2025 00:00:00  \nScientists have made an engine that is hotter than the sun's core. But how hot is the sun's core? The temperature of the sun's core is around 15 million degrees Celsius. Usually, the temperature of a typical star's (our sun is also a star) centre is between 10 to 20 million degrees Celsius. To have an understanding of how hot that might be, it can be said that, it is 200 times that of a lightning bolt. \nThe density of the core of a typical star is four times the density of osmium, the densest-known element on earth. At extremely high density, as in the core of a star, the material that makes it breaks down and completely ionize the star's core. And the gaseous (usually hydrogen) core of a star, under such extreme pressure and heat undergoes a process called fusion, turning hydrogen into helium. As a result, a large amount of energy in the form of gamma rays and photons radiates outwards. This is exactly what happens at the core of the sun making it so hot. But humans have now beat the sun in producing such high temperatures with the help of a microscopic engine. \nTo investigate how engines work at extremely high temperatures, a team of scientists at King's College, London and collaborators have created the world's hottest engine.\nThe engine is basically a silica particle, i.e., a very tiny bead of glass, only around 5 microns or micrometres across. Notably, one micron is equivalent to one millionth of a metre. The tiny glass bead, or engine in this case, hangs in space defying gravitation (levitated) with the help of an electric field. The researchers can increase the temperature of the glass bead exponentially by jiggling it through applying what they call a 'noisy' voltage. However, the jiggling microscopic engine did not always follow the standard laws of physics, or more specifically, thermodynamics, which deals with the relations between heat, work, temperature and energy. In fact, these are exactly the issues that an engine is all about. An engine converts heat into useful mechanical work. Our common experience with an engine is that it has many parts. But in the present case, it is a single-part or particle engine. Temperature of an object, say, water, is about how fast its particles (molecules) move about. The hotter the water, faster the water molecules would move in a random fashion. That means when the engine or the glass bead vibrates extremely fast, we can say, it is extremely hot. Now why devising this microscopic engine and heating it up to such extreme levels? The idea is to understand how protein molecules, like the microscopic glass bead engine, run around and jostle with their surroundings in a cell. \nUnlike conventional machines, the tiny glass bead does not do anything particularly useful. As the particle moved about the electric field that jostled it, the temperature it experiences changed. This phenomenon is important for biological process such as protein folding. Proteins fold in millisecond, but the atoms which make them, move over nanoseconds. These divergent timescales make it very difficult for computers to model them. But by simply observing how the microparticle moves, as scientists in ancient times did, and by working out a series of equations based on that, scientists avoided the problem (computer modelling) completely. \nBy levitating the microparticle using the electric fields, scientists simulated the random forces that act on proteins during folding. Dr Jonathan Pritchett, Postdoctoral Research Associate at the King's College says, \"Proteins are the engines that powers most of the important processes in our body, so understanding their mechanics and how that can go wrong is a vital step in understanding disease and how it can be treated.\" The team believes this new method could use less energy and be more sustainable than methods that rely on digital computers.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "An engine hotter than the sun",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/an-engine-hotter-than-the-sun-1763996608",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 25, 2025 00:00:00  \n\nThe healthcare sector in Bangladesh is expanding rapidly, with increasing patient pressure, higher budget allocations and ongoing infrastructural modernisation. Yet this progress is scarcely reflected in the administrative structure of our hospitals. In most healthcare facilities across the country, doctors are still burdened with administrative duties. Although medicine and administration are two completely different professions, responsibilities ranging from patient care to financial management, human resources, procurement, and service supervision continue to be placed on the shoulders of physicians. This not only disrupts medical services but also impedes the overall development of hospitals. In this context, introducing a separate administrative cadre in every hospital has become an urgent necessity.\nA doctor's primary responsibility is to diagnose diseases, deliver treatment and respond to emergencies. They are not trained to manage administrative tasks such as budgeting, tender processes, accounting, HR management, supply chain oversight and legal documentation. When doctors are compelled to shoulder these duties, their time and attention become divided, which directly affects patient care.\nMeanwhile, the influence of brokers in upazila and district hospitals has grown alarmingly. These groups engage in unethical activities related to admissions, tests, medicine collection and diverting patients to private clinics. Hospital authorities often fail to take effective action due to legal or administrative limitations, making them overly dependent on executive magistrates. If hospitals had their own administrative cadre, they could control such malpractice through regular monitoring, enforcement, grievance resolution and strict discipline-thus reducing the need for frequent external intervention.\nAdministrative weaknesses also lead to problems such as medicine shortages, long-damaged equipment, poor state of cleanliness, absentee staff, wastage and irregularities in procurement. These issues persist largely due to the lack of skilled professionals capable of making quick and appropriate administrative decisions. Competent administrative officers could address these challenges far more efficiently.\nIn developed health systems, hospitals are managed by professional administrative teams, allowing doctors to focus solely on medical services. Countries such as England, Japan and Singapore employ dedicated health administration cadres, ensuring transparency, accountability and efficient service delivery.\nIn Bangladesh, establishing an administrative cadre in every hospital would result in disciplined budgeting, efficient supply management, proper infrastructure maintenance and improved service quality. It would reduce corruption, misuse of resources and inefficiency while making patient services faster, smoother and more humane.\nRaisul Islam Rifat\nNakla-Sherpur\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Admin cadre needed to manage hospitals",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/admin-cadre-needed-to-manage-hospitals-1763996977",
        "news_paper_name": "The Financial Express",
        "publish_date": "25-11-2025"
    }
]