[
    {
        "full_article": "The decision of the U.S. to designate The Resistance Front (TRF) group that claimed responsibility for the Pahalgam terror attack in April 2025, as a Foreign Terrorist Organization (FTO) and a Specially Designated Global Terrorist is a development that should undergird the global fight against terror. The Ministry of External Affairs has called it “a timely and important step”. For one, the U.S. State Department has acknowledged the severity of the Pahalgam attack. It also names the TRF as a “front and proxy” for the Lashkar-e-Taiba (LeT), which Pakistan claims it has rendered “defunct”. Even though the U.S. added groups such as the LeT and the Jaish-e-Mohammad to its FTO list in 2001, they have masterminded attacks in India since then. The U.S. has also partially made amends for the TRF’s name having been kept out of the UN Security Council (UNSC) resolution condemning the Pahalgam attack, apparently at Pakistan’s behest, but with the concurrence of the U.S. and other P-5 members. It is hoped that the designation will now help India’s case in designating the TRF at the UNSC, under the 1267 Committee for sanctions, also strengthening the trans-national legal pursuit of those behind the attack.While this is a positive step, it is necessary to put the Trump’s administration’s other actions since the Pahalgam attack into perspective. After India launched Operation Sindoor, the U.S. has countered India’s narrative on the four-day conflict on several occasions. Mr. Trump, as well as Secretary of State Marco Rubio, have repeatedly made the claim that the U.S. negotiated the India-Pakistan ceasefire, and averted a nuclear conflict by using trade ties as leverage — an equivalence which Pakistan has been happy to endorse. Mr. Trump’s unprecedented White House lunch and praise for the Pakistan military chief, Field Marshal Asim Munir, came hours after the government had said that Prime Minister Narendra Modi had cleared the picture with Mr. Trump, and brings into question just how much pressure the U.S. is willing to put on Pakistan to act against terrorism. The Trump administration had held out the promise of doing more to support India in its fight against terrorism by fast-tracking the extradition, in April, of Tahawwur Hussain Rana, who was wanted by India for the 2008 Mumbai attacks. It is hoped that the TRF’s listing means that the U.S. is recommitting to that objective. Given that the real challenge lies more in credibly ending Pakistan’s support to these groups, New Delhi must focus on its efforts, diplomatic as well as legal, to ensure justice for the victims and to prevent further terrorist acts. Published - July 21, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        act of terror\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        United Nations\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        India-Pakistan",
        "headline_1": "​A long list: on the U.S., designation of The Resistance Front group",
        "headline_2": "The designation of TRF as a terrorist group should put more pressure on Pakistan",
        "link": "https://www.thehindu.com/opinion/editorial/a-long-list-on-the-us-designation-of-the-resistance-front-group/article69834257.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "President Donald Trump, under pressure from a segment of his support base, has instructed his Attorney General, Pam Bondi, to request a court to unseal grand jury transcripts related to sex offender and former friend of the President, Jeffrey Epstein. While Mr. Trump had vowed, even during his presidential campaign, to unveil the files, in recent days he has faced mounting pressure to supply all relevant and new information pertaining to the case. The latest turn in the murky saga relating to Mr. Trump’s prior association with Epstein, the former financier who died by suicide in a New York prison cell in 2019 while awaiting trial on sex trafficking charges, came after a report claimed that Mr. Trump, in 2003, sent a “bawdy” birthday letter to Epstein with references to a shared “secret”. Mr. Trump has filed a libel lawsuit against the newspaper and its publisher Rupert Murdoch. He went on to post, on the Truth Social platform, “Based on the ridiculous amount of publicity given to Jeffrey Epstein, I have asked Attorney General Pam Bondi to produce any and all pertinent Grand Jury testimony, subject to Court approval. This SCAM, perpetuated by the Democrats, should end, right now!”.Mr. Trump’s publicity woes regarding Epstein have been compounded, however, not due to any action by Democrats, but the fact that far-right MAGA groups, including conspiracy theorists such as QAnon, who believe that the U.S. government, media, and financial worlds are controlled by elites associated with a global child sex trafficking operation, have been applying pressure on the administration within Republican circles. Even prior to the latest report linking Mr. Trump and Epstein, the President had said that some “stupid Republicans... have fallen into the net” in asking for more information to be released. Now, it is possible that lawmakers in the House of Representatives will have the opportunity to vote on the decision to release the documents relating to the prosecution of Epstein, relying on a legislative mechanism known as a “discharge petition”. A bipartisan team, led by Republican Thomas Massie and Democrat Ro Khanna, has proposed this petition under the moniker of the “Epstein Files Transparency Act”, which, if it is passed with 218 signatures, could require the Attorney General to “make publicly available ... all unclassified records, documents, communications, and investigative materials in the possession of the Department of Justice…” relating to Epstein. Mr. Trump may soon discover that while it helps his policy agenda to have a federal government trifecta and a sympathetic Supreme Court, his political prospects ultimately rest upon his support base, and it is one that is capable of abruptly turning the tide against him. Published - July 21, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        sexual assault & rape\n                    \n                            /                      \n                        \n                        children\n                    \n                            /                      \n                        \n                        human trafficking\n                    \n                            /                      \n                        \n                        sex\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        crime, law and justice",
        "headline_1": "Republican rumblings: on Trump and the Epstein files",
        "headline_2": "Donald Trump is facing pressure from within his own support base",
        "link": "https://www.thehindu.com/opinion/editorial/republican-rumblings-on-trump-and-the-epstein-files/article69834274.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "Unregistered drones are law enforcement’s new challenge, one that’s not easily solved\nCivilian drones are proving to be a new headache for law enforcement across the country – an unsurprising fallout of drones becoming cheaper and more widely available. In towns and villages in western UP, for example, drones are regularly spotted after sundown. With growing suspicions that these are linked to local thefts or dodgy characters looking to make privacy-violating videos, people have been forced to mount rooftop vigils. Complaints of videography and snooping using drones, especially in relation to sensitive govt facilities, have been growing in Tamil Nadu. Other state authorities too are seized of the matter. \nThere are three issues here. First, compliance and enforcement of drone regulations are weak. To operate a civilian drone in India one needs to register the drone on the DGCA website, obtain a remote pilot licence, and be aware of flying regulations, including locations of no-fly zones. But most private drone operators don’t bother, and there are now lakhs of unregistered drones. As of April this year, only 32,000 were registered against an estimated 5L-plus drones in the country. \nSecond, despite the fact that import of drones is banned in India, foreign drones – especially of illegal Chinese make – are found across grey markets throughout the country. Chinese drones are actually smuggled across India’s porous borders. They are dismantled for the journey before being reassembled here. Third, given the rise of the attention economy, drone videos that infringe privacy are in high demand.\nThe sheer number of drones is seriously stretching limited police resources. One  solution is faster development of the Indian drone industry to lower domestic drone prices. This will stem imports, and perhaps ensure better monitoring of drone use. But it’s not a guarantee by any means. Drones are going the way of all tech breakthroughs – the baddies will more often than not outsmart the good guys.\n\n",
        "headline_1": "The new buzz",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/the-new-buzz/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "Cheesy misadventures of a curd rice soul\nIt began, as most culinary tragedies do, with misplaced optimism. There I was, a proud South Indian, my taste buds raised on the moral clarity of curd rice and the structured precision of sambar, venturing into the treacherous terrain of French-Italian fine dining in Chamonix. The menu whispered sophistication. The risotto screamed otherwise.\n“I’ll have the cheese risotto,” I said, as if I knew what I was doing. “Well done, with vegetables.” In my mind’s kitchen, this translated to a suave vegetable pulav with a European passport and a cheesy accent.\nThe French waiter, whose smile was equal parts charm and confusion, nodded with the serene detachment of a man who had long stopped asking why. He had clearly survived worse, possibly someone requesting a side of pickle or a cup of filter coffee.\nWhat arrived, however, was a steaming dish of emotional beige. Cheese-bound. Vegetable-free. Spiritually vacant. If curd rice is your grandmother’s hug in edible form, this was a cold shrug wrapped in Parmesan. I looked at it. It looked back, unblinking.\nI cleared my throat and summoned courage. “Pardon, I asked for vegetables.” A pause followed, long enough to consider the mistakes that brought me here.\nThe plate returned ten minutes later, accessorised with a few carrot slivers that looked like they had just been furloughed from a salad bar. For this cosmetic upgrade, I was politely billed 10 Euros extra. Guilt never comes cheap in France.\nStill clinging to hope, I asked for tomato sauce, believing it to be chutney’s third cousin, not quite native, but not entirely foreign either. Surely that would redeem things.\nAlas, what followed was a culinary car crash. French-Italian sensibilities collided with South Indian trauma to produce something I can only describe as Risotto da Khichdi. A dish so confused, it could use therapy in three languages and subtitles in two.\nThe texture was porridge at a masquerade ball, dressed to impress but clueless on the dance floor. The taste wavered between cheese-induced amnesia and ambition that had clearly lost its GPS. And the soul? Let’s just say it had taken the last gondola down the mountain and left no forwarding address.\nI paid the bill, left the thrill, and walked out with a palate still waiting for closure.\n\n",
        "headline_1": "Gourmet UnDelight",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/gourmet-undelight/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "Another student suicide, another post-mortem. Systemic deafness to student complaints lives on\nOn the heels of the terrible self-immolation by a 20-year-old college student in Odisha, has come the alleged suicide of a 21-year-old medical student in Greater Noida. Among the common factors in the two cases, the parents say their child had been put under extreme stress through targeted harassment by faculty. Complaints to other faculty hadn’t brought any relief. There are also letters. In the Odisha case, it seems fellow students were mobilised to support the faculty member and isolate the complainant. In the Greater Noida case, there is reportedly a suicide note naming professors for harassment and humiliation. Structurally, higher ed provides faculty with enormous power over students – from shaping ideas to careers. But the corresponding safety mechanism that’s critical to maintaining the health of such a system, looks broken. \nIn March, when the Supreme Court set up a national task force to address students’ mental health concerns and prevent suicides in higher ed institutions, it noted how student suicides have gone past farmers killing themselves due to agrarian distress. A lot of blame is put on toxic competitiveness and this issue too requires greater responsiveness from college administrators. But cases of harassment belong to a different category. It is an abuse of power by specific faculty members. It can be explicitly sexual in certain cases. In other cases it can take the form of verbal crudities, including those referencing a student’s body or caste slurs. There can be unfair attendance, grading and assignment of coursework. How are students to be protected from such persecution? \nIn the Greater Noida case, both her family and fellows report the student being repeatedly derided in the classroom. Her parents took up the matter with college authorities, but nothing changed. In the Odisha case, the student went to police and to the college’s internal complaints committee. Here, instead of relief she seems to have found a cruel stonewalling that drove her to despair. Is UGC unaware that many ICCs are less than rigorous in giving a proper hearing to the complaints they receive? Even in metro cities, principals, senior professors, college boards and sundry others are known to put the spanner in various inquiries. Think too how IIT-Kharagpur alone has seen four ‘unnatural’ student deaths in seven months. Every such suicide follows our elitest institutes admitting to ‘lapses’. But at least when students complain, the system should spring into action, to hear them and save them.\n\n",
        "headline_1": "College cruelties",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/college-cruelties/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "Earlier this week, the Amarnath Yatra, which witnessed a record turnout this year, was suspended after a woman was struck by a falling rock. Three weeks ago, a tourist bus carrying pilgrims to Badrinath fell into the Alaknanda river, killing four and injuring several other passengers. Around the same time, landslides along the Yamunotri route killed two on the way to the shrine. A day later, a helicopter heading to Guptkashi ferrying pilgrims from Kedarnath crashed, killing all seven on board. The recent Jaganath Puri Rath Yatra attracted more than 14 lakh visitors but the crush of people left three dead.\nWhy are religious festivals, yatras and temple tours now so congested and prone to tragedy? How has the private act of devotion turned into a noisy, lethal affair of crowd management? Can religion practised at such a monumental scale even be considered sacred anymore?\nInconvenience was once a crucial hallmark of any pilgrimage. In earlier days, when the Char Dhams were not connected by four-lane highways, when Vaishno Devi could not be approached by helicopter, and when the Tawang Monastery in Arunachal Pradesh didn’t have luxury hotels at its doorstep, people walked. They trekked long distances on torturous mountain paths with narrow footholds, often camping in forests or along routes with barely any facilities. So selfless was the devotion that no pilgrimage was too arduous or painful. People moved slowly on foot, the old and infirm on horseback, making a journey in hope and uncertainty. God required the tedium of distance, patience and discomfort. Without it, what was the point?\n\nHoly Rush: Every year, the crowds increase as do reports of landslides and mishaps\nToday, travel to two of the country’s most venerated places has changed dramatically. The approach to the Kashi Vishwanath temple in Varanasi was once through a torturous medley of narrow, disjointed streets that made the passage a difficult pilgrimage of discovery. Since the construction of the Kashi Vishwanath Corridor, the walk has been broadened, linking the city road approach to the river with a mix of local commerce — sari emporia, restaurants, sweet shops, and minor hotels. So too with Ayodhya. You fly out to the newly built airport, stay at a pre-booked hotel, visit the temple, eat out at a choice of restaurants, and live in relative comfort. Much the way you would at Disneyland or Niagara falls. Both places, more curated tourism than inconvenient pilgrimage.\nPerhaps this is inevitable, given the sheer numbers. In 1980, the annual number of visitors to Vaishno Devi was nine lakh. Now, the figure stands at almost a crore. The Amarnath Yatra saw one lakh devotees in the first six days before its suspension due to landslides. These phenomenal increases are not just a reminder of population statistics, but point to the increasing commercialisation of religion. Pilgrimage has become a kind of spiritual bucket list, a series of checkboxes on life’s tourist map: Two Char Dhams done, two more to go. Ayodhya—checked. Next up, Amarnath and Kailash Mansarovar.\nAdd to that the relentless pace of urbanisation in India’s hill regions and the growing incidence of extreme weather events, and you have a recipe for more landslides, avalanches, swollen rivers, and flash floods. State govts will fall back on standard make-shift measures: widening trails where possible, proposing better crowd management, and increasing security personnel along routes. But without imposing controls on the number of pilgrims, these efforts amount to little. What’s needed are strict caps on the number of daily visitors to match available facilities. More important is the removal of all forms of quick-access conveniences like ropeways or helicopter services so that pedestrian trails become the only option to sacred sites. Finally, there is a need to shut select temple and pilgrimage locations where excessive footfall is causing structural damage to buildings and the environment.\nNow that commerce is deeply entwined with religion, the line between pilgrimage and tourism has all but disappeared. The sacred is increasingly packaged as a spectacle—easy to reach, easy to consume. As a result, more people will continue to flock to temples, shrines, and sacred rivers. But in the process, their sanctity may be lost forever.\nSoon, the hills around Rishikesh are going to be added to another yatra on the pilgrimage map. A small, insignificant ashram that the Beatles visited in 1968 with Maharishi Mahesh Yogi is to be refurbished into an international tourist attraction. Will Paul McCartney and Ringo Starr come for the inauguration? Will the Ambassador car they travelled in be upholstered with new seats? Some forgotten pilgrim places are best left forgotten or, at best, marked by a small plaque on a wall.\n\n",
        "headline_1": "The perils of pilgrimage in the age of the spiritual bucket list",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/the-perils-of-pilgrimage-in-the-age-of-the-spiritual-bucket-list/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 21, 2025 00:00:00  \nThe interim government's decision to cancel 16 development projects worth around US$3.0 billion under India's Line of Credit (LoC) schemes due to excessive delays in both project implementation and fund disbursement by the lender is a step in the right direction. Quoting official sources familiar with the matter, The Financial Express recently reported that the government has already formed a technical committee to work out an exit plan for the projects on the drop list. The projects selected for cancellation are reportedly under the LoC-2 and LoC-3 financing schemes. Most of these projects have seen little to no progress, mainly due to delays in consultant selection or the absence of necessary approvals from the Indian side. Project implementation under the LoCs had already been sluggish because of stringent conditions attached to the loans; and following the fall of the Hasina government, the situation worsened as Indian contractors and workers abandoned project sites, citing security concerns. As a result, these projects have been left in limbo, making it essential for the government to explore alternative options.\nThe Indian credit, which began with the first Line of Credit (LoC) worth US$862 million in 2010, increased to US$7.362 billion by 2017 with the addition of two more LoCs. However, only US$1.73 billion has been disbursed since August 5 last year. Under this loan schemes, there were a total of 40 projects including roads, railways, and infrastructure development in shipping and energy sectors. Till date, only 15 projects have been completed, eight are ongoing and the rest remain stalled at preliminary stages, either in the process of selecting consultants and contractors or still preparing proposals.\nThe loan schemes were present as soft loans, as they carried an interest rate of just 1.0 per cent. However, the terms of the loans have proven far from favourable as they came with stringent conditions. For example, a key stipulation requires Bangladesh to source 75 per cent of project materials including goods and services from India. Moreover, only Indian contractors have been awarded these projects, and it has been alleged that they inflated costs at their own discretion. Worse still, every stage of implementation, from land acquisition and tender preparation to design and final approval, is subjected to approval from the Exim Bank of India. A significant portion of the workforce also consists of Indian nationals. Given these constraints, questions have been raised as to why Bangladesh agreed to such loan terms in the first place, apparently at the expense of national sovereignty. \nMany have also raised questions about the true motives behind the construction of some of these projects. A number the projects under these LoCs, including the construction of roads and railways on certain routes, would primarily benefit India, as the Awami League government had been actively working towards granting India transit facilities to transport goods to its northeastern states through Bangladesh. How absurd it was that Bangladesh was constructing infrastructure to serve Indian interests, even while agreeing to harsh and self-defeating loan terms. It is therefore time to launch a thorough investigation into the LoC-funded projects and scrap those that have made little to no progress.\nAdmittedly, Bangladesh needs foreign fund to develop infrastructure, across different sectors such as power and energy, transport, urban and social to support its growing economy, urbanisation and large population. As Bangladesh aims to enhance its global trade competitiveness and sustain its growth momentum in the post-LDC era, robust infrastructure development will be critical. Introduction of infrastructure bonds could help bridge the financing gap reducing reliance on foreign loans of stringent and unfavourable terms.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Streamlining Indian LoC-funded projects",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/streamlining-indian-loc-funded-projects-1753024297",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       July 21, 2025 00:00:00  \n\nOf late, a lurking public health emergency, dengue, does not hit the headlines, since the media is now obsessed with absorbing or exciting political news. Despite the relative public as well as official inattention, the vector of the disease, the Aedes mosquito, has not stopped breeding, if only due to the ideal condition being created by the frequent spells of rain often accompanied by downpours across the country this rainy season. Also, the ongoing construction works with more and more urban sprawl around providing the aedes mosquito with numerous holes at the construction sites creating puddles for the dengue mosquitoes to lay eggs, develop those into larvae, which are quietly undergoing metamorphosis and becoming adults in greater numbers. Is this process of growing aedes mosquito population facing any mortal challenge from the local government bodies, the city corporations and municipalities tasked with eradicating the deadly insect?\nAs late as last Friday, July 18, the Directorate General of Health Services (DGHS) informed that to date, 61 persons have died of dengue across the country this year. On that particular day (Friday), one dengue patient died in the country and the patient in question was under treatment in a hospital within the Dhaka South City Corporation (DSCC) area. Consider that, of all places in the country, it was from a city hospital that a dengue-related death was reported. The number of dengue patients admitted to hospitals was 114 on that day. In the 18 days of the current month, 6,099 dengue patients with fever were admitted to different hospitals across the country. If the number of hospitalisation of dengue patients since the beginning of 2025 till July 18 are counted, the total figure will stand at 16,395. \nNotably, the highest number of deaths from the disease was recorded in June. Also, the highest number of hospitalisation from dengue cases at 288, according to DGHS, was reported last month since January 2025. The broader trend was that, unlike in the past years, 75 per cent of the dengue cases were being reported from different districts outside Dhaka. Last month, the highest number of dengue cases were reported from the coastal district of Barguna. Entomologist GM Saifur Rahman was of the view that the district's coastal geography has a role to play in this regard. Since, according to him, in coastal areas people usually store water, the practice provides an ideal ground for the aedes mosquito to breed. Improved connectivity throughout the country is yet another reason for faster spread of the vector-borne disease in the districts. This development challenges the previously held belief that dengue is primarily a Dhaka-centric public health issue. In consequence, activities like adopting the required dengue prevention measures were largely conspicuous by their absence in the districts. The obvious answer to this lacking is strengthening surveillance and actions to eliminate mosquito breeding grounds. Experts attributed the surge in dengue cases outside Dhaka to inadequate mosquito control measures, low level of public awareness and the presence of multiple dengue serotypes. The dengue serotypes are closely related dengue viruses, namely, DEN-1, DEN-2, DEN-3 and DEN-4. In this connection, entomologist, Professor Kabirul Bashar of Jahangir Nagar University, for instance, identified Barishal, Barguna, Chattogram and Cox's Bazar as the most dengue-affected districts. However, the capital city's exposure to the different dengue serotypes since 2000, has given some level of immunity to dengue among its residents. But in the districts outside Dhaka, the situation is different. They are more vulnerable to dengue. According to the European Centre for Disease Prevention and Control (ECDPC), Bangladesh has been experiencing more dengue cases in 2025 than during the same period last year. For, as ECDPC report showed, till May 25 this year, Bangladesh had recorded 3,972 cases and 23 deaths from dengue compared to 2,853 cases by the same period in 2024. However, the number of dengue-related deaths during the same period last year was higher at 41. Another development worth noting is the sharp rise in the so-called Breteau Index (BI), which is a measure of aedes mosquito density, across the country. The method used by entomologists to measure BI is taking a count of the number of households that have at least one positive water container marked positive, i.e., have mosquito larvae or pupa, out of 100 such households inspected. Entomologists involved in the related research showed that April's count for BI that exceeded 10 was higher than the average of the previous year. If the BI count crosses 20 or more, that would be bad news for the country's public health issue. If the rise in MI remains unchecked, 2025 may experience an even severer form of dengue outbreak than last year's that witnessed some 101,214 dengue cases and 575 deaths.\nThis should be a cause for concern. That is because hospitals outside Dhaka are not adequately equipped with the required facilities to treat dengue patients. \nThat calls for due attention from the health ministry and all other government agencies concerned to launch a concerted programme of building dengue awareness among the population so they keep the surroundings of their residences clean and free from any potholes or containers that can hold rainwater. At the same time, comprehensive dengue eradication drives have to be launched in the districts. Especially, after every rainfall, a drive should follow to destroy the potential breeding places and the mosquito larvae. \nTo enable proper tracking of the dengue cases and ensuring effective surveillance and response, some experts have suggested that dengue be declared a reportable disease. In that case, a database for dengue based on the case reports from the hospitals and diagnostic centres of the country could be created. \nSo far, the government failed to adopt an integrated dengue control strategy. The Integrated Aedes Management (IAM) approach tested and approved by the World Health Organization (WHO) and implemented across the globe should also be applicable here. It is a data-driven and evidence-based action plan tailored to local contexts. Its components include: environmental management, biological control, application of chemicals, community participation and education. Such approach is also aligned with WHO's Integrated Vector Management (IVM) strategy, which stresses the application of a combination of different kinds of interventions rather than a single method. \nThe government should also take a more innovative and integrated strategy to fight the dengue vector. Otherwise, the growth of Aedes mosquito population, which is becoming resistant to a particular type of adulticide, may go out of control.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Comprehensive drive against dengue needed",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/comprehensive-drive-against-dengue-needed-1753024356",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       July 21, 2025 00:00:00  \n\nMorning fog is quite natural but certainly not at this time of the rainy season. But recently the residents of Dhaka North City Corporation (DNCC) have been experiencing fog that envelops roads and alleys for a while. This fog is, however, not natural and moist. It is the fumes that are released from fogging machines. Yes, the administrator of the DNCC perhaps wanted to show his administration is different from the mayors under whose reigns, fogging was done in the late afternoon or evening. No explanation was given for this shift in fogging from evening to morning. \nImagine the thick fog-like fumes are all over the street school kids and their parents have to negotiate on their way to educational institution. Even commuters who get out for office also discover themselves in the morning fogging frenzy. It is not confined to this uneasy feeling and irritation on street, the nasty odour invades indoors. If the fumes are wafted into people's homes right at the moment when the family is at the breakfast table, the feeling of nausea produced is unavoidable. Some sensitive mortals may feel vomiting and if a few end up surrendering to the feeling, they cannot be blamed.\n It is because the fumes are extremely repellent to human nostrils. Strangely, no expert has concluded that those have any effect on Aedes aegypti, the female of which variety is the vector of dengue. Only culex subspecies which lays its eggs in polluted waters of drain may be victim to such fogging. Both anopheles and aedes choose clean and stagnant water for laying their eggs.\nCurrently, the country is facing a challenge for arresting the spread of dengue and chikungunia not malaria or Japanese encephalitis or West Nile virus. Well, the cases of malaria spread by anopheles are rare now and Japanese encephalitis and Nile virus spread by culex are an unheard of phenomenon here. Evidently, the fogging is a wasteful exercise. The last mayor made a candid admission of this futile exercise. \nClearly, fogging is a misplaced drive against aedes. The waste of public money on such programmes is nothing but fooling the inhabitants of the city. Kolkata has developed a round-the-year monitoring and follow-up crash programme involving volunteers and residents alongside its city corporation officials and employees. This is exactly what Dhaka needs to destroy the breeding places of aedes mosquitoes. The moment one or two patients are located from an area, the entire vicinity has to be barricaded for launching drives to eliminate any source of potential breeding spot.\nFogging has proved useless and it will fail to contain aedes particularly in this rainy season when rains are falling without notice. Formation of local brigades ought to be the first priority and on the basis of their active participation the city corporation officials and employees will visit every house to inspect if it has any place on ground or rooftop where rain waters may accumulate allowing aedes to breed and proliferate. \nThere are also open spaces in between two rows of residential accommodations where broken pots, rejected plastic dish, coconut shells etc gather rains providing ideal breeding grounds for anopheles and aedes. A list of such places has to be made for removal and regular application of larvicides ensured. Biological insecticide like bacillus thuringiensis israelensis (Bti) and spinosad, an insecticide derived from soil bacterium are highly effective in destroying the larvae. Also methoprene and pyroproxyfen can control larvae growth. If the spots are precisely detected, any of these larvicides or insecticides can be regularly applied there to systematically destroy the vectors of dengue. \nThe interim government's effort to rein in waste of public money cannot be successful if it fails to gain full knowledge of how the money goes down the drain. The case of drive against aedes is clear enough for it to intervene not only in the interest of saving public fund but also to focus on an effective campaign aimed at avoiding a dengue epidemic.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why fogging in morning instead of evening?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-fogging-in-morning-instead-of-evening-1753024412",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 21, 2025 00:00:00  \nYouth unemployment is emerging as a ticking time bomb in Bangladesh. With over 60 per cent of the population under the age of 35, the nation's future lies in the hands of its young generation. However, many of these bright minds are struggling to secure meaningful employment, despite holding university degrees.\nAccording to recent data from the Bangladesh Bureau of Statistics, the unemployment rate among youth (ages 15-24) has increased alarmingly to 12.9 per cent in 2025. A significant mismatch between education and job market requirements is one of the key drivers. While universities produce thousands of graduates each year, many lack the technical and soft skills needed in today's digital economy.\nMoreover, the rise of automation, slow growth in the private sector, and political instability further worsen the problem. Many skilled youth are migrating abroad, leading to a loss of talent that could otherwise contribute to national development.\nTo combat this crisis, policymakers must urgently invest in vocational training, improve industry-academia linkage, and promote entrepreneurship through low-interest loans and startup incubators. It's also vital to reform the education system to make it more practical and market-driven.\nJarin Akther \nStudent\nNorth South University\njarin.akther@northsouth.edu\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Youth unemployment — a silent crisis",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/youth-unemployment-a-silent-crisis-1753024438",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-07-2025"
    }
]