[
    {
        "full_article": "The Centre’s decision to include caste enumeration in the next national Census marks a sharp departure for the ruling BJP from its previous position. Prime Minister Narendra Modi had in 2024 targeted the Congress election manifesto promise of a caste census as a reflection of its ‘urban Naxal’ thinking. During the general election last year, BJP leaders had asked the people for a massive Lok Sabha majority to remodel the Constitution. This promise of a constitutional overhaul was seen by OBC and Dalit groups as a threat to dismantle caste reservations, and partly explains why the BJP fell short of an electoral majority. In 2015, the RSS chief’s call for a debate on caste-based reservation led to setbacks for the BJP in the Bihar Assembly elections. The Maharashtra and Haryana Assembly election victories in 2024 suggested that the BJP’s plank of Hindu unity, and its resistance to caste-based politics, continued to retain electoral salience. But, as it turns out, the BJP was probably unsure of its electoral ground and feared or sensed an undercurrent in favour of caste census that it could no longer politically ignore, particularly in Bihar which will vote later this year.It is now a race to claim credit. The BJP and the Opposition have accused each other of undermining social justice. National formations, which include the BJP, the Congress and the Left, have historically taken an ambiguous, if not hostile, view towards caste claims. Subaltern parties that mobilised OBC and Dalit groups in Uttar Pradesh and Bihar displaced all national parties from these States in the 1990s. The BJP responded by turning more inclusive towards the OBCs, that has culminated in its continuing electoral dominance since 2014. The Congress, under Rahul Gandhi, started espousing caste justice, in a remarkable turn in the party’s history. Apart from a caste census, Mr. Gandhi now seeks the removal of the 50% ceiling in reservations, and an expansion of reservation in private educational institutions. Though there is no evidence yet that the Congress has or will make electoral gains from the new stirring, it is evident that the BJP is worried. The counting of castes and communities unleashed social forces in colonial India that continue till date, and a comprehensive caste count, the first since 1931, is set to unmake and remake many political and social realities. A caste census would not automatically result in reservation according to population figures, which is obnoxious; as Article 16(4) of the Constitution makes it clear, special provision for reservation in favour of any backward class can be made only if such community is inadequately represented in public services. A caste census should not be allowed to ossify social divisions, but only used to better target benefits of affirmative action.\r Published - May 02, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Caste\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        Reservation\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        Bihar\n                    \n                            /                      \n                        \n                        Assembly Elections\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Rahul Gandhi\n                    \n                            /                      \n                        \n                        education\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        constitution",
        "headline_1": "​Turn and churn: On caste count and next Census",
        "headline_2": "A caste census should not be allowed to ossify social segmentation",
        "link": "https://www.thehindu.com/opinion/editorial/turn-and-churn-on-caste-count-and-next-census/article69521895.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "Amidst the shock over the Pahalgam terror attack, the resultant diplomatic measures against Pakistan and the likelihood of a military escalation, New Delhi’s attempts to strengthen ties with three of Pakistan’s closest allies may have been missed. But support from Saudi Arabia, the UAE and the Taliban regime in Afghanistan will be important to building India’s case against the perpetrators. Prime Minister Narendra Modi was in Jeddah when he received news of the attack. Although he cut short his visit, he discussed the attack at some length with Saudi Crown Prince Mohammed bin Salman. The joint statement recorded their strong condemnation of the attack, rejecting any attempt to “link terrorism to any particular race, religion or culture”. The wording marks the strongest such language used and is the culmination of the process begun in 2006 with the India-KSA Delhi Declaration, followed by the 2010 Strategic Partnership agreement that turned the compass in the Saudi Kingdom on terrorism. In 2012, Saudi authorities assisted India in securing the arrest of Sayed Zabiuddin Ansari alias Abu Jundal, an LeT Indian co-conspirator being tried for the 26/11 attacks. The assistance marked a turnaround in ties, given the Kingdom’s history of funding Islamist extremist groups at madrasas in Pakistan and other countries. Ties have now been transformed with technological cooperation and the promise of $100 billion Saudi investment.With the UAE, India has made strides in cooperation, boosted by the signing of the Strategic Partnership in 2017, and at least six visits by Mr. Modi, leading to a stark turnaround since the 1990s, when India pleaded unsuccessfully for the extradition of Dawood Ibrahim and in intervening in the 1999 hijack of flight IC-814. In April, New Delhi rolled out the red carpet for Sheikh Hamdan bin Mohammed bin Rashid Al Maktoum, Crown Prince of Dubai and the UAE’s Deputy Prime Minister and Minister of Defence, cementing ties with a country that has been one of Pakistan’s closest backers. Finally, this week saw a surprise visit to Kabul by the MEA’s point-person for Pakistan-Afghanistan-India and a meeting with Taliban acting foreign minister Muttaqi as well as a “categorical condemnation” by the Taliban of the Pahalgam killings — a far cry from the Taliban’s past in targeting Indian interests in Afghanistan in collaboration with Pakistani agencies and terror groups. It would not be pragmatic to assume a full change of heart with the Taliban, but the support against terrorism is bound to be one more pressure point on Pakistan. The salutary impact of well-timed diplomacy in turning around ties with countries that had refused India cooperation three decades ago is noteworthy.\r Published - May 02, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        India-Pakistan\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        terrorism (crime)\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        gender\n                    \n                            /                      \n                        \n                        education",
        "headline_1": "​New friends: On India and Pakistan’s closest allies",
        "headline_2": "India is making efforts to isolate Pakistan in the Islamic world",
        "link": "https://www.thehindu.com/opinion/editorial/new-friends-on-india-and-pakistans-closest-allies/article69521716.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "Mumbai magistrate’s ruling on live-in couples’ rights contrasts with many higher courts’ dodgy moralising\nGiven the times, a magistrate court’s order on live-ins was especially welcome. The court ruled that a woman in a live-in relationship is entitled to monthly maintenance, as provided in the domestic violence Act. The magistrate didn’t agree with the monetary claim the woman asked for but, even while setting a smaller amount, agreed in principle she has a right to claim maintenance. The order is excellent news for legal protections for live-ins. But that it came from a subordinate court is perhaps the greater win. High courts and subordinate courts far too frequently issue orders contravening Supreme Court’s precedents and legislative amendments, especially on issues involving live-in relationships and couple-rights. As a result, petitioners must trudge through the arduous appeals process to avail simplest of protections. Not everyone has the financial wherewithal or stamina to do this.\nIn 2003, Malimath Committee recommended that a woman in a live-in relationship for a reasonable period has the legal rights of a wife. In 2006, the domestic violence Act extended protection against violence to live-in partners. SC’s view has consistently evolved from considering such partnerships as a precursor to marriage to seeing living-in as a parallel, autonomous institution of civil union, partners deserving the same protections as a married couple in terms of family finances, inheritance/succession, and physical/mental securities.\nOn live-ins, many subordinate courts and even some high courts have brazenly flouted established precedents. Uttarakhand HC, while hearing a 23-year-old’s PIL against the state’s terrible new rules mandating registration of live-ins, told the petitioner they were “brazenly living together without marriage”. Gujarat HC called a couple’s live-in status “timepass”. Allahabad HC asked for “saving moral values in society”. Given that many judges’ moralising instincts are getting the better of their jurisprudence skills, the Mumbai magistrate’s order has exceptional significance.\n\n",
        "headline_1": "Simply magisterial",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/simply-magisterial/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "Digital tech has eliminated geographical distance but enlarged the emotional distance between people\nWe’ve never had so many ‘friends’ in our lives. And we’ve never been so friendless.\nOne of the causes of this paradox is digital technology and the networking it provides via Facebook and similar sites.\nThe more time we spend with our e-friends, the less time we have for old-fashioned friends, the kind you could see, and hold, and who would, literally, present themselves to you as you would to them.\nIronically enough, social media is abuzz with an article in Harvard Business Review, about ‘The Friendship Recession’, which says that 12% of American adults say that they have no friends, a figure that’s grown fourfold since 1990.\nIncreasing work and social pressures, the growing sprawl of urban dispersal, and the trend of residential and professional relocation which severs neighbourhood and community ties, are creating a climate of isolation which according to a US study can lead to serious emotional and health problems.\nThe 24/7 convenience store of communication provided by the internet fills the emotional gap of friendlessness with the ersatz company of what might be called e-palship.\nWho is a friend, a true friend, and not just an e-pal? According to the old saying, you can’t choose your family but you can choose your friends. In fact, friends are the family you choose, often closer to you than your biological relatives.\nYou choose your friends early in childhood, in school, in college, the workplace, the sports field, the local coffee shop you frequent. Through shared experiences and escapades, triumphs and tribulations, an interweaving of memory and memes, your friends become part of your psychic DNA, as you become part of theirs.\nYour friend is a presence that’s with you even when you’re all by yourself. You see your friend without the refracting prisms of age, or gender, or creed, as your friend sees you. Your friend is a face more familiar than the one that appears in your mirror.\nWe can find words of sorrow for the passing of friends. But what words can we find to grieve the passing of friendship itself?\n\n",
        "headline_1": "Friends no more",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/friends-no-more/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "Just how bad Trump tariffs are became clear when he told kids how many dolls they should play with\nIt’s a good thing children don’t vote, or Trump would have lost that third, improbable, presidential election his heart is set on. Telling five-year-olds they should make do with only two dolls, not 30, as Trump did on Wednesday, is the same as telling their parents they should drive only two miles, not 30. Nixon said something along those lines in the ’73 oil crisis – which was beyond his control – and it didn’t win him any points. Trump, however, has only himself to blame for America’s coming doll crisis.\nWhile the 47th president firmly believes he can do no wrong, facts are refusing to toe his line. US economy shrank 0.3% in the first three months of his watch. Why? Because firms imported stuff in excess before his tariffs kicked in. Tariffs that were meant to right America’s balance of trade, make the country great again, and cut China down to size. Since only 30% – $10bn worth – of Chinese toy production comes to US, Chinese toymakers aren’t losing sleep. They’ve turned their attention to South America and West Asia instead. But US gets 77% of its toys from China, and with 245% tariff, those dolls, cars and whatnot will probably cost more than the “couple bucks” apiece Trump predicted. Big brands like Barbie maker Mattel, and MGA Entertainment have been prepping for this by shifting production to India, Vietnam, etc. Mattel CEO Ynon Kreiz, for instance, has said they will have only one factory in China by the end of this year, down from four in 2018. But small family-owned American businesses that buy cheap in China and sell online will suffer. Many of those small business owners are part of Trump’s MAGA base.\nTrump is a billionaire businessman, so it’s unlikely he doesn’t understand this. He’s already pulled back from the brink on tariffs, and the way his admin snarled at Amazon this week, for planning to reveal tariff impact on each order, shows it’s aware of the political cost. In fact, Trump called up Jeff Bezos to complain. But asking people to swallow the pain now, after playing policy roulette the last three months, won’t do. Trump’s job was to raise America’s living standard, giving people the means to buy 30, 40, or 100 dolls, if they choose to. He’s failing there.\n\n",
        "headline_1": "Toy story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/toy-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "Trump’s threats & Khalistan-pandering by Conservatives were among the reasons Liberals won. But India-Canada ties won’t change much. Khalistani factions are still entrenched in both parties\nAt the beginning of the year, the results of the Canadian election were a near certainty. Conservative Party of Canada (CPC) was up over 20 points in the polls, the Trudeau brand was beyond toxic and top Liberals were jumping ship.\n\nBut then everything changed. Trudeau resigned, Trump took office and started threatening to annex Canada, the polls tightened up and now there is a need to do a post-mortem on why the Conservatives lost.\nRead the full story on TOI+.\n\n",
        "headline_1": "Carneyval in Canada",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/carneyval-in-canada/",
        "news_paper_name": "The Times of India",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "When health fails, hope fades. Whether in a city factory or on a remote river island, when the body gives way, when pain becomes routine and healing remains out of reach, everything else collapses.\nLivelihood, learning, dignity, even the will to dream—this is the daily truth for millions of workers around the world. Sometimes it is geography, people surviving on shifting chars or cyclone-battered coastlines where no doctor arrives. Sometimes it is poverty, when a ready-made garment (RMG) worker must choose between medicine and feeding her family. Sometimes it is deeper still, a systemic absence of nutrition, safety, rest, and knowledge. Often, it is all of the above, together, compounding each other into crisis. Without health, labour cannot thrive. Without labour, societies cannot stand.\nHealth is not a privilege. It is the first right of every worker. It is the foundation upon which livelihoods are built.\nWhen malnutrition, unsafe working conditions, and untreated illnesses persist, industries falter, communities suffer, and futures collapse. Maternal health is especially critical, for it is the worker's body that builds not only today's economy, but tomorrow's generations. In climate frontline regions, where cyclones strike and salinity poisons the land, poverty deepens and workers' bodies bear the heaviest toll. To protect labour, we must first protect life, through nutrition, sanitation, vaccination, safety, and dignity from birth onward.\nEducation is also connected to health. A literate worker knows when a wound is dangerous, when rest is essential, when conditions are unjust. A young girl forced into early marriage is denied not only childhood, but the health and opportunity of a life fully lived. In communities where literacy is scarce, illness spreads faster, and accidents go untreated. Literacy enables hygiene, family planning, and safety awareness, the essentials for a resilient workforce.\nThen comes design, often overlooked, yet deeply consequential.\nA missing handrail on a stairwell can cripple a factory worker. Lack of sanitation spreads disease. Cramped, poorly ventilated workshops expose workers to chronic illness. From flood-resilient plinths to solar-powered villages, from safe workspaces to mobile health clinics, designing for human dignity is not a luxury. It is a necessity. Disaster preparedness, too, must be built into every system. Workers at the margins cannot afford poor solutions.\nFriendship's journey began over 23 years ago in the chars of Bangladesh, where healthcare was not just absent, but unimaginable. We started with a single hospital ship, a small team, and no blueprint. Everyone did everything, from translating prescriptions to washing hospital sheets. We learnt by doing. The ship was a lifeline, but it was only the beginning.\n\nMay we build a future where no worker must sacrifice their body to earn their bread, and where every hand that builds the world is valued, protected, and honoured.\nSatellite clinics followed. Then local women were trained as community medic-aides, bringing basic healthcare to the doorstep. Today, the system includes seven hospital ships, two land-based hospitals, over 750 clinics, and a network of 800 community medics, powered by mobile technology that ensures care even in the most remote huts.\nBehind every number, there is a face: a farmer who can now till his land after cataract surgery; a young woman, once paralysed by preventable illness, now running her own small business; a child with a cleft palate now smiling at school.\nThese are not exceptions. They are the quiet revolutions that define real progress.\nAnd this journey was never walked alone. Across the years, workers, volunteers, medical experts, donors, and community leaders joined hands. They saw not helplessness, but resilience. They came not to give charity, but to build solidarity.\nBecause ultimately, health is the thread. It runs through every right, every livelihood, every aspiration.\nOn this May Day, let us remember that the dignity of work begins with the dignity of the worker. And dignity begins with health—not as a luxury, not as a hope, but as a guarantee.\nMay we build a future where no worker must sacrifice their body to earn their bread, and where every hand that builds the world is valued, protected, and honoured.\nRuna Khan is founder and executive director of Friendship.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "The hands that build the world must be protected",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-hands-build-the-world-must-be-protected-3884771",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "With Bangladesh's readymade garment (RMG) sector facing growing threats in the form of uncertain global demand, protectionist US tariffs and other issues, the nation focuses on agro-processing as a potential export alternative. As over 40 percent of jobs and 11.02 percent of gross domestic product (GDP) come from agriculture, analysts argue that agro-processing can build upon Bangladesh's agrarian strength, involving less investment outlay and reducing post-harvest losses by improving the shelf life. The switch holds the possibility of diversifying exports, reducing economic vulnerability, and reaching a growing global processed food market that is set to grow to $4.1 trillion by 2027.\nBangladesh's $36 billion RMG industry (Bangladesh Bank data for FY 2023-24), providing the major chunk of export revenues, faces historic hurdles. Its biggest market, the US, which imported $7.34 billion worth of garments in 2024, has imposed additional tariffs on Bangladeshis, as it did to many other countries of the world. This move is expected to negatively impact Bangladesh's RMG exports. Meanwhile, increasing production costs and competition from countries such as Ethiopia, producing low-cost basic garments, are denting Bangladesh's cost leadership. The World Bank warns that over-reliance on RMG exposes the economy to external shocks and demands diversification.\n\nAgro-processing or value addition of raw crops to products like juices, dried fruit, and snacks suits the agrarian economy of Bangladesh, where less initial investment is needed. Agro-processing, unlike RMG, which involves expensive machinery and foreign inputs, utilises existing crops, thus reducing the cost of inputs. For instance, it costs $50,000-100,000 to establish a small-scale fruit processing plant compared to $2-5 million for a medium-scale apparel factory. It also involves less complex technology that suits local entrepreneurs in rural settings.\nBangladesh produces over 40 million metric tonnes of vegetables and fruit every year, yet 30 percent of it gets lost after harvesting due to inadequate processing and storage, as per FAO 2021 statistics. Excessive or perishable fruits may be converted by agro-processing to shelf-stable products that reduce wastage and increase farm income.\nBangladesh's agro-processed exports—$1.2 billion in 2022–23—are already rising. Value-added foods like frozen fish, spices, and potato flakes are exported to 52 nations, including the Middle East, the EU, and Japan. Over 4,500 Bangladeshi products, including processed ones, enjoy duty-free market access in the EU under the Generalised System of Preferences. In 2022, the Middle East imported $2.5 billion worth of processed foods, highlighting significant opportunities for suppliers of halal-certified products.\n\nNational Agricultural Policy 2018 prioritised agro-processing by providing tax incentives, low-cost credit, and export incentives. It also aims to increase agro-processing's GDP share to five percent from two percent by 2025. The Export Promotion Bureau 2023 allocated $15 million for establishing 50 village processing clusters equipped with packaging and cold storage facilities.\nHowever, challenges remain. Only 12 percent of agro-processors are certified to meet international safety standards like International Organization for Standardization (ISO) or Hazard Analysis and Critical Control Points (HACCP), which limits access to high-value markets. A 2023 World Bank report cites a lack of cold chain infrastructure, with only 15 percent of perishables being transported under refrigeration. Finance remains an issue for Small and Medium-sized Enterprises (SMEs), with banks extending less than five percent of agriculture loans.\nUpgrading of technologies, enhancing workers' skills, and streamlining export certification would make Bangladesh globally competitive. Technical skills may be acquired by cooperating with corporations and public-private partnerships would amplify processing zones. Whereas RMG endured turbulence, agro-processing is a low-risk, viable export driver. Value addition to agrarian products can keep Bangladesh's wastage to a bare minimum, empower the locals and earn a spot in the value chain of the world. Through consistent policies and strategic investment, the industry can follow RMG's success template and ensure economic prosperity for future generations.\nK.M. Arshad is an undergraduate student of Department of Economics at University of Dhaka.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "How agro-processing can secure Bangladesh’s export resilience",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/how-agro-processing-can-secure-bangladeshs-export-resilience-3884621",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "Following the historic mass uprising of 2024 and the subsequent establishment of the interim government, the people of Bangladesh found renewed optimism in the promise of restoring constitutionalism, transparency, and institutional integrity. Years of systemic erosion had left foundational state institutions, particularly those tasked with oversight and accountability, in a state of near collapse. The interim administration was widely expected to reverse this decline by strengthening the very institutions that uphold democratic governance.\nAgainst this backdrop, the approval of the Public Audit Ordinance, 2025 earlier this month has come as a jarring setback. By introducing executive interference into the constitutional domain of the Office of Comptroller and Auditor General (CAG), the ordinance threatens to undermine the very independence that Article 128 of the constitution so clearly protects. At a time when the nation is striving to rebuild trust in state mechanisms, this move not only risks politicising the audit office but also sends a troubling signal about the interim government's commitment to genuine reform. At a time when the people of the country are looking to the interim government to rebuild the corroded institutions and restore their autonomy and independence, such lawmaking is deeply disappointing.\n\nThe CAG's authority in Bangladesh is rooted in the country's constitution. Articles 127-129 establish the CAG's office; Article 128(4) expressly enshrines the CAG's functional independence by saying that the auditor general 'shall not be subject to the direction or control of any other person or authority' in performing audit duties​. This clause is no mere formality; in his authoritative work Constitutional Law of Bangladesh, Mahmudul Islam underscores the CAG's constitutional independence, 'The nature of the job demands independence of the office and integrity of the holder of office… In order to maintain his independence and immunity from interference of the executive, art. 147(2) provides that his remuneration, privileges and other terms and conditions of service cannot, during his term of office, be varied to his disadvantages.'\nThe CAG's authority in Bangladesh is rooted in the country's constitution. Articles 127-129 establish the CAG's office; Article 128(4) expressly enshrines the CAG's functional independence by saying that the auditor general \"shall not be subject to the direction or control of any other person or authority\" in performing audit duties​. This clause is no mere formality; in his authoritative work Constitutional Law of Bangladesh, Mahmudul Islam underscores the CAG's constitutional independence, \"The nature of the job demands independence of the office and integrity of the holder of office… In order to maintain his independence and immunity from interference of the executive, art. 147(2) provides that his remuneration, privileges and other terms and conditions of service cannot, during his term of office, be varied to his disadvantages.'' As per Article 129(2), the CAG cannot be removed from their office except in the manner a judge of the Supreme Court may be removed, insulating the office from arbitrary dismissal by the executive.\nIndia's constitution creates the Comptroller and Auditor General of India (CAG-India) under Article 148(1), removable only in the same way as a Supreme Court judge. The Indian Supreme Court recently observed in the Centre for Public Interest Litigation vs Union of India, WP(C) No 194/2025, \"India's constitutional structure gives the CAG both security of tenure and a guaranteed consultative role, resulting in what the court called an 'inbuilt' independence.\" Even though India's constitution doesn't expressly declare the same which is expressly contained in Article 128(4) of the Constitution of Bangladesh, in this case, Justice Surya Kant noted that because the CAG \"can be removed only through a removal motion in Parliament… the provisions have ensured CAG's independence.\"\nThese constitutional safeguards ensure that the audit office can operate free from executive interference. It was held in the Supreme Court Advocates-on-Record Association and Ors vs Union of India (UOI) (16.10.2015 – SC) that \"even though the appointment of the Comptroller and Auditor General of India, was exclusively vested with the executive, there had never been an adverse murmur with reference to his being influenced by the executive. The inference sought to be drawn was, that the manner of 'appointment' is irrelevant, to the question of independence. Independence of an authority emerged from the protection of the conditions of the incumbent's service, after the appointment had been made,\" which includes rulemaking power. Despite the fact that India's constitution lacks a clear provision like Article 128(4) of Bangladesh's constitution, CAG's independence in its operation is upheld by the Indian Supreme Court. Supreme Court Justice P.S. Narasimha recently lauded India's constitution framers for creating strong \"Fourth Branch\" institutions—including the CAG—to uphold democracy. Such statements reflect a principle shared across democracies: audit institutions must be politically neutral guardians of the public purse.\nThe provisions in the draft Public Audit Ordinance, as discussed here, are thus at odds with Bangladesh's constitutional design.\nFirst, the draft ordinance, under Section 19, empowers the government to frame audit rules after consulting with the CAG. In effect, it would allow the executive to dictate audit procedures, which is a direct violation of Article 128(4). The draft ordinance's provision conferring the government to make rules is alien to Bangladesh's constitution scheme and contravenes Article 128(4) by making the CAG subservient to the government.\nSecond, Section 17 of the draft ordinance would oblige the CAG to get prior government approval before entering into a contract or agreement with foreign or regional entities​. Such contracts or agreements by the CAG are essential for efficient and effective discharge of his auditorial duties. This section effectively subjects the CAG's activities to executive control, and is thereby contrary to Article 128(4). The requirement for approval from the government in this case would tantamount to the insertion of the constitutionally prohibited \"direction and control.\"\nThird, by not including provisions for auditing revenue assessment and collection under Section 6, the draft ordinance completely disregarded the decision by the Appellate Division of the Supreme Court in Bangladesh and Ors vs Radiant Pharmaceuticals Ltd. In a 2022 ruling following a writ petition filed by Radiant Pharmaceuticals, the Supreme Court held that \"wherever income and expenditure of public money are involved, the Comptroller and Auditor General… has the authority to audit\" and report on its propriety​. The court explicitly found that the audit department's power to inspect revenue accounts derives from Article 128. It reaffirmed that Section 163(3)(g) of the Income Tax Ordinance, which empowers the CAG to audit tax receipts, must be given full effect. Strikingly, the court warned that if audit findings could not lead to any action, \"auditing itself becomes unnecessary.\"​ This decision of the Appellate Division is binding as the \"law of the land\" as per Article 111, and disregarding the same without cogent reasons through a highly compelling, rational, and constitutionally sound explanation is in clear violation of articles 111 and 128(4). This judgment by the apex court underscores why an unfettered CAG is vital: any interference that hampers follow-up on audit findings would render the institution toothless.\nLastly, to truly give effect to the operational independence of the auditor general, as envisaged under Article 128(4) of the constitution, it is essential that greater administrative authority be vested in the CAG office. However, rather than strengthening this independence, Section 16(3) and 16(4) of the draft ordinance curtail it, further undermining the constitutional autonomy of the CAG.\n\nThe draft ordinance's contested sections stray far beyond any modicum of reasonable oversight and stray into outright control. They effectively erase the line drawn by Article 128(4), inviting the executive into the CAG's domain. Such a move appears clearly unconstitutional. If put to judicial review, the Supreme Court of Bangladesh would likely find that forcing executive permission for rulemaking and entering into contracts or agreements infringes the CAG's constitutionally protected independence.\nIndependence is not a theoretical luxury for the CAG; it is the very foundation of effective public auditing. By constitutional design, the CAG's reports go directly to the president and thence to parliament, bypassing ministers​. This unique channel exists so that elected officials cannot alter or suppress audit findings. The Supreme Court of India has remarked that the constitution \"provides for unbridled power to the executive to appoint [the] CAG\" but then protects the office by requiring removal through parliament, ensuring independence. Diluting this autonomy risks undermining accountability. As the Supreme Court of Bangladesh cautioned, if no action can flow from audit irregularities, then \"auditing itself becomes unnecessary.\"\nIn other words, a compromised CAG allows mismanagement and corruption to escape scrutiny. Civil society analysts echo this view: the Transparency International Bangladesh (TIB) observed that weakening the CAG's powers could open the door to tax evasion and corruption. The constitutional safeguards of Supreme Court‑style tenure and statutory rulemaking for the CAG exist precisely to prevent such outcomes.\nIn sum, the draft ordinance's contested sections stray far beyond any modicum of reasonable oversight and stray into outright control. They effectively erase the line drawn by Article 128(4), inviting the executive into the CAG's domain. Such a move appears clearly unconstitutional. If put to judicial review, the Supreme Court of Bangladesh would likely find that forcing executive permission for rulemaking and entering into contracts or agreements infringes the CAG's constitutionally protected independence. These provisions are antithetical to the founding vision of the framers of the constitution, who established the institution as an impartial watchdog. It is pertinent that these unconstitutional sections, namely sections 6, 16(3), 16(4), 17, and 19, be modified to fit into the scheme of the constitution before it is too late. May good sense prevail.\nMohammad Muslim Chowdhury is a former comptroller and auditor general of Bangladesh.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our submission guidelines.\n \n",
        "headline_1": "Undermining the CAG’s constitutional independence",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/undermining-the-cags-constitutional-independence-3884526",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-05-2025"
    },
    {
        "full_article": "We are concerned about the protracted leadership crisis at the local government bodies, particularly union parishads (UPs), where the continued absence of chairmen is disrupting the provision of essential services. Since the July uprising last year, UP chairpersons connected to the ousted Awami League government have been largely missing in action. Many either went into hiding or were arrested over alleged connections to criminal activities. According to the LGRD ministry, of the 4,575 UP chairmen across Bangladesh, at least 1,535 remain absent.\nAlthough administrators have been brought in to fill the vacuum, residents in many UPs, according to a report by this daily, are still facing delays and other disruptions in obtaining vital documents, causing them various complications. The administrators who were appointed to carry out the chairpersons' tasks (as an additional responsibility) are still struggling to do it effectively due to various reasons, including lack of leadership experience, unfamiliarity with the job's nature, overwhelming workload, etc. This has led to severe disruptions in several public services. For example, the beneficiary lists for the VGF and VGD programmes have not been updated as planned, causing delays in providing support to new recipients.\nUnion parishads are responsible for issuing birth, death, character, and citizen certificates, which are essential documents required to access many government services. UPs also play a crucial role in administering the social safety net programmes, running village courts, implementing rural development projects, and maintaining law and order. UP chairmen are best positioned to manage these tasks due to their local connections and understanding of their constituents' needs. We cannot expect the same level of expertise or tact from administrators, but the problems and sufferings thus caused cannot continue either. Enough time has passed for any test or trial the government may have needed to deal with the UP crisis. People expect results now.\nWe urge the government to take more targeted measures, including mobilising necessary resources, to equip the union parishads so that essential services can be provided without unnecessary hassle or delay. However, the most effective way to resolve this crisis would be to hold fresh local government elections and properly reconstitute the union parishads. This is how this system was designed to function, with people's representatives taking care of their needs. In our view, there is no need to wait for the national elections to conduct the local government elections. In fact, holding these elections could serve as a dress rehearsal for the national polls. More importantly, it will restore normalcy to the delivery of public services.\n",
        "headline_1": "Elected leadership can restore union parishad functioning ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/elected-leadership-can-restore-union-parishad-functioning-3882476",
        "news_paper_name": "The Daily Star",
        "publish_date": "02-05-2025"
    }
]