[
    {
        "full_article": "The Reserve Bank of India’s (RBI) recent decision to inject an additional $10 billion into the financial system through a dollar/rupee swap auction is a timely measure aimed at addressing long-term liquidity concerns among domestic lenders. These concerns stem from a flight of foreign capital from Indian stock markets, as investors seek better returns in the United States amid President Donald Trump’s proposed corporate tax cuts and ongoing tariff wars, which have strengthened the U.S. dollar against global currencies. This marks the second such rupee infusion in less than a month. However, unlike the first tranche of $5 billion on January 31, which had a six-month tenor, the latest swap auction has a three-year duration. The combined effect of these two auctions will inject approximately ₹1.3 trillion into the banking system, as lenders deposit their dollar reserves with the RBI in exchange for rupees at a pre-determined buyback premium. Currency swaps are among the tools central banks deploy during periods of high volatility in the global financial system. These measures have the primary aim of stabilising the local currency, mitigating liquidity constraints in the domestic financial system, and curbing inflationary pressures. Economists estimate that an additional $5 billion infusion may be necessary to neutralise the ₹1.7 trillion liquidity deficit in India’s banking system as of February 20, 2025.This is the second time that the RBI has conducted a long-duration currency swap. The first was in 2019, in response to global financial volatility during Mr. Trump’s first term, amid trade tariff tensions and tax cuts. However, unlike 2019, when India’s foreign exchange reserves were rising, ensuring dollar availability while rupee liquidity remained constrained, today’s situation is more challenging. Between October 2024 and February 21, 2025, the rupee has depreciated approximately 3.3% against the dollar, breaching the 85 per dollar mark on December 19, 2024. Foreign portfolio investors and foreign institutional investors have also withdrawn roughly $31 billion from Indian equity markets. Since December 2024, the RBI has sold an estimated $111.2 billion (about 18% of its foreign exchange reserves) to stabilise the rupee. Given these conditions, the latest long-term currency swap appears to be a necessity rather than a proactive measure. Indian banks must capitalise on this liquidity infusion by continuing to extend credit, ensuring that the cycle of capital investment, employment generation, wage growth, and consumer demand remains intact. This, in turn, could help propel India’s real GDP growth beyond the current 6.4%, despite prevailing global economic headwinds. Published - February 24, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        currency values\n                    \n                            /                      \n                        \n                        stock activity\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        banking\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        foreign exchange market",
        "headline_1": "​Necessary infusion: On the RBI’s currency swap",
        "headline_2": "The RBI’s long-term currency swap was likely forced by financial volatility",
        "link": "https://www.thehindu.com/opinion/editorial/necessary-infusion-on-the-rbis-currency-swap/article69254778.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "The controversy over USAID’s presence in India reflects an increasingly unhinged public discourse, undermining the nation’s confidence and global standing. The BJP and the Congress have been engaged in a political tug-of-war, attempting to corner each other over USAID-funded projects and foreign connections. However, much of this cacophony that passes for debate is fuelled by misinformation and misinterpretation, often drawing from insinuations made by the Trump administration which views international aid as a waste of American resources. While the U.S. may have its reasons to reassess its aid priorities, it is regrettable that India’s major political parties are echoing these arguments without a nuanced understanding. USAID has long supported projects in India, including those in partnership with the government. In the absence of verifiable data on the extent and impact of these initiatives, discussions are bound to be ill-informed and prejudiced. In a globalised world, where countries compete for capital, technology, and talent from across borders, branding political opponents as foreign agents may be an easy propaganda tactic, but poisons the domestic political environment and weakens India’s aspirations to emerge as a global power.It is true that foreign aid can be a tool of soft power, often used by stronger nations to exert influence over domestic affairs of other countries. However, recognising this reality requires a responsible and measured approach, and not an overreaction that borders on self-sabotage. India itself has evolved into an aid provider, a role it seeks to expand. According to an ORF analysis, since 2000, the Ministry of External Affairs has overseen financial assistance exceeding $48 billion to over 65 countries, through grants, lines of credit, and capacity-building programmes. This growing role, as a donor nation, has coincided with stricter regulations on foreign contributions within India. However, these regulations have been heavily politicised — entities aligned with the ruling establishment often face fewer hurdles, while others, even those engaged in purely apolitical activities, encounter significant restrictions. The American debate over USAID’s role in India does raise concerns about foreign influence, but any response must be rooted in clear-headed policy rather than reactionary rhetoric. If the government genuinely suspects that foreign funding is shaping India’s political landscape in undesirable ways, it must approach the issue with transparency and a well-defined plan for investigation. Managing national security in an era of increasing global interconnectedness and transnational challenges is a complex task, one that requires a mature, strategic outlook rather than a chaotic, polarised public discourse. Published - February 24, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        USA\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        foreign aid\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        society and human capital\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        national security",
        "headline_1": "​Foreign influence: On the USAID and India controversy",
        "headline_2": "India’s response to tainted aid must be rooted in policy, not rhetoric",
        "link": "https://www.thehindu.com/opinion/editorial/foreign-influence-on-the-usaid-and-india-controversy/article69254864.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "Gulf states become financial-cultural-sports hubs, but oil remains their trump card & Achilles heel\nThat Indians and Pakistanis played their super-hyped Champions Trophy match in Dubai yesterday, reflects a longer trend. Rich Indians have been making their home or a second one here for decades. Nicer tax breaks, safety and cleanliness, fancy infra, schools and hospitals – Mumbai bigwigs have found the emirate’s attractions alluring. Lately, wealthy New Yorkers, Parisians and Londoners have also begun seeing it in similar light. Net net, this has become the one place for not just Indians and Pakistanis to rub shoulders, but also Israelis and Iranians, Russians and Americans. It’s the 21st century’s great new melting pot for the plutocrats.\nThis is very much by design. The Arab Gulf states have spent gazillions reinventing themselves out of the oil-only rut. They were cultivating economic openness even as Hong Kong was entering a tighter Chinese embrace and London was being weakened by Brexit. UAE shifted its weekends to align with the Western calendar and global markets. Guggenheim Abu Dhabi, designed by the celebrated Frank Gehry, will mark one of the world’s most awaited museum openings this year. Shortage of sportspersons hasn’t kept the region from becoming a global sports hub either. Cricket to football, WTA to ATP tourneys, Formula One to MMA, there’s no shortage of action or prize money or TRPs here.\nThere are two big caveats to this reinvention story. One, though personal freedoms have increased, it’s happened in a patchy way. Until prohibitions against women’s equal participation in sports, against unmarried couples living together, against alcohol etc go down in a comprehensive way, these countries’ appeal will remain limited. More importantly, their glitter is entirely funded by petrodollars. After a ginormous property crash in 2009, oil-poor Dubai was bailed out by Abu Dhabi. But if the world falls out of habit of fossil fuels, who’ll bail out the oil sheikhs? \n\n",
        "headline_1": "Sheikhing It Up",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/sheikhing-it-up/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "What’s gender got to do with it? Plenty\nYou don’t have to be Sherlock Holmes to decode why pani puri aka golgappa tastes so delectable at roadside stalls but not fancy restaurants; even Dr Watson would find it elementary. The more it is served hygienically, the less appealing it is to the palate. If you take the same ingredients home, the experience is much less satisfying.\nOnce you reach your favourite stall, you are a changed person. With a little push and a deliberate nudge here and there, you are desperate to catch the attention of the vendor going about his business with machinelike efficiency, unaffected by rank and status. An ingratiating smile doesn’t let you jump the queue, but you feel you have marked attendance in his eyes.\nThrough the endless, awkward wait as the ones being served make the most of the opportunity and refuse to yield early, you observe that the bhaiyya’s right hand always knows what his left hand’s doing, there’s never a slip-up.\nIt’s not a state secret that women have a weak spot for pani puri. At home or office they may enforce the highest hygiene standards but suffer temporary amnesia when they return to their pani puri haunts. Here, gender equality is meaningless. Men are outnumbered and outperformed. They pretend they’ve been dragged there. They don’t dare to question the quality of boiled potatoes or the ungloved hands of the vendor.\nNot that men are paragons of cleanliness. Women upload enough Insta reels daily to drive home the point that men have no right to talk about hygiene. Wearing dirty socks inside out, leaving stubble in the sink after shaving, abandoning wet towels on the bed, their track record is so bad that playing spoilsport with pani puris will bring dire reprisals in every other sphere of their existence.\nBut some men are ready to challenge the stereotype. Not by minding their sanitary habits but by taking to the street food on their own. It’s no longer rare to see men in small groups, unaccompanied by a single female member, shedding their inhibition. Still, they’re never as boisterous, they usually wait patiently, accepting what’s served to them, they don’t ask the vendor to add or remove anything. But in this attempt to behave themselves, they don’t seem to savour the street food as women do. Looks like they will be playing catch-up for a long time. It’s one glass ceiling men have to shatter.\n\n",
        "headline_1": "Pani puri protocol",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/pani-puri-protocol/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "Idea of sovereignty is relatively new in human history. Impulse to change borders never really went away\nUkraine marks three years of Russia’s full-scale invasion today with around 20% of its territory under occupation. American and Russian delegates met in Saudi Arabia last week to discuss ways to end the war but without Ukraine at the table. So, are plans afoot to divvy up Ukrainian territories, undermining the country’s sovereignty? Don’t forget that Trump’s big on acquiring Greenland, Panama Canal, and making Canada the 51st US state. It’s unlikely he can engineer this great American expansion. The point, though, is sovereign nation-states are a relatively recent phenomenon in human history. It was not until the end of World War II that sovereignty and respect for territorial integrity were enshrined in international law. This, in fact, was the culmination of an experiment that started with the 1648 Peace of Westphalia that ended the Thirty Years’ War in Europe. Westphalia, for the first time in the Western world, laid down the principle of non-interference in internal affairs of other states. It took centuries for the idea to mature. There were multiple wars and struggles. But it eventually became the cornerstone of the international system. \nBut there were also problems with the Westphalian model. The ideas were rooted in a European-Christian ideology. So, the non-Christian world was fair game. Hence the scramble for Africa among European colonial powers in the 19th century. The legacy of the latter endures today in disputes such as that over the Moroccan Sahara, once a Spanish exclave. In West Asia, the Sykes-Picot Agreement of 1916 callously partitioned the old Ottoman Empire into nations. Effects of that can be traced in today’s West Asian conflicts. These agreements, some of them negotiated in secret, were land grabs by another name. \nSuch cartographic conquests often had the opposite impact of seeding the impulse for reunifying empires and nations. The fall of the Berlin Wall was seen by Putin as a catastrophe for the Soviet Russkiy Mir. Xi sees reunification of Taiwan as a sacred mission of the Chinese nation. Not to be strategically outdone, Trump the dealmaker sees acquiring Panama Canal or Greenland as necessary moves to bolster Pax Americana in North America and the Arctic. If the international rules-based order loosens, primordial impulses of land grabs will return, and sovereignty will become a question of might, not right. \n\n",
        "headline_1": "State of nations",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/state-of-nations/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "Kash Patel’s not the most terrible of Trump’s choices. The real issue isn’t him. US legislature is broken. So, yet another Trump ultra-loyalist will do a job that requires non-partisanship\nIn one sense, it’s no surprise the US Senate approved Trump’s nomination of Kash Patel to be FBI director.\nThough he doesn’t have anything like the qualifications of past directors, Patel isn’t among the most questionable nominees already approved by a quiescent Republican majority.\n\nIn another sense, his approval should be a surprise, as it breaks with the traditional non-partisanship of the position, in the most recent example of the collapse of US Congress as an equal branch of govt.\nRead the full story on TOI+.\n\n",
        "headline_1": "FBI got Patelled. Now what?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/fbi-got-patelled-now-what/",
        "news_paper_name": "The Times of India",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "We are deeply concerned about the lingering fear that haunts pirs, fakirs, khadems, Bauls, and other spiritual practitioners even months after the wave of attacks on shrines, Sufi darbars, and Baul akhras committed in early August. These attacks, which erupted in the wake of the fall of the Awami League government, not only desecrated places of devotion and mystical music but also shook the very foundation of our inclusive spiritual traditions. As per a report by this daily, while the frequency of such attacks has largely declined, they have not stopped entirely, with the latest incidents occurring as recently as February 20-21 in Noakhali and Manikganj. The result is that the devotees are still living in fear and insecurity.\nOur analysis shows that among the various institutions of Islamic mysticism, the shrines of the Pagal-Fakirs have been the most affected. These sites typically welcome people of all faiths, races, and genders, incorporating music as a central element of worship. The destruction of such \"spiritual free zones\", as an expert stated, not only disrupts the practice of worship through music but also restricts women's entry and expressions of devotion. This forceful imposition of a stricter interpretation of Sharia has also seen other places of devotion being targeted.\nThe chief adviser's press wing, on January 18, confirmed attacks on at least 40 shrines since August 4. Meanwhile, the Global Sufi Organisation on January 23 claimed that at least 80 shrines had been attacked since August. According to The Daily Star's own findings, corroborated by other media reports, over 70 shrines and akhras across the country were attacked, vandalised, set ablaze, or looted in August and September alone. In some instances, devotees were publicly humiliated by having their hair and beards forcibly shaved off. Although no attacks were recorded in October and December, several shrines were targeted in November as well as January and February. Some of these sites are centuries old, carrying immense historical, archaeological, and religious significance. They stand as living testaments to the role of Sufi traditions in the spread of Islam in this part of the world.\nClearly, the Sufi and Baul traditions are an integral part of our cultural and religious heritage, and as such, need to be protected rather than desecrated. To justify these attacks by citing rigid interpretations of Islam—condemning music or mixed-gender prayer gatherings—is nothing but a misguided attempt as these traditions have coexisted with mainstream Islamic practices for centuries, enriching our spiritual landscape. The attacks also go against our constitutional values of pluralism and non-discrimination that were reaffirmed by the July uprising. We, therefore, urge relevant authorities to counter rising intolerance in the country, and ensure that all shrines and akhras can resume their activities without any intimidation or obstruction.\n",
        "headline_1": "Let shrines and akhras reclaim their spirit ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/let-shrines-and-akhras-reclaim-their-spirit-3831736",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "During the Covid pandemic, social media was filled with posts about people washing and reusing disposable face masks—designed to be worn once or twice before proper disposal—for weeks. While the irony is amusing, it highlights a long-standing habit in our society: hoarding items with neither sentimental value nor practical utility. Many households in Bangladesh have entire storage spaces dedicated to crockeries, trinkets or possessions that have been used once, or never at all.\nThis culture of \"cluttering\" continuously adds to the growing piles of belongings that occupy significant space in the average urban household. Exacerbating this issue is the rise of overconsumption. In an era when products are purchased online and delivered to our doorsteps with just a few clicks, excessive consumerism has taken hold in many households. The convenience of mobile shopping apps, frequent sales, unlimited choices, and enticing discounts fuel an endless cycle of purchasing and accumulating unnecessary goods.\nFast fashion, in particular, has emerged as a major contributor to this problem. It encourages consumers to buy cheaply made clothing in bulk, much of which is discarded after only a few wears. The consequences extend far beyond cluttered wardrobes. Discarded clothing adds to overflowing landfills, with synthetic fabrics taking decades to decompose. Many low-cost garments contain polyester and other plastic-based fibres that do not break down easily, leaching microplastics into the soil and waterways. Moreover, the fashion industry, responsible for massive carbon emissions, water waste, and chemical pollution, further degrades the environment.\nCountries like Bangladesh—one of the world's largest garment producers—bear the brunt of this crisis. The dyeing and textile waste disposal processes pollute water bodies, while discarded clothes contribute to mounting waste. When these garments are thrown away, they do not simply disappear; they accumulate in dumping grounds, releasing harmful substances that seep into the ecosystem, contaminating air, land, and water. This relentless cycle of overconsumption and waste extends beyond environmental consequences; it also impacts personal spaces and mental well-being.\nDecluttering is more than just tidying up—it fosters a sense of tranquillity, reducing stress and improving focus. By letting go of unnecessary items, we create a more organised environment that enhances relaxation and productivity. In a world where material possessions are often equated with success, we rarely consider the mental burden that excessive accumulation places on us. Overcrowded rooms and overflowing cupboards can trigger anxiety and an overwhelming sense of disorder. Clutter is not just physical—it has a psychological impact, creating chaos that seeps into daily life.\nResearch shows that a cluttered environment is linked to higher cortisol levels, the hormone associated with stress. According to the Journal of Neuroscience, individuals living in cluttered spaces often struggle with decision-making, which further fuels procrastination and a lack of motivation. Decluttering, therefore, is not just about aesthetics—it is a step towards improving mental clarity and emotional well-being.\nBeyond individual efforts, decluttering is a collective responsibility, one that organisations can actively support. Companies can encourage employees to reassess their consumption habits and find better ways to repurpose unused items. One effective approach is through decluttering fairs, where employees donate items they no longer need.\nBRAC, for instance, has introduced such a fair, allowing its employees to pass on items to those who may find better use for them. Initiatives like this promote mindful consumption, foster a culture of sharing, and encourage responsible ownership. By facilitating such programmes, organisations create environments that inspire individuals to rethink their consumption patterns and engage in sustainable practices.\nDecluttering is not just about creating space in our homes; it is a conscious decision to reduce our environmental impact. As responsible citizens, we must acknowledge the footprint we leave behind through our consumption habits. Every discarded item—whether textile waste, plastic or electronic waste—has environmental consequences. While large-scale issues like climate change may feel beyond our control, decluttering is a tangible action we can take to mitigate some of the damages. It offers an opportunity to undo, in small ways, the harm already inflicted on the planet.\nA truly sustainable approach to decluttering involves more than just discarding items; it requires ensuring that they are repurposed, recycled or donated to those in need. Instead of allowing old clothes, furniture, or gadgets to gather dust, individuals can contribute to local charities, second-hand shops, or community exchange platforms. By adopting such habits, we actively reduce landfill waste, lower our carbon footprint, and support a circular economy in which goods are reused rather than discarded.\nMoreover, teaching younger generations the value of mindful consumption and decluttering can foster a culture that prioritises sustainability over reckless consumerism. Because when the last tree has fallen and the rivers are poisoned, we will realise that survival depends not on what we own, but on what we have preserved.\nSultana Jahan is deputy manager of the media unit at BRAC External Communications. She can be reached at [email protected].\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Break free from the burden of excess",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/break-free-the-burden-excess-3831491",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "The bureaucratic system in Bangladesh is plagued with excessive red tape, which manifests through ineffective procedures and corruption, resulting in overspending on civil service that ultimately limits economic performance. Overlapping regulations and insufficient coordination between government bodies exacerbate the extended timelines required to complete business registrations and obtain land acquisition permits. Manual systems together with hierarchical decision-making and rent-seeking behaviour within bureaucracies simultaneously drive up administrative costs and create delays in making essential decisions. These barriers create obstacles for both domestic and foreign investment while constraining entrepreneurial activities and pushing the working population into the informal economy, which diminishes the tax base and reduces government revenue.\nThis inefficiency leads to extensive economic consequences. The combination of elevated public expenditure for civil service functions with inadequate accountability measures and inconsistent policy enforcement results in decreased productivity within public services. Businesses face higher expenses because of bureaucratic delays and bribery that degrade their competitive edge and deter investment activities. Infrastructure and export sectors suffer from negative impacts caused by delays in land acquisition and customs clearance procedures. Implementing efficient bureaucratic processes, together with e-government solutions and enhanced transparency, will enable vital reforms to reduce unnecessary spending while unlocking economic growth potential. Tackling administrative inefficiencies will cut government spending while enhancing service delivery and boosting economic growth through improved investment conditions and entrepreneurship opportunities.\n\nBangladesh's government spending, which stands at 13.02 percent of GDP, far outweighs its revenue collection of only 8.9 percent of GDP, creating a significant fiscal gap. In contrast, Vietnam's government revenue and expenditure are almost balanced at 19.03 percent and 18.77 percent of GDP, respectively. Despite having a similar GDP—$481 billion for Bangladesh and $506 billion for Vietnam—Bangladesh struggles to generate sufficient revenue due to its overreliance on a low-skilled, informal workforce, with 84 percent of workers in the informal sector. Meanwhile, Vietnam has prioritised human development. This structural difference explains Vietnam's higher revenue and more effective government spending, even after enduring wars (1955-1975 and 1979) that left its economy in disarray decades ago.\nThe government overspends on ministries and administration in a system burdened by red tape, corruption, and inefficiency. The inefficiencies in Bangladesh's bureaucracy aggravate this fiscal disparity. Instead of addressing critical gaps in workforce training (vocational training) and healthcare to improve human development, Bangladesh diverts resources to sustain an oversized bureaucracy. For example, while Bangladesh's government expenditure is relatively lower as a percentage of GDP than Vietnam's (13.02 percent vs. 18.77 percent), it fails to deliver corresponding results. Vietnam's efficient governance enables it to focus spending on areas like skill development and technology integration, yielding higher worker productivity and export revenues. For instance, Vietnam's garment sector, with only 2.5 million workers, is projected to export $48 billion in 2025, compared to Bangladesh's $42.83 billion export earnings in 2023 with 4 million workers—a clear indication of Bangladesh's productivity gap.\nBangladesh's inability to upskill its workforce has dire consequences. A majority of its labour force is confined to low-paying jobs in agriculture, trade, and unregulated sectors like rickshaw-pulling, while Vietnam has created opportunities in semi-skilled and skilled industries, such as machine operation, legal assistance, and customer service. This structural shift in Vietnam has increased its tax base and allowed the government to invest in further human capital development. In contrast, Bangladesh's failure to prioritise workforce training perpetuates a cycle of low productivity, limited revenue, and inefficient spending. The Human Development Index (HDI) disparity between the two countries highlights this gap, with Vietnam consistently outperforming Bangladesh in key indicators.\n\nTo address this, Bangladesh must rethink its spending priorities. It is unsustainable for the government to continue funding a sprawling bureaucracy and luxurious administrative expenditures when revenue collection is so weak. By reducing ministries, streamlining governance, and cutting unnecessary expenses, resources can be redirected towards skill development, education, and infrastructure. Investing in human capital would help transition the workforce from informal, low-skilled jobs to more productive sectors, expanding the tax base and reducing dependency on external borrowing. Vietnam's success shows that a country with a similar history of colonialism, war and a comparable workforce can achieve remarkable economic transformation by focusing on human development and efficient governance. Bangladesh has no excuse for falling behind. Instead, it must take bold steps to reform its bureaucracy, reduce red tape, and prioritise its people over unsustainable government spending.\nBangladesh can follow Sri Lanka's lead in introducing bold reforms to reduce government spending by cutting down on unnecessary luxuries and inefficient practices in the public sector, including streamlining ministries. Sri Lanka's President Anura Kumara Dissanayake has set an example by capping the size of ministerial staff, limiting official vehicle usage to two per minister, and ensuring that appointments prioritise existing state service employees. These measures reflect a broader commitment to fiscal responsibility, ensuring tax money is utilised effectively. Bangladesh's government could adopt similar guidelines to reduce overspending. For instance, restricting the perks of ministers, such as luxury vehicles and unnecessary large entourages, would send a strong signal of accountability and free up resources for critical investments in skill development, and infrastructure.\nBangladesh should also consider implementing policies that ensure transparency and efficiency in government expenditures, similar to Sri Lanka's regulations on vehicle procurement and fuel allocations. Reducing ministries and consolidating overlapping functions would streamline governance and cut administrative costs. Sri Lanka's decision to curtail duty-free imports of luxury vehicles for parliamentarians sets a precedent Bangladesh could replicate, ensuring that public funds are not wasted on privileges that primarily benefit officials rather than the public. With a tax-to-GDP ratio of just 8.9 percent, Bangladesh cannot afford to continue overspending on its civil service while neglecting investments that could upskill its workforce and strengthen its economy. By following Sri Lanka's cost-cutting reforms, Bangladesh could create a leaner, more efficient government that redirects resources towards its citizens' long-term development and prosperity.\nAhmed Ashfaque Shahbaz is a PhD candidate focusing on political economy at the University of Exeter in the UK.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Impact of bureaucratic inefficiency on the economy",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/impact-bureaucratic-inefficiency-the-economy-3830821",
        "news_paper_name": "The Daily Star",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Domestic helps deserve better",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/domestic-helps-deserve-better-1740321271",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "Chief Adviser Dr Mohammad Yunus presiding over a meeting of the Advisory Council \t— PID file photo ",
        "headline_1": "Challenges interim  govt. faces",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/challenges-interim-govt-faces-1740321324",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Potential of mustard oil",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/potential-of-mustard-oil-1740321777",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Hidden hunger: A silent crisis",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hidden-hunger-a-silent-crisis-1740321798",
        "news_paper_name": "The Financial Express",
        "publish_date": "24-02-2025"
    }
]