[
    {
        "full_article": "The visit of the Qatari Amir, Sheikh Tamim bin Hamad Al-Thani, a decade after his last visit to India, has led to a reaffirmation of the deep ties between two countries. While they do not always share the same worldview, both countries recognise each other’s importance on the regional and global stage. For Qatar, India is a globally connected power, maintaining a balance with all players in the West Asian region including Saudi Arabia, the UAE, Iran and Israel. Indian expatriates are often seen as the backbone of Qatari economic activity. For India, Qatar is a Gulf power, a huge source of remittances and a partner with a major geo-strategic role. Qatar also provides 45% of India’s LNG needs, which makes up about half of the bilateral trade of $15 billion between the two countries. While Qatar is home to a U.S. military base, which houses the U.K. and Australian air forces, it has also hosted groups such as the Hamas and the Taliban, and maintains ties with regional militia groups. In its recent decision to broaden its engagement with the Taliban regime in Afghanistan, the Narendra Modi government has leaned on the Qatari leadership. In addition, the Qatari Amir’s decision to pardon eight former Indian naval personnel, reportedly accused of spying and handed the death sentence in 2023, has helped forge a closer understanding. It is fitting and long overdue, therefore, that after the talks in Delhi, India and Qatar decided to upgrade ties to a strategic partnership, given that India already has strategic partnerships signed with the Gulf Cooperation Council including the UAE, Saudi Arabia, Oman and Kuwait. They also signed a double taxation avoidance agreement and MoUs in areas including sports and youth affairs. They agreed to double bilateral trade by 2030, and Qatar is to invest $10 billion in India in infrastructure and manufacturing sectors and other areas.While the joint statement and readouts dwelt on the bilateral bonhomie, the geopolitical undertones of their summit cannot be ignored. The Qatari Amir’s visit comes amidst turmoil in the Gulf region over the Israel-Gaza conflict and U.S. President Donald Trump’s outrageous plan to clear two million Palestinians from their homeland in the name of regional peace. Every country in the Gulf region has voiced its opposition to the Trump announcement, and New Delhi’s relative silence has been noted. While the joint statement said that both sides conveyed their respective positions on the “Israel-Hamas issue”, it did not detail those positions. As Arab, GCC and OIC members meet this week to discuss the challenge from developments in Gaza, the India-Qatar talks may have delivered the opportunity for both sides to bridge that divide between them, even as Delhi and Doha committed to a much stronger, forward-looking bilateral partnership.\r Published - February 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Qatar\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        Israel\n                    \n                            /                      \n                        \n                        energy resources\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        United Kingdom\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Prime Minister Narendra Modi\n                    \n                            /                      \n                        \n                        espionage and intelligence\n                    \n                            /                      \n                        \n                        Kuwait\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        manufacturing and engineering\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict",
        "headline_1": "​Closer than ever: On India-Qatar bilateral bonhomie",
        "headline_2": "India and Qatar have deepened their ties despite differences",
        "link": "https://www.thehindu.com/opinion/editorial/closer-than-ever-on-india-qatar-bilateral-bonhomie/article69238996.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "The talks between U.S. and Russian officials in Riyadh, their first major diplomatic interaction since Russia’s invasion of Ukraine in 2022, marks the beginning of a reset in ties between the two former Cold War adversaries. Led by U.S. Secretary of State Marco Rubio and Russia’s Foreign Minister Sergei Lavrov, the two sides agreed to restore staffing at their respective embassies, explore closer economic cooperation, and set up a high-level team to start talks to end the Ukraine war. U.S. President Donald Trump has signalled that he might meet his Russian counterpart, Vladimir Putin, later this month and secure the deal, which is a decisive shift in America’s policy towards Russia. Under the former Biden administration, the U.S. had emerged as Ukraine’s biggest military and financial backer. The U.S. had also led global efforts to weaken Russia’s economy through biting sanctions. Mr. Trump has thrown away the Biden policy and adopted a new approach of rapprochement with Russia, something reminiscent of Henry Kissinger’s historic outreach to Mao Tse Tung’s China at the height of the Cold War and America’s disastrous war in Vietnam.Mr. Trump’s push for stability with Russia is rooted in a sense of realism. He does not see Russia, a pale shadow of what the Soviet Union used to be, as America’s main challenger. It is unrealistic, as Pete Hegseth, U.S. Defence Secretary, put it, to expect Ukraine to turn around the war. Mr. Trump is also opposed to further American aid for Ukraine. He wants to focus America’s resources on China, while building a better predictable relationship with Russia — a reverse Kissinger approach. While this is the broad strategic framework of Mr. Trump’s Russia reset, the victim in the battlefield is Ukraine, which has already lost over 20% of its territories and thousands of its men. The U.S., which offered Ukraine NATO membership in 2008, now says such an outcome is not practical. The Trump administration has also ruled out security guarantees to Ukraine, passing that responsibility to Europe, which stands divided. So, Ukraine today does not even have a seat at the table when Russia and America talk. When great powers quarrel and reset, smaller countries that get caught in proxy conflicts often suffer. But excluding Ukraine and Europe from any settlement that would determine both Ukraine’s future and Europe’s security architecture would be wrong, morally and practically. If Mr. Trump wants to build his reset on a strong foundation, he should strive towards a settlement that is acceptable to all parties — the U.S., Russia, Europe and Ukraine. Published - February 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Russia-Ukraine Crisis\n                    \n                            /                      \n                        \n                        Saudi Arabia\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        defence\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        NATO\n                    \n                            /                      \n                        \n                        European Union\n                    \n                            /                      \n                        \n                        Vietnam",
        "headline_1": "​Russia reset: On the U.S., Russia, their first major diplomatic interaction",
        "headline_2": "Any solution to the Ukraine war will have to find acceptance in Europe",
        "link": "https://www.thehindu.com/opinion/editorial/russia-reset-on-the-us-russia-their-first-major-diplomatic-interaction/article69238632.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "NGT data on Kumbh river water quality frames a larger national question on cleaning up rivers \nHow many Indian rivers are polluted? A Central Pollution Control Board (CPCB) assessment of 603 rivers, has identified 311 polluted stretches on 279 rivers, based on the organic Biochemical Oxygen Demand (BOD) indicator. So, the same river can be clean in some parts, but not in others. Given the huge gatherings at Kumbh, the confluence of rivers at Prayagraj presented an extraordinary cleanliness challenge for UP authorities. Their preparations have been at scale too. But now, with only a week left for the 45-day event to wrap up, the National Green Tribunal has drawn attention to worrying water quality data.\nIt quotes a CPCB report dated Feb 3. The report raises red flags, less on the BOD measure, more on Fecal Coliform. It also says sewage treatment plants were found operational, and all but one complies with stipulated norms. So, if the increase in fecal concentration was caused by the sheer number of people taking the holy dip, were the countermeasures inadequate? A thorough transparent investigation is critical. It’s acutely owed to the over 55cr that UP govt claims have already taken the holy dip. The risks of patchy disease surveillance are staring us in the face, after the Guillain-Barre Syndrome outbreak in Maharashtra has been linked to E coli contamination in water. More broadly, doing dependable monitoring and following it up with scientific fixes is the only way for India to clean up its rivers.\nFor all the remedial measures India has taken in recent decades, it still continues to discharge intolerable amounts of untreated industrial, agricultural and domestic runoffs into its water bodies. Even 25% of our municipal solid waste remains unprocessed. For the world’s most populous country, every shortfall in waste management has painfully multiplied social and economic costs. River systems are dynamic and self-healing, but only if we let them breathe.\n\n",
        "headline_1": "Aqua ain’t purus",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/aqua-aint-purus/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "Long before Artificial Intelligence, diverse devices have done our thinking for us\nIn 1637 a Frenchman penned three words which would prompt future generations to proclaim him to be the Father of Modern Western Philosophy.\nThe man was Rene Descartes and the three words were Cogito, ergo sum: I think, therefore I am. Had he been around today, would his historic proposition be pre-empted by a chatbot: AI think, therefore AI am?\nAI, or Artificial Intelligence, is a genie that has emerged out of the bottle of digital technology, and no one knows how to put it back, or even if we should try to do so, because we don’t know if the genie is a boon or a bane for humankind.\nThe unbottled genie of AI has got the world a Twitter, for fear that it will not only think for us, but will out-think us and make millions unemployed. From call centre employees made redundant by chatbots, to writers of columns such as this, who will be replaced by LLMs, Large Language Models, which can replicate spoken and written words in endless permutations and combinations.\nBut for all the hullabaloo raised about it, AI is the inevitable outcome of a long process by which we have outsourced our ability to think to various devices.\nPerhaps the first of these was the abacus, which did the chore of addition and subtraction for us by moving beads on a framework, and was the predigital forerunner of the pocket calculator which did away with the need for us to do mental calculations or to mug up multiplication tables.\nCalculators, which were mini portable computers, gave way to smartphones which, apart from fulfilling their main function of taking selfies, are the Khulja SIM SIM to a treasure trove of information, never mind if some of it is misinformation or fake news, but which relieves us of the chore of learning history, or geography, or acquiring any form of knowledge. Thinking? Let Wikipedia do it for us.\nThe cumulative result of this mental abdication is AI. Descartes? Wasn’t he the dude who said, AI thinks, therefore I AIn’t…? \n\n",
        "headline_1": "AId-de-camp",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/aid-de-camp/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "Trump thinks Tesla factory here’s ‘unfair’. But Musk’s car company needs to be here\nOn a day when Tesla fans cheered the brand’s likely entry in India, Trump made it clear he’s not thrilled by a Tesla factory here. “That’s unfair to us. It’s very unfair,” he said, circling back to his pet peeve about India’s high tariffs. He needn’t have bothered. With just 13 jobs advertised on a portal for Delhi and Mumbai, Elon Musk clearly does not have a manufacturing or assembly plan yet. Why would he, with plenty of spare capacity abroad? So, all he’s looking for now is to import-market-sell.\nBesides, with Chinese showroom prices of the cheapest Tesla, Model 3, starting around $32,000 (28L), the brand can only aim for a niche in India – rich people with green sensibilities. And those are Shanghai-made cars. Even if Musk gets Teslas from Germany, with Indian import duties, the cars will be costlier. Regardless, Tesla needs to be in India. Unlike 2022, when it announced intent and then backed off because India did not relent on tariffs without a commitment to manufacture locally. Or 2014, when then Tesla CIO Jayaprakash Vijayan mentioned a 2015 plan that didn’t materialise. Modi visited Tesla’s California factory in Sep ’15; Musk announced his China manufacturing plan a month later.\nSo, why now? Because this is not 2022 when Tesla’s gross profit margin was 30%. It slipped below 15% in the last three months of 2024. The average sale price of its cars has fallen by a third to almost $40,000. All-brand EV sales in Germany, where Tesla has a Gigafactory, fell 40% last Dec. Yes, it broke its own record in China with 657,000 cars sold last year, but faced stiff competition from local brands like BYD and Xiaomi. While it sold 1.79mn cars worldwide – a dip of 1.1% – BYD sold 1.76mn, recording 12.1% growth. Meanwhile, Mercedes and BMW, premium brands Tesla will be up against in India, have started EV assembly here.\nThe car industry is in a flux. Legacy carmakers can’t sit on their laurels anymore, nor can Tesla. It was seen as cutting-edge, but others have jumped into the autonomous car race. BYD will soon roll out driver assistance with DeepSeek. Meanwhile, Musk’s impatience is showing in US – he wants crash investigations related to his cars, and a dept of justice probe about whether he overstated his cars’ capabilities, scrapped. What he also needs is a new and growing market.\n\n",
        "headline_1": "Elon riders",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/elon-riders/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "Wipro founder chairman writes on GOI’s new tax code\nI have had the rare opportunity to have studied and experienced the workings and impact of the Income Tax Act, 1922, and its 1961 successor. When the proposed New Income Tax Bill, 2025 becomes law this year and later comes into force, I’ll have had the distinct, possibly a unique, privilege of having lived through all three income tax acts being in operation – a tax trifecta – in independent India.\nIndia’s tax regimes have had everything – 98% tax rates, but also smart tax incentives for information and digital technologies, tax refunds withheld for years, but also instant grants of largest number of refunds upon filing tax returns.\nOver the last 10 years, govt must be credited with bringing about a paradigm shift, both in terms of tax structure and administrative efficiency – prefilled returns, mandatory e-filing, quicker refunds, faceless assessments. Yet dispute resolution isn’t always speedy.\nHaving lived through two previous iterations of I-T legislation, I can relate to the troublesome questions of most common taxpayers – why can’t the tax code be simple, why is tax practitioner required for the most basic tax implications, why does a tax return form require the taxpayer to check out so many irrelevant boxes, why should tax litigations remain unresolved for long?\nSo, a recast of the tax code was most welcome. The new Bill signals a clear intent to modernise and simplify the tax code, reducing the sense of intimidation often associated with tax matters. Several key provisions demonstrate a drive towards simplification. Replacing terms like “Previous Year” and “Assessment Year” with the more intuitive “tax year” and using easier-to-absorb formats like tables, formulae, and schedules give a lucid presentation to the code. This focus on plain language and comprehensible legal expressions aims to demystify tax jargons and empower taxpayers. The “trust first, scrutinise later” doctrine is embedded in the Bill.\nWhile the Bill addresses concerns over interpretation-based litigations, the role of robust administrative provisions is crucial. Exploring and institutionalising alternatives to ensure speedier dispute resolution will reduce tax disputes, contributing significantly to ease of doing business.\nThe Bill also provides an opportunity to align Indian taxation system with evolving international taxation concepts, including the increasingly key area of profit allocation among participating countries in crossborder transactions. This will mean greater simplicity, transparency, and fairness.\nGiven my close association with philanthropy, the simplification of provisions relating to non-profit organisations (NPOs) has not missed my attention. The Bill provides much needed clarity on permissible commercial activities of registered NPOs, a critical area previously lacking a precise definition. This clarity will help NPOs operate with greater certainty and avoid legal challenges. The inclusion of permitted investment modes in the schedule is a helpful step, but a mechanism for adding new entries without requiring constant parliamentary amendment may also be considered. This will allow for greater flexibility and responsiveness to evolving financial instruments and market conditions.\nThe meticulous efforts invested in preparation of the Bill are commendable, and govt deserves recognition for its commitment to reforming this vital area of public policy. The intended implementation date of the Bill is April 1, 2026, which provides ample time for public consultations, expert deliberations, and stakeholder feedback.\nWhile govt has already engaged meaningfully with stakeholders during the drafting process, continued engagement is vital. This will help identify and address any remaining ambiguities, inconsistencies, or unintended consequences. Such an inclusive approach will ensure a smoother transition and maximise the effectiveness of the Bill. I wish GOI all success in the smooth passage of the Bill.\n\n",
        "headline_1": "‘Most welcome recast’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/most-welcome-recast/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "Whether you're searching for contemporary works by emerging writers or timeless classics from renowned authors, this list highlights must-read books that deserve your attention during your visit.\n\"Bibaho\"\nMomtazuddin Ahmed\nA poignant tale that revolves around the protagonist Sakhina's husband who is martyred in the 1952 Language Movement, Ahmed's work captures simultaneously the heartbreak and the pride of losing a loved one for the greater, collective political aspiration of a people. As Sakhina mourns the death of her beloved, her father urges her to take pride in his sacrifice—a dualism that characterises Bangladesh's struggle for independence. \nEkushe February\nHasan Hafizur Rahman (ed.)\nBangala Gobeshona, 2020\nPublished on the first anniversary of 21st February, this short story collection features stories, such as Shawkat Osman's \"Mouno Noy\", Nur Ul Alam's \"Ekaler Rupkatha\", Rabeya Khatun's \"Prothom Boddhobhumi\", Shahidullah Kaisar's \"Emni Korei Gore Uthbe\", among others. Set against the backdrop of the tumultuous days of February 1952, this collection offers snippets of quotidian Bangali lives as the struggle for independence and linguistic autonomy raged on. \n\nOn the occasion of this year's Ekushey Boi Mela, book lovers have much to look forward to. From thought-provoking short stories and captivating novels to powerful poetry and engaging plays, the fair offers a diverse selection catering to all literary tastes. \nMofossholio Intensity\n\nSyeda Nilima Dola\nOitijjhya Prokashoni, 2025\nBrought to this year's Boi Mela by Oitijjhya Prokashoni, in her debut poetry collection, Syeda Nilima Dola traces her evolution as a poet, capturing the raw emotions and transformative moments that have shaped her journey. Much like the title of her book, she finds the intensity of her love for life through poetry. In Mofossholio Intensity, she explores the experiences that shape our psyche and the intensity of emotions that moves us to find solitude in art. With an achingly beautiful tribute to all the people she loves, this book explores the theme that we are just a mosaic of everyone and everything we have ever loved.\nHijra Shobdokosh\n\nSelina Hossain\nSomoy Prokashon, 2019\nSelina Hossain is a widely celebrated Bangladeshi fiction writer who sheds light on society's taboos through activism in her writing. Her book, Hijra Shobdokosh, is another significant addition to her literary works, published in 2019 by Somoy Prokashon. This book provides detailed information on the language, culture, and various aspects of the lives of the Hijra community. It highlights the scrutiny and misconceptions surrounding the Bangladeshi Hijra community and the generational mistreatment that they have lived through. It inspires conversation on how we can practise open-mindedness and recognise the struggle such marginalised communities face in cementing their identity in this society. Encouraging their social inclusion, it urges readers to see the Hijra community as an equal and respected minority while emphasising the importance of accepting their existence. \nThe White Book\nHan Kang, Tripti Santra (translator)\nKobi Prokashani, 2025\nEach year, innumerable Bangla translations of international bestsellers inundate the shelves at Boi Mela, making them accessible to a wider readership in Bangladesh. At this year's fair, we think Tripti Santra's translation of The White Book is one worth checking out. Originally written by Han Kang, a South Korean writer, The White Book is a deeply personal semi-autobiographical account that immerses readers into the severity of losing a loved one and the confusion of perceiving the world in their absence. Kang first rose to international prominence for her novel The Vegetarian, which became the first Korean language novel to win the International Booker Prize for fiction in 2016. In 2024, she became the first Asian woman to win the Nobel Prize in Literature, which the Swedish Academy awarded Kang for her \"intense poetic prose that confronts historical traumas and exposes the fragility of human life\".\n",
        "headline_1": "5 books to look out for at this year’s Boi Mela",
        "headline_2": "",
        "link": "https://www.thedailystar.net/culture/books/news/5-books-look-out-years-boi-mela-3828801",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "We are deeply alarmed by what happened on Tuesday on the campus of Khulna University of Engineering and Technology (KUET) and the subsequent tensions spreading across multiple universities. The violent clashes between activists of Jatiyatabadi Chhatra Dal (JCD), the pro-BNP student wing, and the Students Against Discrimination platform—leaving about 50 injured—signal a troubling return to the age-old toxic student politics that long vitiated our campuses. At a time when the nation eagerly awaits a shift in our political culture after 15 years of autocratic rule by Awami League, and amid ongoing commitments by political parties to building a \"new Bangladesh,\" this development is both shocking and disheartening. It shows that, unless checked, the ghosts of the past may easily resurface and undo our hard-earned progress.\nThere are conflicting accounts about who initiated the violence and the identities of those involved, with JCD blaming Chhatra Shibir's influence under the banner of the student platform. But this only adds to the confusion surrounding the shifting political allegiances and narratives in the wake of the July uprising. According to our report, tensions had been brewing at KUET over JCD's campaign to lift the existing ban on student politics, leading to protest rallies by anti-discrimination activists. Then on Tuesday afternoon, both groups faced off, resulting in a series of clashes, chases, and counter-chases that lasted until the evening. By then, photos of men wielding large scythes and machetes, as well as injured students, went viral on Facebook. Later, Jubo Dal, BNP's youth wing, expelled Mahbubur Rahman, vice-president of its Daulatpur unit in Khulna, after he was seen brandishing a sharp weapon.\n\nAt a time when the nation eagerly awaits a shift in our political culture after 15 years of autocratic rule by Awami League, and amid ongoing commitments by political parties to building a \"new Bangladesh,\" this development is both shocking and disheartening. It shows that, unless checked, the ghosts of the past may easily resurface and undo our hard-earned progress.\nBy now, we know about the protests and showdowns that followed the KUET incident, including at Dhaka University, Jahangirnagar University, Chittagong University, Rajshahi University, and Jagannath University. On Wednesday afternoon—after an ultimatum from KUET students demanding a complete ban on student politics, punishment for the attackers, and the resignation of top officials—the university authorities decided to prohibit all forms of political activities on campus. Students found engaging in politics will face permanent expulsion, while teachers, staff, and officials are also barred from any political involvement. A four-member committee has been formed to investigate Tuesday's violence, including the role of outsiders. All academic activities will also remain suspended until February 28.\nWhile we welcome the prompt response by KUET authorities, it is not enough to defuse the tensions brewing within the wider community of politically minded students. The bellicose rhetoric from some student leaders is only making matters worse. If this is a preview of what lies ahead, it is deeply disturbing. This calls for a sober reflection by all parties involved, including the warring student factions. While we support the emergence of a new student-led party and acknowledge that differences of opinion are natural, all parties must ensure that their activities do not harm the interests of general students. The student politics of old has no place in post-uprising Bangladesh.\n",
        "headline_1": "We must prevent the resurgence of toxic student politics",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-must-prevent-the-resurgence-toxic-student-politics-3828526",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "The events that unfolded at Khulna University of Engineering and Technology (KUET) on February 18 serve as a stark reminder of the direction Bangladesh's educational institutions are heading. It should be looked at as more than just an isolated incident, but more as a preview of what the future holds if we continue down the same perilous path. The rapid resurgence of age-old toxic practices on campuses is alarming. What happened at KUET is nothing less than a betrayal of the sacrifices made during the upheaval of 2024—a time when people bled and endured lifelong suffering in pursuit of a better future. Those who wish to understand the true essence of 2024 need only revisit the videos and graffiti from that time. The message was clear: the stranglehold of partisan blindness, campus violence, and opportunistic hypocrisy had to end.\nFor the last four to five decades, how many true leaders have emerged from student politics? If we examine the legacy of recent campus-based politics, the results are disheartening. Instead of nurturing responsible, visionary leaders, student politics has often devolved into factional brawls, extortion, deception, dormitory takeovers, and the exploitation of campus resources for personal gain.\nThe repercussions of this flawed system are evident in the country's governance today. Many of those who once indulged in student politics have moved on to become police officers, bureaucrats, teachers, and tax officials. The practices they learnt on campus—intimidation, manipulation, and corruption—are now deeply embedded in the fabric of Bangladesh's institutions.\nWhat kind of educational environment do we truly want for our students? What should a university campus represent? We envision a campus where students exhibit such discipline and responsibility that they, alongside a few administrative staff, can efficiently manage their residential halls. This model, followed by top universities worldwide, not only streamlines administrative functions but also nurtures future leaders.\nUniversities should be hubs for intellectual discourse, debate, and dialogue. Students must learn to engage with diverse perspectives, embracing inclusivity and critical thinking rather than blind allegiance to any political ideology. A politically aware student body should prioritise education-centric activism—demanding increased funding for academic research, well-stocked libraries, nutritious food in canteens, and better living conditions in dormitories. These are the real concerns that affect students' lives and futures. When injustice occurs anywhere in the country, students should rise above political affiliations and speak out. Corruption and oppression know no political colour, and neither should the voices of the youth.\nIf student politics continues to promote division rather than unity, how can these same students later contribute to building an inclusive society? The primary duty of students is to pursue education and research. Beyond that, they should engage in social service, sports, and cultural activities. But under no circumstances should they allow themselves to be used as pawns in partisan power struggles—especially not during their formative years.\nFor a while now, politicians have been uttering nice words—words designed to erase the memory of 2024, like an eraser slowly wiping away hard-fought progress. Now, every political party seems eager to erase the lessons of that transformational year, rushing to restore the very system that so many fought to change.\nIf we do not act now, if we do not demand accountability and resist the return to divisive politics, our universities will continue to be breeding grounds for corruption and chaos rather than institutions of innovation and learning. The events at KUET are a warning—one we ignore at our own peril.\nKamrul Hassan Mamun is professor at the Department of Physics at Dhaka University. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries, and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Are we returning to divisive campus politics?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/are-we-returning-divisive-campus-politics-3828351",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Tax collection conundrum",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/tax-collection-conundrum-1739975152",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Let UPS be not a failure",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/let-ups-be-not-a-failure-1739975222",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Public servants' wealth statement: What next?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/public-servants-wealth-statement-what-next-1739975273",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-02-2025"
    },
    {
        "full_article": "",
        "headline_1": "Avert elephant-human conflict",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/avert-elephant-human-conflict-1739975295",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-02-2025"
    }
]