[
    {
        "full_article": "The hearings on the Presidential Reference that followed the Supreme Court judgment on April 8, 2025, clarifying the constitutional position on the powers of the Governor and the President in providing assent to Bills passed by State Assemblies, have largely confirmed that Governors should not indefinitely withhold assent to such Bills. Addressing the 14 questions posed in the Presidential Reference, the observations of the five-judge Bench largely converged on the constitutional principles elucidated in April. The question by the Chief Justice of India, B.R. Gavai, on whether the Court should “sit powerless” while Governors make “competent State legislatures defunct” echoed the core concern in the April judgment — that constitutional offices cannot paralyse democratic governance through inaction. While States’ counsel largely argued along political lines based on which parties governed them, this did not detract from the thorough examination of Articles 200 and 201 during the proceedings. The argument that the Constitution’s silence on specific timelines in these Articles does not grant unlimited discretion to Governors remains compelling. When the Solicitor-General argued that Governors serve as a “check on hasty legislation”, the Bench’s response also indicated the tension between this position and democratic principles. Justice Vikram Nath’s observation, that Governors “cannot sit over the wisdom of the legislature indefinitely”, was succinct.That only Opposition-ruled States have faced prolonged delays, as pointed out by Kerala’s counsel, suggests the constitutional framework itself is not ambiguous but that its application has become selective. The Bench’s examination of why judicial review applies to Governors’ recommendations under Article 356 (President’s Rule) but supposedly not to actions under Article 200 (assent to Bills) highlighted potential inconsistencies in arguments defending unlimited discretion for Governors. The proceedings related to the questions posed in the Presidential Reference demonstrate why the April judgment’s framework remains constitutionally sound and necessary to maintain the balance between federal cooperation and State autonomy. The question from these hearings is on why the Centre chose this unusual route. As scholars have established, an advisory opinion by the Court under Article 143 does not override a binding judgment under Article 141. If the Centre genuinely sought clarity on the April judgment, well-established judicial procedures such as review petitions or curative petitions were available. When the Court’s final reply to the Reference is received, the Centre should accept the constitutional boundaries that the April judgment and these proceedings have reinforced, rather than continuing to pursue powers that would alter the delicate federal balance that the Constitution has established. Published - September 17, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        Governor\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        constitution",
        "headline_1": "Constitutional clarity: On hearings on the Presidential Reference",
        "headline_2": "Presidential Reference proceedings strengthen case against delays by Governors",
        "link": "https://www.thehindu.com/opinion/editorial/constitutional-clarity-on-hearings-on-the-presidential-reference/article70057096.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "India’s August trade data by the Commerce and Industry Ministry must come as a respite for the Central government, as it faces demands ranging from interest subvention to loan repayment moratoriums from labour-intensive sectors such as seafood and textiles and apparels. But there is no telling how long this respite will last, as it largely depends on the trajectory of the renewed trade negotiations between India, and its largest trading partner, the United States, amid America’s punishing 50% tariffs on imports applicable from August 27. Goods exports in August rose 6.7% year-on-year (YoY) to $35.10 billion, while imports declined by 10.12% to $61.59 billion, led by steep falls in inward shipments of gold (-57% YoY) and silver (-60% YoY). As a result, merchandise trade deficit narrowed to $26.49 billion in August from July’s $27.35 billion. But the strains of the U.S.’s 25% “reciprocal tariffs”, that kicked in on August 7, show in the sequential drop in exports. Goods exports in August to the U.S. dropped to $6.86 billion from $8.01 billion in July, while overall exports shrunk to $35.10 billion in August from $37.24 billion in July and $35.14 billion in June. This suggests that the scramble for stockpiling by American importers has begun to slow and the full effects of the 50% tariffs will reflect in September’s trade data. While U.S. shipments in electronics, gem and jewellery and engineering goods saw mild declines in August, textiles witnessed the sharpest fall of about 2.7% YoY. To be sure, these sectors witnessed impressive YoY overall growth. Not surprisingly, drugs and pharmaceuticals, a sector that is exempt from the tariffs, have done well sequentially and on-year, with exports growing 6.94% YoY to $2.51 billion in August.What is worrying is the sharp decline in imports across products and sectors — transport equipment (-26.54%), coal and allied products (-26.2%), wood and allied products (-14.46%) and iron and steel (-10.98%). This suggests either a slowing in economic activity, or an attempt to find cheaper domestic suppliers in the wake of tariff-related price pressures. Lower merchandise imports might be good for the deficit, but a sudden decrease such as this is alarming. What is also telling is that despite strained diplomatic relations between India and China, Beijing remains a top trading nation for India. That China remains a main source of imports (grew by 10.19%, April-August) shows that diplomacy and economic relations are far removed from each other.\r Published - September 17, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        trade policy\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        interest rate\n                    \n                            /                      \n                        \n                        loans\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        seafood\n                    \n                            /                      \n                        \n                        textile and clothing\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        gold and precious material\n                    \n                            /                      \n                        \n                        imports\n                    \n                            /                      \n                        \n                        electronics\n                    \n                            /                      \n                        \n                        jewelry\n                    \n                            /                      \n                        \n                        transport\n                    \n                            /                      \n                        \n                        coal\n                    \n                            /                      \n                        \n                        iron and steel\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        economy (general)",
        "headline_1": "​A brief respite: On India’s August trade data, U.S. tariff impact",
        "headline_2": "The full effects of the 50% tariffs will reflect in September’s trade data",
        "link": "https://www.thehindu.com/opinion/editorial/a-brief-respite-indias-august-trade-data-us-tariff-impact/article70057131.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "Delhi, Haryana, Bihar…sex ratio at birth has seen alarming reverses. Govts have grown lax\nAt one level, Indian policymakers well understand what a skewed sex ratio means for the country. The ‘son preference’ it reveals doesn’t just conspire to rob opportunities from the ‘missing women’, but all of society and economy. ‘Who will marry her if she breaks her nose’ was the kind of doubt that women boxers from Haryana had to punch past, before their gold podium finish at the ongoing World Championships. How many aspirations never get to breathe because of the odds being severely stacked against the female gender? Unfortunately, at the follow-through level, govts are failing alarmingly in the task of controlling sex-selective abortions to ensure the birth of sons. \nThe most recent data is from Delhi, where last year’s annual report of births and deaths shows the sex ratio at birth declining for the fourth successive year – from 932 in 2021, 929 in 2022, 922 in 2023, to 920 females being born in 2024 per 1,000 males. Last year also saw the sex ratio at birth in next door Haryana dropping to 910, an eight-year low. In Bihar, ahead of an assembly election where it should absolutely be but it isn’t a campaign issue, the Civil Registration System data released in June indicates the same worrying trend. Its sex ratio at birth has declined from 964 in 2020 and 908 in 2021 to 891 in 2022, the lowest among all states and UTs. \nDifferent datasets are occasionally also pointing in opposite directions, which makes the absence of census’s complete enumeration acutely felt. Back in 2011 the increase in sex ratio over 2001 had the world cheering how govt efforts to curb sex selection, combined with broader social changes such as rising education and wealth, had paid off. But now it seems that the system got too complacent too soon. Even as people are having fewer children, with nearly 66% of live births in 2023 being first-order births, enforcement of the law that bars prenatal sex selection has fallen horribly behind tech advances like portable ultrasound machines and business dodges such as the use of coded language by doctors and clinics. Such govt laxity threatens to undo decades of labour. \n\n",
        "headline_1": "Gone Girls",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/gone-girls/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "Trade talks are welcome, but US trying to arm-twist New Delhi into buying its corn is not \nThe ink on a US-India trade deal would have dried weeks ago had Trump not derailed negotiations on the pretext of Russian oil. But it seems he has seen the light. His rhetoric has softened, US trade rep Brendan Lynch has paid a visit, and while the Indian side made it clear that yesterday’s meeting with Lynch was “not an official round of negotiation”, Trump’s man certainly wasn’t here to “shoot the breeze”. His ambassador designate Sergio Gor has also said a deal is imminent.\nSo, now that we are back at the table, it’s worth remembering that Russian oil is only a red herring weaponised for leverage. The US side’s goal remains what it was in May, June and July – getting India to lower tariffs on farm imports. US commerce secretary Howard Lutnick’s latest grievance – “Why won’t 1.4bn people buy one bushel of US corn?…they sell everything to us, and they won’t buy our corn…” – should dispel all doubts about US intent.\nCorn is a very big deal in Trump-voting states. US produces more than 30% of corn worldwide, but not as food. More than a third of it is turned into ethanol for fuelling cars, around 40% is used as livestock feed, a tiny percentage – 1.5% – goes into breakfast cereals, and about 18% is exported. But with China cutting back on US corn, there’s a glut. And after Trump’s tirade against high-fructose corn syrup in July, another 3% of US corn demand is in jeopardy. That’s why US officials desperately want to palm off some of their surplus on India.\nA couple of years ago, India buying corn would have been unthinkable, because of its own considerable surplus. But the recent ethanol-in-fuel mandate has changed that. India is a net importer of corn now, but it can’t buy US corn, which is genetically modified. It’s a non-negotiable Indian policy that US wants to ride roughshod over. For Lutnick, etc, here’s a kernel of fact (interestingly, ‘kernel’ is derived from ‘corn’, which is close to ‘kan’, Sanskrit for particle) – you couldn’t arm-twist India with Russian oil, don’t start again with corn.\n\n",
        "headline_1": "Cornfabulations",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/cornfabulations/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "Trump’s renamed Department of Defence is inspired by Orwellian doublethink \nWith America’s Department of Defence renamed Department of War by presidential decree, Second Opinion sought an interview with the White House which is literally gunning for the Nobel Prize for Peace. \nSO: You’re madly lobbying to get the Nobel Prize for Peace. But you renamed your Department of Defence as the Department of War. Isn’t that a bit self-contradictory? \nWH: Heck, it ain’t. War an’ Peace go together, as the title of that Russian fella’s book says, but I got the idea for the Department of War from that other writer fella, George somebody. \nSO: You mean George Orwell, and 1984, which describes a dystopian dictatorship, whose brainwashing doublethink mantra was War is Peace. \nWH: Yeah, that’s the guy. And I like doublethink because I can think double as fast as anyone else. \nSO: But in your doublethinking how do you plan on getting the Nobel Peace Prize by creating a Department of War? \nWH: It’s obvious you can’t even singlethink, let alone doublethink. I can’t get the Nobel Prize for Peace unless there’s a lotta wars for me to stop. So my Department of War is gonna outsource wars to a lotta countries, so that I can go an’ put a stop to them. That’s how I’ll get the Nobel Prize for Peace. \nSO: I’ve heard of the military-industrial complex, but your idea doesn’t just take the cake, it takes the entire dessert course. But how is your Department of War going to get countries to go to war against each other? \nWH: Easy-peasy. The way I’m sanctioning India to get Russia and Ukraine to stop their war, I’ll use sanctions to get other countries to start wars, which I can stop. My doublethink sanctions can serve the double purpose of both stoppin’ and startin’ wars. \nSO: I’m sure your doublethink sanctions will get a doublethink Nobel Prize for a peace that passeth all understanding…\n\n",
        "headline_1": "War ’n’ peace",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/war-n-peace/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "Early information suggests Charlie Kirk’s assassin had much in common with him. They were both embedded in the most toxic parts of social media and in exporting its logic to the real world\nThe assassination of right-wing provocateur Charlie Kirk in Utah has led to anger and panic in US political circles.\n\nWhile conservatives are vowing to crack down on political opponents, liberals are afraid that the killing will be used to justify repression.\nRead the full story on TOI+.\n\n",
        "headline_1": "An uncommon assassination",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/an-uncommon-assassination/",
        "news_paper_name": "The Times of India",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 17, 2025 00:00:00  \nThe claim that the economy had been experiencing an era of remarkable growth during the past decades is gradually proving to be hollow as the so-called growth totally failed to create enough employment opportunities. Economists and experts prefer to call it jobless growth. Worse, the so-called growth hype actually masked surging poverty, particularly over the past three years. A recent study by the Power and Participation Research Centre (PPRC), a local non-profit research and policy advocacy group, has shown that the rate of poverty in Bangladesh increased to 28 per cent in 2025 from 18.7 per cent in 2022. Again, the percentage of people living in extreme poverty, too, has risen to 9.35 per cent in 2025 whereas three years ago it was 5.6 per cent. That means one in every four persons in the country lives below the poverty line and one in every ten person lives in extreme poverty. Some 18 per cent of the population now above the poverty line, on the other hand, according to the PPRC study, are at constant risk of falling below the poverty line at the slightest change in the economic situation for the worse. How to explain this strange reversal of poverty situation when the decade between 2000 and 2010 saw a steady and uniform decline in the poverty rate? \nThe recent reports of reversal of the poverty reduction trend, according to experts are rooted in five vulnerabilities, namely, prevalence of chronic illness, a disproportionately large share of the extreme poor in the female-headed households, rising household debt, food insecurity and inadequate sanitation. These are obviously the factors that tend to push more of the vulnerable ones below the poverty line, or keep those already poor trapped in that condition. Since poverty-stricken families cannot send their children to school, that reality further contributes to what experts term 'generational poverty'. That means, if urgent measures are not taken to lift such families out of poverty, their next generations risk remaining entrapped in poverty. \nThe interim government itself cannot avoid its responsibility in this regard as it has failed to include poverty reduction as one of its reform agenda. So, there is a reason to believe that the situation of poverty and joblessness as reflected in these study data may be just the tip of the iceberg. In fact, inequalities are further widening in society at a higher rate than before thanks to ever-rising cost of living. The situation is getting further compounded by the income level of middle and lower middle income segments of the population remaining stagnated. The widening income gap is, according to some experts, is affecting the rural landscape more than the urban one. Thus the situation of the low and very low income segments of the population living in urban and rural conditions becomes worse. \nAll these development definitely militate against any illusion of growth or well-being of the majority segment of the population. The situation calls for urgent measures to ensure that those in extreme poverty can at least have food support from the government while the vulnerable section may also benefit from similar government interventions aimed at securing them from falling into extreme poverty. Creation of favourable conditions by the government to help stimulate private sector growth will generate jobs in order to address the rising level of unemployment.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Prioritising reduction of poverty, income gap",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/prioritising-reduction-of-poverty-income-gap-1758032151",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       September 17, 2025 00:00:00  \nIn rural Bangladesh, the challenges facing agriculture are many and varied. Among these, the marketability of perishable products like potatoes presents a persistent problem. This is compounded by a lack of adequate transportation infrastructure that does not allow farmers to carry their produce directly to nearby wholesale or retail hubs. In the absence of such facilities, intermediaries step in to fill the logistical void -- often manipulating prices to their advantage and to the detriment of farmers. Despite frequent pledges by policymakers to reduce the undue influence of these middlemen, the reality is that farmers -- especially during the post-harvest glut -- are left with few alternatives but to accept the terms dictated by intermediaries.\nIn such circumstances, farmers are compelled to sell their produce at throwaway prices, unable to wait for better market conditions due to lack of storage facilities or transport. This exploitative cycle could be significantly mitigated if the government were to provide subsidised or cooperative-based transportation solutions, as is being practised successfully in some neighbouring countries. This would enable growers to access more competitive markets and sell their produce directly, thus reducing their dependence on exploitative intermediaries.\nHowever, focusing solely on the low returns from agriculture without assessing the broader context may lead to an overly simplistic and potentially misleading interpretation of rural livelihoods. A common complaint is that farm-based activities yield less income than non-farm occupations. While factually true in many instances, this observation requires a more nuanced understanding. Why do non-farm activities tend to be more rewarding, and what can be done to address this disparity without undermining either of the sectors?\nOne key reason behind the increasing attraction of non-farm employment lies in the ongoing transformation of rural economies. Over the past few decades, the urban-rural divide has been narrowing due to the penetration of modern technologies, improved connectivity and better access to education and information. This has given rise to substantial economic diversification in rural areas, opening up a myriad of income-generating opportunities that were once unavailable or unthinkable in a purely agrarian setting.\nThe inflow of overseas remittances has played a significant role in reshaping rural economic landscapes. These remittances not only enhance household incomes but also reduce the economic reliance on agriculture. Many rural families, benefitting from remittance flows, now engage in a variety of non-agricultural ventures -- ranging from small retail businesses and service enterprises to transport and construction work. As a result, the younger generation is increasingly getting disinterested in traditional farming, preferring instead the higher and relatively steadier returns from non-farm activities.\nIt would be erroneous, therefore, to view the growing appeal of non-farm work as detrimental or less desirable. On the contrary, non-farm activities more entrepreneurial in nature bring their own value to rural development. They promote innovation, self-employment, and resilience, especially when agricultural incomes are hit by climate shocks or market volatility. The real challenge lies in creating a balanced approach that strengthens both sectors, allowing them to complement and reinforce each other.\nThis calls for a reorientation of rural development strategies. While continued support for agriculture remains essential -- through better pricing mechanisms, access to credit, improved storage and transport infrastructure and modern farming techniques -- it is equally important to encourage the growth of rural non-farm enterprises. This could involve skill development programmes, micro-financing schemes, and support for small and medium-sized enterprises (SMEs) operating in rural regions.\nMoreover, promoting stronger linkages between farm and non-farm activities can create a virtuous cycle of rural growth. For example, agro-processing units, packaging businesses, transport services, and agricultural input suppliers all represent non-farm sectors that are intrinsically linked to agriculture. Encouraging such interconnected enterprises not only adds value to agricultural outputs but also generates employment opportunities. This kind of synergy helps rural economies become more diversified and resilient to shocks.\nInstitutional reforms are vital for facilitating this transformation. Many of the institutions responsible for rural development remain fragmented or ill-equipped to respond to changing economic realities. Strengthening their capacity, improving coordination among them, and making them more accountable and responsive to the needs of rural populations are crucial steps. At the same time, policy focus must shift from isolated sectoral interventions to more integrated and inclusive rural development frameworks.\nInvestment in rural infrastructure -- such as roads, electricity, internet connectivity, and market facilities -- can further stimulate both farm and non-farm growth. In particular, digital technologies hold immense potential to connect farmers directly with buyers, access market information and benefit from e-commerce platforms. Likewise, non-farm entrepreneurs can leverage digital tools for marketing, financial transactions and expanding customer bases.\nEducation and vocational training also have a major role to play. By equipping rural youth with skills aligned to both farm and non-farm employment opportunities, the government can address rural underemployment and reduce the migration pressure on urban centres. Special attention should be paid to women and marginalised groups, ensuring that they have equal access to training, resources and market chains.\nRural Bangladesh stands at a crossroads. While the agricultural sector remains the backbone of the rural economy, non-farm activities are fast emerging as key drivers of income and employment. Rather than viewing the two as competing or exclusive, policymakers must adopt a holistic perspective that fosters complementarities. Bridging the gap between farm and non-farm sectors through institutional reform, infrastructural investment and supportive policies will be essential for unlocking the full potential of rural development.\nwasiahmed.bd@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bridging divide between farm and non-farm activities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bridging-divide-between-farm-and-non-farm-activities-1758032273",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 17, 2025 00:00:00  \n\nAccidents on roads and highways are increasing, with the death toll rising almost every day. A large proportion of these accidents involve motorcycles. Additionally, a significant number of accidents involve buses, trucks, covered vans, and small battery-powered vehicles. \nSome of the recent tragic incidents highlight the gravity of the crisis. On September 2, 2025, Bagerhat Government Physical Education College lecturer Avni Kumar Mondal lost her life when the motorcycle she was riding was hit by a goods-laden truck. She died on the way to the hospital. The next day, September 3, Iftekharul Islam Famin, a student of the English Department at Rajshahi University, was killed in a road accident in Binodpur. On September 5, Mostafiz Hasan, officer-in-charge of Naoga Police in Gazipur, was run over by a bus; he was declared dead at the hospital, while his wife was critically injured.\nA report published on September 3 revealed that 497 road accidents occurred in August alone, leaving 502 people dead and 1,232 injured. Of these, 165 accidents involved motorcycles, causing 176 deaths and 144 injuries.\nRoad accidents are fast becoming an epidemic in Bangladesh. The Bangladesh Passenger Welfare Association points to damaged roads, worsened by the monsoon and riddled with potholes, as one of the key reasons for the spike in accidents. Free movement of motorcycles, battery-powered rickshaws, CNG auto-rickshaws, and locally made vehicles such as Nachimon-Karimon further add to the chaos. Accidents are also caused by vehicles suddenly entering highways from feeder roads due to the absence of road signs, markings, and lights. Added to this are unfit vehicles, reckless driving, and overloading of passengers-all of which contribute to the deadly toll.\nSafety is one of the most basic human needs. Yet today, the situation has deteriorated to such an extent that ordinary people feel unsafe stepping onto the roads. Who will ensure the safety of citizens on the roads?\nMd. Raihan Hossain \nLecturer\nGovernment College of Physical Education\nBarishal\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Who to ensure road safety?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/who-to-ensure-road-safety-1758032288",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 17, 2025 00:00:00  \n\nThe healthcare system in Thakurgaon's Union Health and Family Welfare Centres is on the verge of collapse due to severe manpower shortages, absence of doctors and nurses and lack of medicines. As a result, the marginalised population, who largely depend on government healthcare, is suffering immensely.\nA visit to the Akcha Union Health and Family Welfare Centre in Sadar Upazila reveals an alarming situation: no patients, no health workers, only a building and furniture left to decay. The post of Deputy Assistant Community Medical Officer has remained vacant since October 2024 and there is no Family Welfare Inspector. The Raipur Union Health and Family Welfare Centre reflects a similar state of neglect, where the Deputy Assistant Community Medical Officer retired two years ago but is yet to be replaced.\nAccording to reports, out of 46 centres in the district, more than half of the sanctioned posts are vacant, including those of medical officers, inspectors, security guards, and aides. This manpower shortage, coupled with the fact that these centres have not received medicine supplies for over a year, has rendered them virtually non-functional. Understandably, patients are now turning away from these facilities, marking worsening of the plight of the poor and marginalised.\nIt is imperative that the authorities urgently address this crisis by filling vacant posts, ensuring adequate medicine supplies and restoring public confidence in these vital institutions. Without urgent intervention, rural healthcare in Thakurgaon will remain paralysed, depriving citizens of their basic right to medical care.\nAshikujaman Syed\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Thakurgaon's union health centres in crisis",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/thakurgaons-union-health-centres-in-crisis-1758032300",
        "news_paper_name": "The Financial Express",
        "publish_date": "17-09-2025"
    }
]