[
    {
        "full_article": "​This Deepavali, firecrackers are being burst under legal sanction in Delhi. The Supreme Court, in an order this week, modified a ban it had sanctioned since 2018, allowing the use of green crackers during the festival. While the decision comes with caveats on implementation, it underscores the continuous challenge authorities face in dealing with pressures from cultural norms and economic activity while prioritising public health and environmental safety. The re-introduction of legally sanctioned, less-polluting options marks a shift in government policy after the BJP came to power and aims to accommodate traditional celebrations while acknowledging the severe environmental impact of conventional fireworks in Delhi, which is disproportionately affected by noxious winter sir. This move recognises that for many across India, the use of fireworks is an integral cultural expression of joy during the festival of lights. Furthermore, the firecracker industry supports the livelihoods of lakhs of people, making economic considerations part of the regulatory landscape.​However, as the history of Delhi’s air pollution shows, the battle for clean air is a complex interplay of meteorology, economic structure, population, and geography. Multiple expert bodies and task forces have deployed science and widespread measurement—at a scale few cities in the world have attempted—to conclude that air quality is impacted by diverse sources: transport, industry, agriculture-waste burning, biomass burning, construction, and road dust at different periods. Evidence also suggests that intervals of extended rains often have the largest effect on improving average air quality levels. While the contribution of firecrackers to the annual pollution problem may be temporary, the data confirms that the resultant spike makes an already bad air situation worse. Allowing the use of scientifically developed ‘green’ crackers—which are estimated to be about two-thirds less noxious—is an effort to tolerate a temporary surge under controlled conditions. This approach seeks to find a middle ground between honouring tradition and minimising harm. But while green crackers represent an improvement over conventional ones, they are not zero-emission products. In legalising this less-effulgent option, governments and courts must be careful not to take the focus away from the need for public commitment to stricter environmental norms rooted in science and reason, and not in hope and faith. There is no alternative to comprehensive, consistent action against all sources of pollution. \r Published - October 20, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Deepavali\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        culture (general)\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        public health/community medicine\n                    \n                            /                      \n                        \n                        environmental issues\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        New Delhi\n                    \n                            /                      \n                        \n                        air pollution\n                    \n                            /                      \n                        \n                        rains\n                    \n                            /                      \n                        \n                        science (general)",
        "headline_1": "Fire in the sky: on Deepavali and the battle for clean air",
        "headline_2": "Green crackers are a compromise between joyful festivities and public health",
        "link": "https://www.thehindu.com/opinion/editorial/fire-in-the-sky-on-deepavali-and-the-battle-for-clean-air/article70182571.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "That the Maoist insurgency is on the back foot has been evident for months now. The Maoist presence has been limited to 11 districts, with its core areas whittled down to three — the forested and remote districts of Bijapur, Narayanpur and Sukma in Chhattisgarh. The credit for weakening what was once termed India’s “greatest internal security threat” must be shared by security forces that adapted counter-insurgency tactics to the realities on the ground, and district administrations and successive governments since the mid-2000s which accelerated developmental work. The defeat of the Maoists in hitherto impoverished tribal regions of central India followed a similar retreat from united Andhra Pradesh, which saw the same strategy. This made it near impossible for the insurgents to build alternative governance structures, eventually encircling cities — a plan followed by the Chinese Communist Party a century ago to defeat the Nationalists. The Maoists aimed to form base areas in remote districts of central and north-central India, in Jharkhand, Chhattisgarh, eastern Maharashtra, western Odisha and northern Andhra Pradesh. They expected support from tribals, many nursing disaffection due to the absence of the state and its developmental arms.While areas such as Abujhmad in south Chhattisgarh, Gadchiroli in Maharashtra and parts of Odisha initially provided conditions for the Maoists to establish alternative institutions, over time, tribal unrest grew, with resentment over being used as pawns in militarist battles against the Indian state. This was partly because the Maoists privileged armed struggle over the economic uplift of tribals. The Maoists gained strength in the late 2000s when the Salwa Judum campaign resulted in massive displacement and brutal internecine battles, providing discontented recruits. However, the Supreme Court’s ban on the campaign and the professionalisation of anti-insurgency forces weakened the militant insurgency. Simultaneously, tribal people saw more benefits from a proactive state — despite persisting limitations — leading to growing disillusionment with the Maoist idea of a violent route towards an alternative state. This experience mirrors what transpired in Peru, Colombia, the Philippines and Malaysia. That this realisation has dawned upon senior Maoist leaders is evident when surrendered Politburo member Mallojula Venugopal Rao suggested that the only task left was to “abandon the dogmatic practice of the Chinese and Russian lines, regardless of the change in circumstances and time [in India]”. This opens the opportunity for the cadres to utilise spaces within Indian democracy for political engagement. Even if it has not convinced all the insurgents as yet, it will serve the people of the remaining districts and those committed to their uplift well if the Maoists abandon their struggle.\r Published - October 20, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        Chhattisgarh\n                    \n                            /                      \n                        \n                        Andhra Pradesh\n                    \n                            /                      \n                        \n                        Jharkhand\n                    \n                            /                      \n                        \n                        Maharashtra\n                    \n                            /                      \n                        \n                        Orissa\n                    \n                            /                      \n                        \n                        tribals\n                    \n                            /                      \n                        \n                        security measures\n                    \n                            /                      \n                        \n                        Philippines\n                    \n                            /                      \n                        \n                        Malaysia\n                    \n                            /                      \n                        \n                        Peru",
        "headline_1": "For a new path: on the surrender of key Maoist leaders",
        "headline_2": "With the surrender of key Maoist leaders, peace is now possible",
        "link": "https://www.thehindu.com/opinion/editorial/for-a-new-path-on-the-surrender-of-key-maoist-leaders/article70182993.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "24 hours of costume changes and loud laughs, then preserving it all in the perfect group selfie\nIndian film endings routinely display their festive roots. All misunderstandings cleared, whole families in matching gaudy attire, and everyone rotating a sparkler clockwise. We all carry the Diwali gene. And we want a big festival, a festival we deserve, a festival that’s larger than life, king-size. A day of revelries, 24 hours of pure joy, when life is one large laddoo. Music, costume changes, loud laughs and ras malai till the eye can see. Your basic Karan Johar Diwali.\nA benevolent beaming takes over. Happiness is contagious, it’s a festival disease. Christmas, Eid, Diwali…every occasion a chance to renew or resurrect. We are that firework in the sky, a mithai in the mouth. We’ve sent our location to the goddess of wealth; Lakshmi will be here any minute. On this day women don’t flinch when they hear words like fuljhari and pathaka. The house is squeaky clean, like Lady Macbeth’s hand. Walls are painted, furniture replaced, the mop thrust into unreachable spots. You’ve auditioned for Ramleela and have been picked to be a part of the vanar sena, just like last year.\n’Tis the season of gifts – though most of us give away what we just got and do not like. A case of the left hand very much knowing what the right hand is doing. What really must be banned during Diwali sales are those useless, smirking candles that everyone receives and must now get rid of. One presents a lavender candle only to be handed a vanilla one. Perhaps the solution is to keep the one you have, thus breaking the cycle.\nWe want our life to be that picture-perfect moment of homecoming, after being out in the wilderness for far too long. Surrounded by friends and family, everyone smiling, a feeling of victory and the world lit up like there is no electricity bill to pay. And though we know life doesn’t stop there, that bad stuff can follow the group selfie we just posted, we do have this moment to preserve on Insta. As we go about life grimly, getting this degree and that job, falling for the wrong person, sandwiched between kids and parents both equally bratty, all we want in our life is one Diwali. Someone to stuff you with sweets without asking if you are diabetic, as you play cards and gamble away your ancestral home.\n\n",
        "headline_1": "Doing it like the movies",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/doing-it-like-the-movies/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "Big divide this Diwali will be between those who are still interested in food, and those who aren’t\nForget the Fendi, the cape lehenga, the 7-star spa session. Forget also all the stuff Indians have been putting into their stomach traditionally and modernly. The gift to give this Diwali is an injection. You take it every week although that hits your pocket with 14,000+ a month because they say your appetite goes off and stays off as long as you keep taking it. But though this is the gift to give this year, it comes with two big question marks. One, how much to give? You have to put a rupee value to how much you love that person you are interested in downsizing. Two, how to reorganise the Diwali party so those who are already taking it, those who are thinking about taking it, and those who say this is all a great pharma congame don’t come to blows with each other and overturn the cards table. Or drive away the DJ.\nLast Christmas saw Elon Musk posting a pic of himself dressed up as Ozempic Santa. Whatever you think about the West being a more open society, their celebrities have definitely been more open in their embrace of the lose-it-to-win-it injection. Here, though various glam folk are suddenly sporting what’s called the Ozempic face, not to mention the Ozempic butt, they keep saying they have adopted this difficult diet or that radical gym schtick. They say they have junked frying for the airfryer. Maybe. And maybe green firecrackers will keep away air pollution this Diwali.\nBe that as it may, many a hostess and host will find the lavish spread they have laid out is getting a decided thumbs-down from some guests. Forget coming back for seconds, they are not even finishing a single serving. They are holding onto one cocktail the whole night. Ok, what’s to be done with the leftovers is one issue, and the bigger one is if and when many more Indians start taking it, how’s Indian culture to survive.\nBarfi, gujiya, halwa, peda, bhujia, chivda, paan mojito, aloo kachalo, will it be the end of the road for them? This could totally become the primal reckoning of our times. And if so, it will upend everything. Celebration revolves around food – eating it, cooking it, shopping for it, talking about it, posting photos of it, even our memories of celebrations are profoundly interwoven with their featured dishes. So, enjoy this Diwali like there won’t be another like it.\n\n",
        "headline_1": "Injection Party",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/injection-party/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "Family doesn’t only mean sharing genes or marital status. The definition is expanding joyfully\nThe heady high of any festival is invariably tinged with a sense of minor dread as we prep to spend longer time with The Family – frenzied, frantic, some with high expectations, some fantastic, many annoying, complete with oddballs and the recluse, love and skirmishes, too much food and too little sleep. This is the unchanging dimension of Being Family.\nBut what has delightfully evolved and continues to ever evolve is the very construct of what constitutes a family. This is not to be boring on how a family is defined. Classic definitions all have common residence, members related by birth, marriage or adoption, or by inheritance. An early view was that a family had “adults of both sexes, … a socially approved sexual relationship, and one or more children”. Society has travelled a fair distance. That’s not to say old constructs no longer exist but we’ve long ditched the idea of two parents, two kids. The beauty is global society is expanding the family of What’s Family. Blended, child-free, same-sex, unmarried partners – it’s a healthily growing family. The term single-parent family is not just recognition of parental status but it’s a family type that’s happily become gender neutral too.\nIn the latest, there’s ‘chosen families’ – friends who’re a support network, a trend seen in LGBTQ+ communities and also among migrant groups. If Covid recentred attention to the importance of family-like support, it also returned many to the idea of ‘communal families’ – multiple generations or non-relatives living together. Festivals are the perfect time then for a nod to the modern concept – and laws and banking rules will eventually reform to keep in step – that family is way beyond sharing genes or legal status. Family is where there’s belonging, care and a sense of responsibility.\n\n",
        "headline_1": "Festival Of Families",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/festival-of-families/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "In an all-too-familiar headline, China’s ministry of commerce announced new and wide-ranging export controls on rare earth elements (REEs) and related technologies from December 1, 2025. The latest export controls on REEs have become a familiar move in its geopolitical playbook, designed to create short-term buzz ahead of high-stakes trade negotiations.\n\nOld hand: Beijing’s threats this time confirm its intention to negotiate\nHowever, this recurring tactic is quickly losing its potency. While the restrictions will cause immediate supply chain disruptions, they ultimately serve as a catalyst for the very thing Beijing wants to avoid: global diversification. Under Beijing’s new rules, foreign companies now need its approval to export any product containing more than 0.1% Chinese REEs or manufactured using their extraction technology. The ministry added five more REEs to its control list, bringing the total to 12. Moreover, applications from defence contractors will be denied outright, while semiconductor manufacturers face case-by-case reviews.\nThe timing is predictable. These restrictions give China negotiating leverage ahead of the Trump-Xi summit at the Asia-Pacific Economic Cooperation forum later this month. Beijing used the same playbook in June when it first imposed REE controls, only to negotiate a six-month deal with Trump that lifted restrictions in exchange for exemptions on Chinese student visas.\nHowever, the situation has changed since. The US is no longer caught flat-footed. In August, the department of defence took a 14.9% equity stake in MP Materials, the only operating rare earth mine in the Western Hemisphere, that aims to double processing capacity. The Pentagon is also funding Australian company Lynas to build a processing facility in Texas. These moves represent the first serious American effort to rebuild capacity since the 1990s.\nNumerous industries like automotive, electronics, and defence rely on a stable supply of Chinese REEs. China controls roughly 70% of global mining and nearly 90% of the refining and processing of these minerals. But this short-term pain is limited and negotiable. The US, for example, imported only $170 million in rare earths in 2024, down from $186 million in 2023. The India figures are even lower. More importantly, China has shown a willingness to negotiate.\nChina’s rare earth stranglehold was never inevitable. The country’s dominance is not because it possesses superior technology that cannot be replicated elsewhere, but through decades of govt subsidies and predatory pricing. When Western companies attempted alternative supply chains in the 2000s, state-subsidised dumping forced them into bankruptcy. But export restrictions eliminate that threat. Beijing cannot simultaneously restrict supply and flood markets with cheap REEs. Additionally, the underlying technology is neither new nor proprietary. Moreover, the technological landscape too is shifting away from rare earth dependence. Tesla has announced that its next-generation vehicle platform will eliminate rare-earth magnets completely. Toyota and European suppliers have demonstrated permanent magnets that replace half the heavy rare earth content with more abundant lanthanum and cerium.\nBy imposing such export controls, China accelerates all these trends. High prices incentivise substitution research. Supply uncertainty drives companies to qualify alternative suppliers. Each time Beijing plays the rare earth card, it burns credibility and pushes customers toward China+1 strategies.\nThe way forward? Impose countervailing duties against Chinese REEs to protect upcoming projects from predatory pricing. Establish joint stockpiles through multilateral frameworks like the Minerals Security Partnership. Accelerate recycling and substitution research. Urban mining from discarded electronics and motors can recover substantial volumes. Finally, promote friendshoring through equity investments in allied countries’ projects.\nIndia possesses an estimated 1.6 million tonnes of rare earth oxides (the world’s sixth-largest reserve). IREL is establishing a rare-earth permanent magnet plant in Visakhapatnam. The newly launched National Critical Mineral Mission provides the policy framework to accelerate these efforts. India’s lower demand provides a buffer during short-term disruptions. Yet that alone should not lead to complacency. India’s immediate priority should be to deregulate all parts of this supply chain, and fast-track approvals. Simplifying licensing for domestic exploration and mining, and funding exploration projects to reduce information asymmetry, will help. China has revealed the same card many times over. The first time caught the world off-guard. The nth time is simply confirmation that Beijing has no other leverage of comparable potency. The opportunity is for others to take.\n\n",
        "headline_1": "Beijing’s rare earth playbook is tired. It’s time India wrote its own",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/beijings-rare-earth-playbook-is-tired-its-time-india-wrote-its-own/",
        "news_paper_name": "The Times of India",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "The gruesome killing of three Bangladeshis by a mob in India's Tripura state last week demands a response that goes beyond mere diplomatic formality. The foreign ministry in Dhaka is right to call for an immediate, impartial, and transparent investigation into this heinous act. Regardless of the alleged circumstances, an accusation of illegal activity can never justify vigilante justice. The sanctity of life and the rule of law must prevail over frontier vengeance.\nThe 4,096-kilometre-long India-Bangladesh border is among the most porous and complex boundaries in the world. Stretching across riverine landscapes, dense forests, and farmlands, it cuts through communities that have shared socioeconomic ties for generations. Every day, people cross this frontier—some to visit relatives and others to trade goods. Amid this flux, illicit cross-border activities, especially cattle smuggling and narcotics trafficking, have flourished. These operations are not random but sustained by intricate local networks, often involving people on both sides of the divide.\nAgainst this backdrop, the Tripura killings highlight the precarious state of trust between the two nations. It may be recalled that just weeks before the incident, at a director-general-level conference between the Border Guard Bangladesh (BGB) and India's Border Security Force (BSF), both sides had pledged to halt cross-border killings, curb illegal intrusions, and repatriate detained nationals through lawful means rather than force. The conference also outlined broader steps: launching joint awareness programmes, advancing socio-economic development in vulnerable regions, and promoting mutual respect for border integrity. The BSF reaffirmed its commitment to adopting additional precautionary measures, including intensified night patrols in high-risk areas. For its part, the BGB voiced concern over recurring shootings of Bangladeshis by both BSF personnel and Indian civilians. Together, these exchanges aimed to usher in a new phase of restraint and collaboration.\nYet, the killings in Tripura have rendered India's assurances hollow. India's official response—delivered through its external affairs ministry—appeared to prioritise rhetoric over responsibility. By emphasising Bangladesh's duty to \"uphold the sanctity of the international boundary\" and \"support border fencing,\" New Delhi seemed to shift focus from justice to border management. Infrastructure improvements may be legitimate long-term goals, but invoking them in the immediate aftermath of a tragedy diverts attention from the core issue: accountability.\nIf India is genuinely committed to maintaining neighbourly goodwill, it must demonstrate that commitment through action. A thorough, independent, and transparent investigation must follow, culminating in the prosecution of all perpetrators. Anything less may further deepen mistrust and corrode the credibility of bilateral mechanisms built over the decades. At the same time, the Bangladesh government must continue to defend the right to life of its citizens, regardless of their socioeconomic status. Even those who engage in illicit border trade deserve the protection of law and the dignity of due process.\n",
        "headline_1": "Tripura mob killing of Bangladeshis exposes the accountability gap",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/tripura-mob-killing-bangladeshis-exposes-the-accountability-gap-4013726",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "This year's World Food Day came at a time when the nation remains plagued by high food prices. Although food production in Bangladesh has increased nearly five times since independence, millions of people still struggle to afford even one nutritious meal a day. The long queues in front of open market sales (OMS) trucks clearly show that proper access to nutritious food has now become a luxury for the poor.\nAccording to agricultural economists, food insecurity affects nearly one-third of the population. The World Bank estimates that poverty has risen to 21.2 percent in FY25, up from 18.7 percent three years ago, while extreme poverty has climbed to 9.35 percent. Inflation, which reached 10 percent in FY25, continues to erode people's purchasing power, especially for low-income workers whose real wages fell by two percent during the same period. Meanwhile, the Power and Participation Research Centre (PPRC) has warned that 18 percent of households just above the poverty line are now at risk of falling below it. And for the poorest 40 percent of households, survival increasingly depends on borrowing, with household debts rising by seven percent over the past six months.\nAn estimated loss of 20 lakh jobs between 2023 and 2024, particularly in the service sector, has deepened the crisis. For instance, while talking to this daily, Rosy, who lost her job after the buying house where she worked closed, says she now relies on OMS trucks for food. And day labourers like Delwar survive on lentils and vegetables, often borrowing to feed their families. Across major cities, such stories are increasingly common.\nWhile the government's OMS programme provides temporary relief, its limited reach and inadequate supply expose the weakness of our food distribution system. A recent report by the Research and Policy Integration for Development (RAPID) found that although cities host a growing number of low-income earners, 64 percent of extremely poor urban households remain excluded from state assistance. This imbalance, with policies still largely focused on rural areas in an increasingly urban economy, has left millions of city dwellers severely exposed to hunger.\nThe government, therefore, must act urgently to control high food inflation and adopt a comprehensive, rights-based national food policy. As experts have suggested, expanding OMS coverage, introducing a universal rationing system, increasing focus on urban areas, and investing in storage and cold-chain logistics—which can reduce food waste—should be immediate priorities. We have made significant progress in agricultural production, but true development will only come when every citizen will have access to safe and nutritious food.\n",
        "headline_1": "Ensure proper access to nutritious food",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/ensure-proper-access-nutritious-food-4012186",
        "news_paper_name": "The Daily Star",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 20, 2025 00:00:00  \nThe classified loans in the country's banking sector have soared to an all-time high of Tk 4.20 trillion as of March 2025, now accounting for 24.13 per cent of total outstanding loans. This staggering volume of Non-Performing Loans (NPLs) and its continued rise are weighing heavily on the financial sector and giving rise to serious concern about the overall state of the economy. In such a situation, one would expect the Artha Rin Adalats, or money loan courts, to take the lead in recovery efforts of this massive amount of defaulted loans by tightening the noose against loan defaulters. Regrettably, however, these courts themselves are limping due to acute manpower shortages, resulting in a huge backlog of cases involving billions of taka. To make matters worse, arrest warrants issued by the money courts against loan defaulters often go unexecuted, leaving both the cases in limbo year after year. \nAgainst this backdrop, the Financial Institutions Division (FID) has recently sought the Home Ministry's intervention to execute arrest warrants in 1,025 long-pending loan default cases accounting for huge sums of money, according to a Financial Express report. These cases were filed by eight departments and agencies under the FID, but due to the non-enforcement of the arrest warrants, recovery of default loans is delayed. The move is part of the FID's special drive to settle the top 100 cases involving state-owned banks, insurance companies, financial institutions and regulatory bodies, amounting together to around Tk 380 billion. However, this figure only represents the top 100 cases filed by government banks and agencies. The enormity of the backlog in money loan courts is evident from a report by the Task Force on Economic Reforms, which stated earlier this year that as of February 2024, more than Tk 1.78 trillion was held up in over 72,500 cases pending in money courts. The report identified the huge backlog under the Money Loan Court Act and the Bankruptcy Act as a major obstacle to loan recovery. Structural flaws in the Money Loan Court Act 2003, a low judge-to-population ratio and insufficient courtroom facilities continue to hinder the timely resolution of NPL-related cases.\nFor the money loan courts to function effectively, necessary reforms must be implemented urgently. First, the number of courts should be increased, more judges need to be appointed and the regular presence of judges and staff must be ensured. Moreover, a specific time frame for the disposal of such cases should be introduced. The enforcement of court-issued warrants must also be ensured. It is both surprising and concerning that the Finance Division has to seek Home Ministry intervention to execute judicial warrants. Given the gravity of the default loan crisis, law enforcement agencies must take prompt and coordinated action in this regard.\nThen, the Artha Rin Adalat Ain itself requires reform to make the recovery process more efficient. Loan defaulters often exploit loopholes in the law to delay repayment. It has been observed time and again that defaulters obtain stay orders from higher courts against money loan court verdicts only to keep the cases suspended for years. Experts have suggested introducing a provision requiring borrowers to deposit a certain portion of their total loan amount before filing a writ petition against the orders of the money loan courts. Such a measure could help deter abuse of the legal process and strengthen the culture of repayment. The economy cannot afford to carry the burden of mounting defaulted loans any longer. Enhancing the effectiveness of the money loan courts and plugging loopholes in legal framework are of paramount importance to restore discipline and trust in the banking sector.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Making money loan court effective",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/making-money-loan-court-effective-1760884472",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       October 20, 2025 00:00:00  \nThe government has been encouraging people to conduct financial transactions digitally using debit and credit cards, mobile financial service(MFS), mobile wallet, etc., and thus fast move towards a cashless economy. Still, the use of cash is showing no sign of declining in Bangladesh. At a discussion event titled 'Cashless Summit 2025', Debapriya Bhattacharya of the local think tank, Centre for Policy Dialogue (CPD), in a keynote highlighted the advantages of a cashless economy. The advantages include, for instance, increase in efficiency, bringing informal economic activities into the formal sector (recognition and regulation of those by the government), making financial services accessible to more people and businesses, reducing cost of transactions and improving connectivity with the global economy.\nIn fact, digital financial transaction was introduced though Mobile Financial Service (MFS) in the country first in 2011. The Bangladesh Bank (BB), provided the framework under which banks and non-bank financial institutions began to offer these services. Notably, the Dutch-Bangla Bank's 'Rocket' was the first MFS platform, followed by bKash. Others like Nagad also entered the MFS market. But how far have such digital systems of fund transfer could reduce the use of physical currencies like bank notes? The BB Governor, Ahsan H Mansur, who spoke at the discussion informed that even with the increase in digital transactions, the use of cash has been increasing. The digital platforms are used simply as a vehicle to transfer cash. But this goes very much against the spirit of a digital economy, which envisages a falling rate of transactions by cash. Had the people used the digital platforms also to make payments for buying goods and services, paying bills and so on, the use of cash money could be gradually reduced. But reports have it that only 4.5 per cent of such transactions are being done for merchant payments. In 2024, the total number of MFS transactions, according to the presentation made at that discussion event, reached 17.37 trillion, which is about 50 per cent of the country's GDP and, overall, 84 per cent of the banking done digitally (56 per cent of those done online, while 28 per cent through MFS) and 47.8 per cent of the population used MFS wallets. Internet banking usage stood at 44 per cent and card usage at 30 per cent.\n Through certain government initiatives such as using MFS to distribute social security net allowances and scholarships, enabling taxpayers to pay their taxes and the citizens their utility bills digitally, leakages could be reduced and efficiency of such transactions improved significantly. Even so, overall, Bangladesh's digital adoption remains partial and uneven and is marked by overreliance on a handful of platforms like bKash and Nagad and underuse of interoperability systems. Interoperability of digital platforms is about the ability of different systems and applications to send and receive data securely and automatically, share and understand the information being exchanged. In this connection, the BB has meanwhile announced that interoperable fund transfer among banks, MFS and payment service providers (PSPs) would officially start from the next month (on November 1). Obviously, this is a move to reduce dependence on cash and develop a seamless digital payment ecosystem. Users will thus be able to transfer money across digital platforms like bKash, Nagad, Rocket and also between MFS wallets and traditional bank accounts. Notably, all such transactions will be routed through the National Payment Switch Bangladesh (NPSB), which is a centralised electronic platform launched by the BB enabling real time interoperability among the country's banks. Hopefully, this move by the central bank would, to some extent, overcome a critical barrier to a cashless economy. However, alongside this move to establish interoperability among various digital platforms including banks, the government should also take steps to increase digital literacy among the country's workforce, 84.9 per cent of whom are engaged in the informal sector of the economy. Their accessibility to the banking system is also low, which needs to be improved. But all the promises made by the government that it would build a cashless economy will ring hollow so long as the internet service is poor and the power infrastructure remains outdated.\nAgainst such a backdrop, it is not surprising that users still overwhelmingly depend on MFS like bKash and Nagad to transfer only cash, while the banks spend Tk2.6 billion annually for handling cash.\nTo meet customers' demand, the central bank, on its part, is being compelled to print money. As the demand for cash is growing at least by around 10 per cent annually, the central bank has to spend to the tune of Tk 200 billion to print the cash every year. The economy could be spared this humongous extra cost, if the volume of cashless transactions could be increased.\nHowever, these are but the expectations of those who, including the government, want a faster transition to a cash-free society. But to reach that end the challenges have to be understood and overcome. The perception that the people who have low level of digital literacy are the main barrier to rapid transition to cashless economy is wrong. In Bangladesh where black money, rampant corruption and the culture of tax evasion are prevalent among the rich and the educated, one cannot expect that they will ever allow their ill-gotten wealth to become visible. That is because, digital mode of transferring and storing money would make wealth visible to the government, a prospect they would avoid at all costs. According to an IMF report of 2015, the size of Bangladesh's shadow economy was equivalent to Tk4,532.71 billion. Undoubtedly, that is a colossal amount compared to the size of the entire economy a decade back. With the increase of the size of the visible economy increasing, the invisible part, too, has increased manifolds during the past 10 years. Without concrete steps from the successive governments to address the issue, the wealth of the rich remains mostly beyond the reach of digital modes of transaction. As a result, the government will continue to print more cash money to meet the demand of both the black and mainstream market. But there is also the need to increase the common people's trust in the digital platforms at present conducting their business. To this end, the MFS need to reduce their service charges, which, according to a study by the Transparency International, Bangladesh (TIB), is 7.0 to 15 times higher than that of the commercial banks. There are also reports of money laundering, transaction of bribe, online gambling and cryptocurrency transactions using MFS. These digital platforms need also to come clean on such allegations to win public trust so their business could further be expanded.\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Barriers to a cashless economy",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/barriers-to-a-cashless-economy-1760884557",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Neil Ray   |  \n       October 20, 2025 00:00:00  \nRain was the pretext for green chilli hitting the Tk 400 a kilo mark. Other vegetables, except green papya, did not lag far behind to the consternation of consumers. Now after the rain has been replaced by sunny days, eggs have suddenly registered a price hike of Tk 10 for a dozen from Tk 140 to Tk150. All kinds of chicken including broiler have been pricier by Tk 10-15 within a week. Vegetable prices show no sign of a letup with the majority of those selling at Tk 60-80 and few crossing the Tk100 mark. With such price escalations, there is no indication of inflation coming down to the relief of at least some of the general consumers. \nThe inflation rate rose to 8.36 per cent from the previous month's 8.29 per cent, claimed to be a three-year low. In fact, the statistical jugglery hardly represents the ground reality. The 8.29 per cent rate of inflation in August last is suspect. Prices of essentials including the staple did not fall. Only potato price plummeted and that cannot account for the drastic fall of the double-digit inflation at 10.87 in October 2024. Rice, cooking oil, vegetables, eggs and meat did not record any decline in prices. The conclusion drawn on the rise in September inflation is simply ludicrous. Higher prices of food and non-alcoholic beverages have been blamed for the inflationary upturn last month. Food price is a dominant indicator but non-alcoholic beverages can hardly match out-of-pocket medical or educational expenses. \nWell, there is no evidence of food prices relenting over the past few months. Even price rise of rice in peak harvesting period could not be explained by common knowledge and expert opinions. Although the staple prices have remained at the same level of last month, at the end of October, the inflation should be higher than that of the previous month. Prices of the more basic items for sustenance of life have been on a higher trajectory for long. The reality at the grass-roots level is harsher than the statistical data can present. Irrational price rise is not a one-off affair, it is routine in this country. Business syndicates are so strong that they feel free to unilaterally raise prices with scant regard for the government or consumers.\nThe unilateral price rise of cooking oil is an example of how business coteries defy the government. Here is a commodity that is simply refined from its crude form to edible composition. For their contribution they are assured of a margin of profit. Now the question is, what profit margin should be acceptable to the stakeholders. \nThe refiners of soybean and palm oil and the government find themselves at logger-heads over the unilateral price increase by the former. When the ministry of commerce made its dissatisfaction known, the refiners stopped marketing oil at higher prices. This is a ploy to arm-twist the government to realise their demands. The supply-line disruption in a monopolistic market can prove to be an effective weapon for businesses. But making a commodity costlier than it should have been has become a norm here. This government has acquiesced to such pressures all through its short tenure like the immediate past fallen regime. This time the government seems not to be particularly pleased with the refiners' move to the price increases of Tk6.0 and Tk13 for a litre of soybean oil and palm oil respectively. \nSuch abnormal price increases stoke inflation and hit not only the poor and marginal segments but also lower middle and middle-income people in society. The deliberate disruption of supply to the market certainly creates panic among consumers and pressure on the government. This has put the government to test. Can it hold its ground and thwart the ploy in the interest of the general consumers? Artificial price increases have ever remained a bane for this country and the refiners must not be allowed the manipulative space. Inflation can be tamed if the business syndicates are dismantled in favour of a competitive market.\nnilratanhalder2000@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Market volatility beyond demand-supply rules",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/market-volatility-beyond-demand-supply-rules-1760884595",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-10-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       October 20, 2025 00:00:00  \n\nThe recruitment process of faculty members in public universities across Bangladesh remains one of the most pressing issues undermining the quality of higher education. Despite over fifty years of independence and a substantial education budget, our universities continue to lag behind in producing competent educators and world-class researchers.\nOne of the core problems lies in the flawed recruitment system, where political loyalty often outweighs academic merit. Instead of prioritising teaching excellence and research capability, faculty hiring is frequently influenced by party affiliation, lobbying, and minimal assessment criteria. This has severely compromised transparency, accountability, and innovation in higher education.\nGlobally, university recruitment is rigorous and merit-based, involving multiple evaluation steps such as written tests, demo classes and research presentations. In contrast, recruitment in Bangladesh often bypasses these essential steps and emphasises GPA cutoffs that are more suited to student admissions than faculty appointments. Moreover, academic promotions and opportunities are often dictated by political engagement rather than scholarly contribution.\nThis political entanglement not only deters talented educators but also diverts attention from research and academic development. As a result, universities fail to produce notable innovations or internationally recognised scholars. Even prestigious institutions like Dhaka University have yet to make significant breakthroughs in science, technology or medicine after Satyendra Nath Bose, theoretical physicist and mathematician.\nEstablishing a University Faculty Recruitment Commission could ensure a standardised, merit-based recruitment process that includes transparent evaluation of research and teaching competencies. Only by removing political influence and enforcing fair, rigorous hiring practices can our universities cultivate genuine scholars and researchers.\nWithout such reforms, no amount of budgetary allocation will bring improvement. Labs will remain underutilised, innovation will stall and our universities will continue to produce \"voters\" instead of visionaries. For Bangladesh to progress, academia must be freed from partisan control and reoriented toward excellence.\nMd. Helal Mia\nStudent\nDepartment of Management Information Systems\nBegum Rokeya University, Rangpur\nmdhelalmiabrur@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fix recruitment system at universities",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fix-recruitment-system-at-universities-1760884617",
        "news_paper_name": "The Financial Express",
        "publish_date": "20-10-2025"
    }
]