[
    {
        "full_article": "The first hull loss of the ‘Dreamliner’, one of aviation’s most advanced twin-aisle aircraft, is one that is unsettling, more so when there have been recent examples of survivability in modern widebody jets. The tragic end to Air India flight AI171, on June 12, 2025 — there was one surviving passenger — just minutes after its liftoff from Ahmedabad for London Gatwick, and it touched a recorded barometric altitude of 625 feet, will be under much global scrutiny. That the crew were faced with a sudden and sharp turn of events on the 11-plus-year-old Boeing 787-8, a plane with ample avionics redundancy, and reliable twin engines — the GEnx-1B67, rated at 67,000 lbs of thrust each — has led to much speculation about the cause. Experts have suggested reasons such as issues with load planning, ambient air temperature and engine performance, wing surface settings, and even a bird hit. Inducted by Air India during its government-owned days, as part of a 68-aircraft deal signed with Boeing in 2006, the subfleet of 787-8s has played a role in its medium to long-haul network expansion to Europe, the Far East and Australia. The plane’s global safety record has been strong in general, but it has also been an aircraft type that has raised some concerns. These have included assembly-line quality control, ‘whistle-blower’ statements, engine icing problems that resulted in a safety directive, a lithium aerospace battery-related electrical system issue that led to extensive world-wide groundings, an emergency locator transmitter battery fire that caused heat damage, and, in 2024, an in-flight upset that was linked to a feature in the flight deck crew seat.All eyes will be on how the airline’s new owner, Tata Sons (with a 25.1% shareholding by Singapore Airlines Limited), steers its operations and addresses safety concerns after an ‘unprecedented’ four-airline merger. The group is in the middle of executing Vihaan.AI, the airline’s ‘transformational roadmap over five years’, with the appointment of a ‘head of group safety, security and quality’ integral to this. In parallel, the airline has also faced scrutiny by India’s civil aviation regulatory body, the Directorate General of Civil Aviation. With a formal investigation, that includes international participation, having been initiated, in keeping with aviation protocols, the complexities that a first-time 787 crash analysis could throw up should be ironed out. At the 81st International Air Transport Association annual general meeting and World Air Transport Summit in New Delhi last week, India was recognised to be one of the largest aviation markets. However, its rapidly expanding aviation sector needs to address the challenges, which include safety, on the ground and in the air. Published - June 14, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Airlines\n                    \n                            /                      \n                        \n                        air transport\n                    \n                            /                      \n                        \n                        air and space accident\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        Ahmedabad plane crash 2025\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Singapore\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        Europe\n                    \n                            /                      \n                        \n                        aviation safety\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        New Delhi",
        "headline_1": "Crash and burn: On the Air India Ahmedabad plane crash and Indian aviation",
        "headline_2": "India’s aviation sector needs to address safety concerns",
        "link": "https://www.thehindu.com/opinion/editorial/crash-and-burn-on-the-ahmedabad-crash-indian-aviation/article69691403.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "Israel’s strikes on Iran’s nuclear facilities, at a time when Washington and Tehran were in talks, are brazenly illegal, reckless and dangerous. If there was any possibility of resolving the nuclear issue through dialogue, Israel has practically killed it. That Donald Trump, despite his repeated warnings, failed to stop America’s closest ally from launching the attacks — threatening his own diplomatic push — suggests that the U.S. President was either not serious about his words or had limited influence. Israel’s overnight attack targeted the Natanz nuclear enrichment facility, ballistic missile factories and the residences of Iran’s top nuclear scientists and military chain of command. In retaliation, Iran launched a drone attack, with most shot down. Supreme Leader Ayatollah Khamenei has promised a harsh response. If Iran launches ballistic missiles, which seems likely, Israel would carry out more attacks, as Prime Minister Benjamin Netanyahu has indicated. So what possibly awaits West Asia are prolonged attacks and counterattacks, with potential regional spillover effects.There are legitimate concerns about Iran’s nuclear programme. It has enriched uranium to 60% purity, way above the grade for civilian purposes. Israel says Iran was making attempts to build a bomb in secret. While the IAEA says Iran has enough highly enriched uranium to make bombs, there is no conclusive evidence to suggest that Iran has moved in this direction. Tehran once agreed to scuttle its nuclear programme in return for the lifting of sanctions as part of the multilateral agreement in 2015, but it was Mr. Trump who sabotaged the agreement. And when Mr. Trump, in his second term, offered dialogue, the Iranians seized it. But what Iran got instead was an attack on its nuclear plants. Israel did this as it knew it could get away with any form of aggression, thanks to the U.S.’s military, political and diplomatic support. Israel has behaved like a rogue nation ever since the October 7 attack by Hamas. It is facing allegations of committing genocide after its destruction in Gaza that has killed over 54,000 Palestinians. It routinely bombs Lebanon despite a ceasefire with Hezbollah. It has carved up more territories in Syria after the collapse of the Assad regime. And now, by attacking Iran, Tel Aviv has pushed West Asia into a deeper security abyss. Israel’s unchecked militarism is closing the space for diplomacy in a tumultuous region. If the conflict spills over into the Gulf waters and kingdoms, it would be catastrophic for the global economy, especially for India whose millions of citizens work and live in the region. There must be an immediate, coordinated international effort to rein in the Jewish state and reboot diplomacy to restore stability in West Asia. Published - June 14, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Israel\n                    \n                            /                      \n                        \n                        Iran\n                    \n                            /                      \n                        \n                        nuclear policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        missile systems\n                    \n                            /                      \n                        \n                        technology (general)\n                    \n                            /                      \n                        \n                        economic sanction\n                    \n                            /                      \n                        \n                        Israel-Palestine Conflict\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        Syria\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        security measures",
        "headline_1": "​Rogue nation: On Israel’s Iran strikes",
        "headline_2": "Israel has pushed West Asia into a security abyss",
        "link": "https://www.thehindu.com/opinion/editorial/rogue-nation-on-israels-iran-strikes/article69691339.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "We all need privacy – to misspeak, to err, to be intimate\nTo hold one opinion but voice another, is this inauthentic? To conduct oneself as if one is being permanently surveilled, does that help democratic life? In her book Strangers and Intimates: The Rise and Fall of Private Life, British sociologist Tiffany Jenkins traverses centuries, to explain how the private and the public developed into two distinct realms, and how this historic achievement is now in mortal danger. \nSpark of conscience | From the Protestant iconoclasm of Martin Luther to the extensive adventurism of Henry VIII, the 16th century germinated the independence of ‘inward things’ from traditional authority. Hobbes’s 1651 magnum opus Leviathan presented hypocrisy – the gap between public utterance and private belief – as key to protecting the social order from anarchy. The 1650 Toleration Act passed by Cromwell’s parliament made strides towards making religion a private matter. \nAge of separations | The first modern biography, Boswell’s Life of Samuel Johnson (1791), the first modern autobiography, Rousseau’s Confessions (1782), the first novel, Richardson’s Pamela (1740), literacy rate for men in London approaching 80%, it was all of a piece with thinking for oneself. Simultaneous to the strengthening private sphere, was the rise of public life. Coffee houses were popping up everywhere. These were a male space, like the Atheninan agora. Male and female roles became sharply different. A woman effectively became her husband’s property when she married.\nIn 1801 the first census rolled out after an acrimonious five-decade resistance that it would ‘molest and perplex every single family in the kingdom’. Drawing the line between a public realm open to state intervention and a private domain beyond it became the question of the age.\nAcross the pond, the skepticism that met govt-led research was belied by the enthusiasm that met George Gallup, who founded his polling company in 1935. Americans liked answering questions about themselves and reading the results. As Kinsey discovered, they were also more than ready to share their sex ‘histories’. Bernays’ Propaganda (1928) proposed ‘the engineering of consent’, whereby these masses could be controlled by an ‘invisible’ govt, with insights from psychology and natural science. \nThe personal is the political | This was Betty Friedan, Kate Millett and other second-wave feminists’ counter to the ‘interior colonisation’ of women. But politicising the private sphere also meant depoliticising the public sphere. Redirecting scrutiny from social and economic structures of society to personal relationships placed an intolerable burden on everyone involved in such political practice, the book argues.\nRelatedly, Ruth Bader Ginsburg’s criticism of the Roe vs Wade ruling was that abortion rights should not be a privacy issue but a matter of equal rights. Either way, the public-private separation forged in the 18th century weakened by the end of the 1970s. \nLet’s talk about sex | Monica Lewinsky’s was the first massive news story to break online. The Kenneth Starr report was accessed by 20mn Americans within 48 hours of its release. Fast forward to the normalisation of Pornhub and OnlyFans as examples of ‘creator economy’. \nBy now, threats to privacy are almost exclusively framed in terms of data and digital security. But, the book underlines, the protection of individual privacy ultimately depends on a clear boundary between private and public domains, which must be defended both online and offline. Strangers are not intimates. Why treat them like that? Protect your inner life instead. \n\n",
        "headline_1": "A closet of one’s own",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/a-closet-of-ones-own/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "Iran is weak. Even then, oil price, trade routes are at risk\nIsrael’s stunning strikes on Iran put West Asia back on the edge. These strikes were deep into Iran, hitting nuclear facilities and ballistic missile sites, and heads of its armed forces and IRGC were taken out. Tehran has vowed harsh response, but its options may be constrained today. Israel already battered its Lebanese proxy Hezbollah last year and brought on the downfall of the pro-Tehran Assad regime in Syria. Plus, Israel claims that the latest strikes involved a covert Mossad cell that operated from within Iran to take out Iranian air defence and ballistic missile launchers. This would mean Tehran’s counter-intelligence network has failed on multiple fronts.\nMeanwhile, Trump appears to be threatening more Israeli military action against Iran if Tehran doesn’t do a fresh deal with Washington on its nuclear programme. US and Iran have been engaging in talks over the matter. But Washington’s position that Tehran abandon its nuclear programme hasn’t cut ice with the Iranian regime. But if the strikes were meant to be a harsh message to the Ayatollahs, they may end up having the opposite effect – Tehran could accelerate a nuclear weapons programme and quit NPT. That in turn would increase tensions with the Gulf Arab states, and the Saudis may push their case for a nuclear programme.\nThe impact of all this on energy prices could be acute. Price of crude has already leapt by 9% and could head further north. Supply chains may again take a hit given important sea lanes in the region. Not to forget undersea cables that could be targeted or weaponised. For India too things get complicated. Iran provides our potential alternative trade route to Afghanistan via Chabahar port. The same route links up to International North-South Transport Corridor for Central Asia. But prolonged chaos in the region puts all of this under a cloud. An escalatory military conflict between Tel Aviv and Tehran is not in the world’s interest. But Netanyahu, the Ayatollahs and Trump may have other ideas.\n\n",
        "headline_1": "Tel Aviv Thumps Tehran",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/tel-aviv-thumps-tehran/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "Some nations fly off the handle, others get grounded\nThere are no local conflicts in a globalised world. Israel’s strikes on Iran drove home this point again on Friday, as airlines skirted not only the two combatants but also the intervening airspaces of Iraq and Jordan. Syria anyway is a no-fly zone, so airlines rerouted or cancelled a large number of flights, including about 30 cancellations from India.\nWest Asia is a vital air corridor with around 1,400 flights crisscrossing it daily, therefore any disruption here impacts the whole world. Pan eastward, and most of Afghanistan’s airspace is risky. For Indian carriers, Pakistan’s airspace has been closed since late April. Up north, Russia is closed to Western carriers and Ukraine to all. Adventurism is not an option because six planes have been shot down over conflict zones since 2001 – the last one, Azerbaijan Airlines flight J2-8243, in Dec – and three others have had close shaves.\nToday, half the countries on Europe-Asia routes need regular reviews. So, flying has become a game of chess requiring daily strategising. Who bears the cost? Everyone. Air India says a year of Pakistani airspace closure would cost it an additional $600mn. Just flying around Pakistan adds 913km to Delhi-Amsterdam. The time to fly Delhi-Tashkent doubles. Longer routes mean extra fuel and overtime costs. Planes can carry less cargo. For airlines, all this can cost up to $12,000 per hour – and that reflects on your ticket.\n\n",
        "headline_1": "Fight & Flight",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/fight-flight/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "It’s looking like chaos in Los Angeles, with aggressive immigration raids and the resulting protests. It’s also telling us a great deal about Trump’s strategy going forward, to quell dissent against his unpopular policies. The most telling moment of the past few days wasn’t the ICE raids themselves, or the (probably illegal) nationalisation of the California National Guard, or the (almost certainly illegal) mobilisation of US troops, but rather the relatively low-key arrest of labour union leader David Huerta.\nHuerta is the head of the California branch of the Service Employees International Union, one of the biggestunions in North America. SEIU has about 2mn members, most of them healthcare workers, though it also represents maintenance workers like janitors, many of whom are undocumented immigrants.\nRead full story on TOI+\n\n",
        "headline_1": "It’s chaos in Los Angeles and it’s Trump’s plan",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/its-chaos-in-los-angeles-and-its-trumps-plan/",
        "news_paper_name": "The Times of India",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "We are shocked and saddened by the devastating crash of an Air India plane that went down moments after taking off from Ahmedabad, Gujarat on Thursday, in what is now the world's worst aviation disaster in a decade. Our deepest condolences go out to the families and loved ones of the victims. Air India confirmed on Friday that all but one of the 230 passengers and 12 crew members on board were killed. Among the dead were also eight local residents, including four medical students, as the aircraft—a Boeing 787-8 Dreamliner—crashed into the residential quarters of a medical college in the area. The death toll may rise further as more details emerge.\nIndia's Aircraft Accident Investigation Bureau (AAIB) is presently probing into what caused the crash, which could take some time, as such investigations involve multiple factors. Preliminary theories suggest that dual engine failure, bird strikes, or mechanical malfunction could be possible factors, with the aircraft failing to gain enough thrust after takeoff. After analysing footage of its crash, aerospace safety experts noted that the plane's landing gear was down at a phase of flight when it would typically be up, an anomaly that may have contributed to the loss of power. However, data from the black box, which was later recovered, can provide definitive answers.\nThis tragedy must serve as a wake-up call for those in the aviation industry, including in Bangladesh. The crash has shown what can happen if safety protocols are compromised—a reality that Bangladesh, with its own history of aviation safety concerns and irregularities, can ill-afford to ignore. Major stakeholders, including the Civil Aviation Authority of Bangladesh (CAAB) and Biman Bangladesh Airlines, the national flag carrier, have long faced criticism for repeated incidents of negligence and corruption. Only recently, we were alarmed to learn of an investigation from CAAB itself that uncovered numerous irregularities in pilot licensing and training programmes. These included serious breaches such as flying schools recommending pilot licences without students completing mandatory solo flight hours, falsification of flight records, and the use of unauthorised software in written tests. Shockingly, one pilot even certified himself. Despite being aware of such practices, CAAB has failed to take action.\nUnless these systemic and deep-rooted issues are addressed, Bangladesh's aviation sector will remain vulnerable to the kind of tragedy we mourn today. The lesson here is clear: aviation safety must never be taken lightly. From airworthiness of aircraft to pilot qualifications, from pre-flight inspections to regulatory vigilance—every step must be treated with utmost seriousness. We urge aviation regulators and airline/airport operators in Bangladesh to reassess their standards and practices. If a disaster can happen to a major carrier like Air India, how confident can we be about averting a similar tragedy?\n",
        "headline_1": "Air India tragedy a wake-up call for aviation authorities",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/air-india-tragedy-wake-call-aviation-authorities-3916431",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "On May 24, I had the pleasure of travelling to China to meet a delegation of over 20 members from across South Asia, as well as representatives of the Chinese Communist Party (CPC). The seven-day trip, during which CPC representatives held dialogues with political parties from South Asia, as well as members of academia, think tanks, and the media, proved to be a truly enlightening experience.\nOur first stop was Beijing, and what was particularly noticeable from the outset was the warmth and graciousness of our hosts. The delegation from Bangladesh was greeted at the airport—and later at the hotel—by several CPC members, who also welcomed delegates from across South Asia and accompanied us throughout the entire visit.\nOur stay in Beijing involved visits to various places in an effort to experience Chinese culture first-hand. It was evident that, for the Chinese, their culture forms the foundational pillar of their identity and aspirations.\nDuring our time in the city, we also had the pleasure of attending a large-scale dialogue that included senior representatives from Southeast Asian and Central Asian countries. At that event, the enthusiasm of all stakeholders regarding the Chinese-led Belt and Road Initiative (BRI) was visible. It was also evident how much progress had been made in terms of connecting China with Southeast Asia, as well as in improving connectivity among the Southeast Asian countries themselves.\nUnfortunately, perhaps due largely to intra-regional conflict, it was equally clear how far South Asia has fallen behind in this regard. Representatives from Central Asian countries spoke of how China's technological prowess has been harnessed to extract their significant natural resource reserves. Once again, it was clear that South Asian countries are lagging far behind in their ability to make effective use of their own resources.\nA recurring theme throughout many of the dialogues was that much of this stagnation appears to stem from the quality of leadership that South Asia has experienced over the decades. China, on the other hand, according to our gracious hosts, has worked extensively to improve the calibre of its leadership and to address corruption. One interesting story that was shared with us involved a member of the CPC who was photographed smiling at an accident site. His apparent insensitivity during a tragedy raised concerns among the Chinese leadership, who also noticed that he had been photographed wearing new and expensive watches at various events—watches that were beyond his pay grade. This led to a deeper investigation, which ultimately found that the individual had been involved in corruption.\n\nAs the world navigates increasing chaos and uncertainty, perhaps we are better off working together. As I mentioned earlier, the Chinese people take great pride in their civilisation, which spans thousands of years. And they also believe that Asian civilisations, in general, share a common history of peace and a tradition of pursuing mutually beneficial, win-win cooperation. There has been much talk about the 21st century being the \"Asian century,\" and during our visit to China, it became obvious that Asia, as a whole, possesses all the components needed for shared success. \nThere were more such stories shared with us. We were informed that in China, every government department has its own \"discipline committee,\" which reports to a central authority. Not only are government officials expected to refrain from corruption in order to keep their positions, but they are also expected to demonstrate other good disciplinary habits, including humility and a willingness to serve the public.\nNaturally, the practice of good discipline and the effort to establish an educated and merit-based society have contributed to the rapid pace of China's development. While in the West it is evident that most countries developed 50 to 100 years ago, China's development has occurred largely in the past 30 to 40 years.\nAt the same time—whether it is infrastructure, environmental protection, poverty eradication, or the extremely impressive technological strides they have made—China's development is remarkable by any metric. In the area of technology in particular, the progress China has made is astonishing. From the development of self-driving cars to robotics and the generation of renewable energy, the country has become one of the hotspots for global technological innovation.\nOur next stop was Kunming City in Yunnan Province, which is among the most beautiful places I have ever visited. But beyond its natural beauty, the city has been transformed into a gateway for connectivity between China and many of its neighbours. Again, during the dialogues held there, it became obvious that—from train tracks to highways—China has rapidly connected with Southeast Asia through Yunnan Province. And despite massive potential, activity along that front with South Asia remains somewhat slow, if not stagnant.\nHowever, speaking with other South Asian delegates, it also became clear that people across South Asia are increasingly realising how far they are being left behind in a world that is rapidly moving forward. And China is a perfect example. Its cooperation with Southeast Asian countries has led to win-win outcomes for all parties. Having witnessed the fruits of that cooperation, others are increasingly eager to join in.\nThis week-long trip was not only a wonderful experience of witnessing China's rapid development and impressive achievements, but it also gave us insight into how it has sustained its success—through dialogue, sharing, and getting to know and understand one another: where we agree, where we disagree; where we can work together, and where we are better off on our own.\nFor the most part, as the world navigates increasing chaos and uncertainty, perhaps we are better off working together. As I mentioned earlier, the Chinese people take great pride in their civilisation, which spans thousands of years. And they also believe that Asian civilisations, in general, share a common history of peace and a tradition of pursuing mutually beneficial, win-win cooperation.\nThere has been much talk about the 21st century being the \"Asian century,\" and during our visit to China, it became obvious that Asia, as a whole, possesses all the components needed for shared success. The only questions that remain are: i) do we have the visionary leadership needed to imagine Asia at the forefront of shaping the global order?; and ii) can we set aside our petty emotions and egos, and finally work together for the common good?\nEresh Omar Jamal is head of the editorial team at The Daily Star. His X handle is @EreshOmarJamal.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "What South Asia can learn from China’s development journey",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/the-overton-window/news/what-south-asia-can-learn-chinas-development-journey-3915961",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "It is unacceptable that seven months after the resignation of its chairperson and members, the National Human Rights Commission (NHRC) still remains leaderless, powerless, and largely ineffective. This situation might have been expected during Awami League's 15-year rule when it functioned as little more than a silent spectator to the regime's persistent human rights violations. And that should have changed following its ouster through the July uprising. Unfortunately, the interim government—which has frequently expressed its commitment to upholding human rights—has made little, if any, progress in reforming and empowering the NHRC despite having been in power for over 10 months.\nEstablished in 2009, the commission was intended to align with the 1993 Paris Principles and function as an independent human rights watchdog. These principles require such institutions to be autonomous, well-resourced, and capable of investigating all rights violations, including those committed by state actors. However, since its inception, the NHRC has been widely criticised as a \"toothless body\", and for good reason.\nBy law, it cannot investigate law enforcement agencies or intervene in cases pending before the courts or the ombudsman, effectively excluding it from many of the country's most serious human rights cases. Additionally, under Sections 6 and 7 of the NHRC Act, the president appoints its chairperson and members based on recommendations from a selection committee largely composed of ruling party allies. According to rights advocates, this violates the Paris Principles, which emphasise that minimising political interference is essential to a rights watchdog's credibility. Moreover, unless the commission is capable of holding state actors accountable—which the NHRC is not, by design and by statute—its very existence becomes symbolic, offering neither meaningful protection for victims nor deterrence against future violations.\nAnother significant concern is the NHRC's funding. Reportedly, only 25 percent of its budget comes from the state, while 75 percent is provided by international development partners. For such an important human rights body, there must be a designated budget that ensures both its efficiency and its operational independence.\nOn top of these pre-existing structural issues, the interim government's failure over the past seven months to reconstitute the commission has left it limited to receiving complaints and carrying out routine administrative tasks only. This is deeply unfortunate, and totally unacceptable. In a way, the continued plight of the NHRC resembles that of the National River Conservation Commission (NRCC). For years, critics argued that the NRCC was deliberately kept weak—not only in terms of legal and executive authority but also in terms of budget, resources, and administrative power. Since the change in government, it too has remained virtually non-functional. Such dysfunctions benefitted rights and rivers violators in the past, and they continue to do so now.\nFor a government charged with leading the state reform drive, it is difficult to understand why it has failed not only to make these commissions functional but also to reform their structures and introduce meaningful change in their governance. It is high time the government changed its course.\n",
        "headline_1": "We need a truly independent, effective rights watchdog",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/we-need-truly-independent-effective-rights-watchdog-3915941",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "With the Rohingya crisis in Myanmar showing no signs of ending and the repatriation process in Bangladesh at a standstill, it is concerning that only 19 percent of the fund required for Rohingya refugees this year has been secured even after the passing of five months. Reportedly, a total of $934 million is needed to support 1.5 million people—1.2 million Rohingya and 300,000 members of the host community—but only $180 million has been received.\n\nThis gap, largely due to the suspension of US funding, will further strain conditions in the camps, making it harder for the refugees to access essential services such as education and healthcare. Dozens of projects, including those related to health, family planning, nutrition, and education, have already been affected by the cuts. Humanitarian organisations warn that the situation will further deteriorate unless funds are urgently released.\n\nAn example of the refugees' shrinking access to healthcare is that the number of general patients seeking treatment in camps dropped from 372,000 in February to 205,000 in April. Many are having to pay for doctors themselves in serious cases, which is not possible for everyone. The funding cut has also severely impacted education, putting the future of 230,000 Rohingya children in Cox's Bazar—and the livelihoods of hundreds of terminated teachers from the host community—at risk. Since these learning centres also serve as protection spaces for the children, their closure poses serious safety risks.\n\nMoreover, the scarcity of shelter has worsened with the onset of the monsoon rains, which have already damaged many homes. It has become extremely difficult to provide shelter and basic services to the 150,000 Rohingya people who have fled to Bangladesh in recent months. According to a WFP update, 50,000 more may arrive by the end of the year, raising further concerns. Without access to basic services, refugees may flee the camps and embark on risky journeys to foreign lands in desperation. Criminal activities in and around the camps may also increase, and gender-based violence could rise, leaving victims without support or psychological counselling.\n\nAccording to a UN official, there is only enough food to support the Rohingya until October, which is deeply alarming. Access to food, education, and healthcare is a fundamental human right and must not be denied. We urge the international community not to forget the plight of the Rohingya and to come forward with aid. The interim government, led by Professor Yunus, must leverage its capacity to secure necessary assistance from global sources. Additionally, the authorities must ensure that all aid received is utilised efficiently and without waste.\n",
        "headline_1": "A humanitarian crisis worsened by fund crunch",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/humanitarian-crisis-worsened-fund-crunch-3914326",
        "news_paper_name": "The Daily Star",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 14, 2025 00:00:00  \nThe urgency of framing a law to safeguard farmlands from being irreversibly reduced in size due to natural causes such as river erosion as well as human actions triggering climate change cannot be overstated. Efforts to this end have been made by the land ministryin the past, for instance, in the form of a draft proposal, namely, the 'Land Ownership and Uses Act' , which would limit the ownership of non-agricultural land to 40 bighas (1 bigha = 33 decimals). The aim of the proposed Act was to protect agricultural land. Similar laws such as the Agricultural Land Protection and Land Zoning Act 2010 and Agricultural Land Protection and Usage Act 2016 were introduced in the past. Notably, those laws were updated and revised over time. \nThe High Court, too, in April 2024, recommended passing the private bill (originally tabled in parliament in March 2022) that sought steps in 2016 towards appropriate use and conservation of agricultural land. Side by side with the moves to frame laws to conserve arable land, experts also emphasised proper land management to address environmental issues and control commercial farming, particularly tobacco cultivation and shrimp culture that lead to land degradation and decline in crop yield. Concerns have been expressed during the past decades over the progressive decline in the quantity of available farmlands in the country. Meanwhile, the amount of cultivable land has been shrinking due to its transfer to non-agricultural sectors including road building, operating brick fields, housing and industrial estates. According to a Bangladesh Agricultural Research Council (BARC) document, between 1976 and 2021, i.e. in 45 years, Bangladesh lost 1.048 million hectares of land to non-agricultural use. In a similar vein, according to the Ministry of Agriculture, country's total amount of agricultural land, as of 2023, stood at 8.829 million hectares. \nIn a land-scarce country like Bangladesh, loss of arable land to non-farm use is no doubt a bad news for food security. Even so, production of staple crops, especially rice has about quadrupled from 10 million tonnes in 1972-73 to 39 million tonnes recently, thanks to the use of high-yielding varieties of seeds, better inputs including irrigation, fertilisers, pesticides and more efficient land use and cropping practice. But one cannot at the same time lose sight of the fact that it has all come at a cost. Because, in absence of additional fallow land, the same land is being used repeatedly to produce multiple crops. Though the application of chemical fertilizers and pesticides has helped achieve higher yields of crops, the quality of soil has been diminishing irreparably. All the scientific agricultural practices have so far contributed to breaking past record of crop yields, but the hard facts are that limited amount of land, which, again, is diminishing without a pause, cannot guarantee food security for an ever-growing size of population for a long time. \nAgainst this not-so-reassuring background, the interim government is learnt to have promised to accelerate efforts to frame a law to protect agricultural land as well as the interests of farmers. In this connection, the Home and Agriculture Adviser, Md Jahangir Alam Chowdhury during a press briefing recently has reiterated the interim government's determination to soon enact a suitable law. It is believed the incumbent administration would be up to its promise and fast track its plan to enact the law to protect agricultural lands, since its tenure in office is short.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Legal measures to conserve farmlands",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/legal-measures-to-conserve-farmlands-1749830677",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       June 14, 2025 00:00:00  \n\nThe proposed national budget for the 2025-26 fiscal year is shaped by a strong resolve to tackle the long-standing and urgent problem of inflation. Although numerous aspects of the budget adhere to established trends, there is a clear trend towards contractionary policies, which means the government is trying to cut back on expenditure. Set at Tk 7.9 trillion, this budget is Tk 70 billion lower than the original outlay for the current 2024-25 fiscal year. This reflects a rare reversal in the usual pattern of expanding government budgets. Given that this budget was presented by an interim administration, with national elections scheduled for first half of 2026, this approach was perhaps inevitable. The public largely perceives this administration as a caretaker government, responsible only for essential reforms and election preparations. As such, the government has refrained from allocating funds for big-ticket infrastructure projects typically pursued by elected governments. \nA large portion of the budget is driven by a basic fiscal reality in which mandatory expenditures take up most the government's resources. A massive Tk 1.13 trillion has been allocated solely for interest payments on existing debt. This number is almost one-seventh of the entire budget, but the public receives no real benefit from it. With the overall amount of the government's domestic and foreign debt approaching $100 billion, it simply represents the weight of prior borrowings. That means a significant portion of the budget is already spoken for before a single new policy initiative is implemented. The estimated Tk 820 billion in core revenue expenses involving salaries and benefits is another fixed cost. Apparently, the budgetary priorities are wildly out of balance. The amount set aside for interest payments is more than what is to be spent on either education and technology or transport and communication, which are both very important for the long-term economic growth and development. It's no surprise that inflation gets harder to control in a country that spends more on paying off its debt than on building up its people or its assets. \nHowever, the government's allocations in sectors outside these mandatory expenditures show a clear intention to bring inflation under control. This is no easy task for an interim administration, especially at a time when falling foreign exchange reserves and strict IMF loan conditions are creating added pressure. When the interim government took office about ten months ago, inflation was spiraling, reaching 11.66 per cent in July 2024, which is one of the highest rates in recent memory. Since then, the government has managed to marginally ease inflation into 10.89 per cent in December 2024 and further to 9.17 per cent in April 2025. The finance adviser is optimistic that inflation could fall to 8 per cent by the end of the current fiscal year and to 6.5 per cent by the close of FY 2026. However, whether these targets are achievable will depend on a combination of factors. \nOne such factor is the stability of the newly adopted floating exchange rate. Bangladesh switched to this system last month and the exchange rate hasremained stable since then. In the short term, this stability grants the Bangladesh Bank greater control over monetary policy, allowing it to focus on domestic inflation without the burden of defending a fixed exchange rate. However, Bangladesh's economy is heavily import-dependent. If the Taka depreciates significantly, import costs will rise, pushing up prices for essential goods and raw materials. This pass-through impact has potential to reignite inflation. Moreover, a fluctuating exchange rate could create business uncertainty, reduce investor confidence, and instill inflationary expectations in the public's mind. If these risks materialize, the progress made so far in controlling inflation could be undone rapidly. \nAnother critical area is revenue collection. The proposed budget sets an ambitious target of Tk 5.64 trillion in revenue, with Tk 4.99 trillion expected to come via NBR. This goal is equal to roughly 9 per cent of the country's GDP, and is, by most standards, highly optimistic. Historically, Bangladesh has struggled to meet its revenue targets. In FY 2023-24, the highest-ever revenue collection was only Tk 3.82 trillion. Given the current slowdown in economic activity, rising unemployment, and subdued investment climate, it is difficult to see how this year's revenue target will be met without resorting to desperate measures.\nIf revenue collection falls short, as it likely will, the resulting budget deficit will compel the government to borrow more, both domestically and from foreign sources. Domestic borrowing, especially from the banking sector, poses its own inflationary risks. If the government turns to the central bank for financing, it would be tantamount to printing new money, increasing the money supply without a corresponding increase in goods and services. This scenario is a textbook recipe for inflation. Even borrowing from commercial banks could lead to credit expansion, which would further fuel inflationary pressure.\nThe government has so far pursued a contractionary monetary policy, raising the policy interest rate by 150 basis points to 10 per cent. However, there is only so much that monetary tightening can achieve on its own in curbing inflation. When inflation is also fueled by structural inefficiencies, supply chain disruptions, and lax fiscal discipline, monetary policy alone cannot offer a comprehensive solution.\nTo its credit, the budget does make provisions for protecting the most vulnerable segments of society. Food subsidies are set to rise by nearly 20 percent and the number of low-income families receiving food assistance will also grow. These measures are necessary, but they must be implemented efficiently to ensure that relief reaches those who need it most. \nIf the government stays committed to aligning fiscal and monetary policies, stabilizing the exchange rate, boosting production and protecting the livelihoods of low-income groups, there is a genuine possibility of bringing inflation under control. It remains uncertain whether the interim administration will have the time or political inclination to implement these reforms fully, but the groundwork, at the very least, seems to be in place.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Can spending cuts cool inflation?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/can-spending-cuts-cool-inflation-1749830720",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       June 14, 2025 00:00:00  \n\nAfter five and a half decades of independence, the health sector in Bangladesh remains mired in a mix of severe mismanagement, rampant corruption, and insensitivity. Despite making significant advancement in medical infrastructure and human resources, the sector has yet to provide basic medical treatment to millions of people in the country. Public spending on health is also inadequate. The allocation for health as a share of the proposed budget decreased from 5.50 per cent in FY25 to 5.30 per cent in FY26. The allocation for health as a share of gross domestic product (GDP) is also as low as 0.75 per cent in the outgoing FY. Against the backdrop, the Health Sector Reform Commission, formed by the Yunus-led interim government, submitted its report along with a set of recommendations to fix the problems. \nThere are, however, some limitations of the report, especially in portraying the country's medical treatment status. It is disheartening to note that the commission has undermined the role of traditional medicine, on which a large number of people depend. The commission report mentioned that less than 2 per cent of the population availed themselves of treatment using traditional medicine in the last year. In reality, at least one-fourth of the population is heavily dependent on three major types of traditional medicines. These are Homeopathic, Unani and Ayurvedic. There is a growing demand for traditional drugs in the country as well as rest of the world.\nThe use of traditional medicine has been integrated into this region for more than 3,000 years. South Asia itself is a global hub of such medicine, also known as ancient Indian medicine, specifically Ayurveda. It is a holistic system of medicine that began in this region. Ayurveda means the study of life and takes a natural approach to all aspects of health and well-being. Again, the Unani System of Medicine, one of the world's oldest healthcare systems, is also popular in South Asia. Originating in Greece (Yunan), Arabs and Persians significantly developed the system during the medieval age. The system was later adopted in India and continues to coexist with Ayurveda. \nIt's important to dispel the misperception that Ayurvedic medicine is exclusively for Hindus and Unani for Muslims. While it's true that Muslims have made significant contributions to the development and use of Unani medicines, it's equally important to note that some Unani medicine practitioners are non-Muslims. Similarly, the number of Muslim Ayurvedic medicine practitioners is not insignificant. This diversity in the practitioners of traditional medicine, with both Hindus and Muslims widely using Homeopathic medicines in Bangladesh, underscores the inclusive nature of these healthcare systems. \nBy ignoring the role of traditional medicines, the Health Sector Reform Commission has made a major mistake. The commission's approach to traditional medicines and its practitioners also sends a wrong message to society. Traditional medicine practitioners are not quacks, as the former are recognised under the Bangladesh Unani and Ayurvedic Practitioners Ordinance, 1983. In 2011, the health ministry developed an Operational Plan for Alternative Medical Care to provide Unani, Ayurvedic & Homeopathic Medical services 'throughout the country along with the Allopathic treatment to ensure quality & equitable health care for all citizens of Bangladesh.' Several Unani, Ayurvedic, and Homoeopathic colleges are in operation in the country for decades to provide essential education, training, and skills in traditional medicine. At present, there are at least three thousand graduate practitioners of three main types of traditional medicine. The number of diploma and certified practitioners is around 50 thousand across the country. There are some 600 traditional medicine manufacturing units in the country. \nIt is difficult to comprehend why the reform commission did not take traditional medicine into due consideration and concentrated only on mainstream Allopathic medicine and treatment. Already, Unani, Ayurvedic and Homeopathic practitioners have lodged their protests and also organised a press briefing to present the status of traditional medicine. At the briefing last month, they also raised questions regarding the commission's recommendations that suggest that none except those having an MBBS and BDS degree should be allowed to identify themselves as a medical practitioner. The recommendation goes against the existing rules and regulations governing the country's traditional medicine sector. The commission, thus, needs to revisit the flawed approach to traditional medicine.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ignoring traditional medicine: a wrong approach",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ignoring-traditional-medicine-a-wrong-approach-1749830769",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 14, 2025 00:00:00  \n\nIn recent years, short-form video platforms like TikTok and Instagram Reels have begun to play a significant role in shaping political perceptions among the youth of Bangladesh. This trend, often referred to as 'TikTok Politics', reflects a broader shift in how Gen Z engages with political discourse and activism.\nDuring the recent student-led 'Quota Movement', videos captured on mobile phones went viral, reaching millions. Even when internet access was restricted by the authorities, young people continued to circulate updates through creative means - sharing clips of police action, protests, and even personal reactions in real time. These videos, often layered with memes, sound effects, and humour, transform serious political content into dynamic, easily digestible messages.\nThis informal and visually engaging format allows young people to participate in political conversations in a more relatable, and sometimes lighthearted, way. Through this process, they not only create echo chambers of like-minded individuals but also forge strong networks of solidarity. The result is an empowered youth that is more politically aware, mobilised, and capable of transforming online sentiments into offline movements.\nShort-form video platforms are no longer just sources of entertainment; they are rapidly becoming tools for political awareness, engagement, and collective action among Bangladesh's youth. It is crucial to acknowledge and understand this shift in how political participation is being redefined in the digital age.\nAsikuzzaman\nDepartment of Accounting and Finance\nNorth South University\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How TikTok is shaping youth's perceptions",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-tiktok-is-shaping-youths-perceptions-1749830789",
        "news_paper_name": "The Financial Express",
        "publish_date": "14-06-2025"
    }
]