[
    {
        "full_article": "The Supreme Court of India has been subjected to unfounded criticism by sections of the ruling BJP, and Vice-President Jagdeep Dhankhar, with regard to the separation of powers between the various branches of the government, and the principle of checks and balances. Not surprisingly, a Supreme Court bench took note of the charge that it was intruding into executive and legislative functions. In one petition, the Court was urged to direct the Centre to act under Articles 355 and 356 to deal with the situation of violence in West Bengal. In another, the Court’s intervention was sought to curtail obscene content on online platforms. The Calcutta High Court had earlier ordered the deployment of Central forces to stem violence in Murshidabad in West Bengal. Judicial review of legislative and executive decisions is an integral part of India’s constitutional democracy. Decisions of the executive and the legislature can be examined by the judiciary to determine whether they are consistent with the Constitution, and even constitutional amendments are subject to the ‘basic structure’ test. There are multiple constitutional avenues for judicial intervention in the making and enforcement of law. Article 13 gives the judiciary the power to strike down laws that are violating fundamental rights. Articles 32 and 226 give the Supreme Court and High Courts, respectively, the power to issue writs for the enforcement of fundamental rights, and beyond.The notion that the judiciary is subservient to legislature is out of line with the constitutional scheme. In fact, the judiciary is expected to insulate the rule of law from the pressure of public opinion that members of the legislature represent. It is in this constructive friction between various institutions of the state that a society can achieve stability in governance. The argument that legislatures can pass any law on the basis of a majority is a majoritarian argument. The erasure of the distinction between the executive and legislature has already created a crisis of accountability in governance at the national and State level in India. The attempt to intimidate the judiciary in the name of legislative supremacy is a threat to democracy — not its furtherance. In the recent judgment that set timelines for the Governor and President for acting on laws passed by the Assembly, the Supreme Court restored the authority of the elected legislatures, which was being trampled upon by an unelected Governor and arbitrary actions by the President. The critics of the judiciary miss this point altogether. Published - April 23, 2025 12:38 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Supreme Court",
        "headline_1": "Matters that count: On criticisms of the Supreme Court",
        "headline_2": "Attempts to intimidate the judiciary pose a threat to democracy",
        "link": "https://www.thehindu.com/opinion/editorial/matters-that-count-on-criticisms-of-the-supreme-court/article69479607.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "The announcement of the BJP-led government in Maharashtra that English and Marathi medium schools will begin teaching Hindi as a third language from Class 1, as part of the implementation of the National Education Policy 2020, is running into significant political opposition. Previously, Hindi was introduced as a third language only from Class 6 onwards. Schools with other mediums of instruction have already been following the three-language formula from Class 1. While some view the announcement as an instance of Hindi imposition, others fear its potential in undermining Marathi. Chief Minister Devendra Fadnavis defended the move, stating that Hindi serves as an acceptable language of communication across India. But there are concerns about the practical challenges of this mandate: the extensive logistics involved in teacher recruitment and training, besides salary costs. Media reports and social media chatter have pointed to an emerging hostility towards Hindi, which could be a response to the perceived imposition. There is resentment that the move is an effort to appease the sizeable population of native Hindi speakers settled in Maharashtra. Historically, the State has witnessed a strong regional political identity, epitomised by the Shiv Sena since the 1960s. This identity has emphasised Marathi pride, cultural assertion, and prioritisation of local employment. Yet, unlike Tamil Nadu, Maharashtra has not exhibited overt hostility towards Hindi. Even the Shiv Sena, which has targeted various groups — south Indians, Muslims, and north Indian migrant workers — at different times, did not cultivate animosity towards Hindi. The current resentment, therefore, seems less organic and more a product of the BJP’s centralising agenda, which seeks uniformity in a culturally and linguistically diverse nation.While the Constitution is unitary in structure, it recognises and accommodates diversity in numerous ways. Previous centralising efforts by Congress governments included the promotion of Hindi, but there was enough institutional flexibility to balance divergent interests. Though the BJP now governs with a reduced mandate, it has managed to secure support from allies for its centralising vision, provoking resistance in States such as Tamil Nadu and Maharashtra. Meanwhile, the educational landscape is undergoing a radical transformation with developments in AI and neuroscience. Instead of creating divisions, the Fadnavis government would do well to build consensus to address the evolving demands of school and higher education. Published - April 23, 2025 12:28 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        language\n                    \n                            /                      \n                        \n                        Hindi",
        "headline_1": "Opposing imposition: On teaching Hindi in Maharashtra",
        "headline_2": "Hindi can be promoted without making it mandatory",
        "link": "https://www.thehindu.com/opinion/editorial/opposing-imposition-on-teaching-hindi-in-maharashtra/article69479727.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "President Trump wages a water war so that Americans can have their legitimate ‘bathright’\nWhen Donald Trump reigns, it pours. Quite literally. The US president has signed an order that rescinds a 1992 legislation restricting American shower heads from releasing no more than 9.5 litres of water per minute.\nWhen he assumed office, Barack Obama redefined this rule so that it applied to the overall shower head and not to each of its nozzles. At the end of his first term in office, Trump reversed that ruling, so that each nozzle could emit 9.5 litres per minute.\nIn a policy ping-pong match, Joe Biden’s administration reverted to the water-saving formula introduced by Obama, which Trump, continuing to wage his water war, has again rejected.\nConservationists have rung alarm bells, saying that Trump’s laissez-faire attitude regarding H2O will literally liquidate America’s reserves of the life-sustaining fluid. But the US president is determined to implement an add-on to his MAGA campaign and Make America Gleam Again thanks to shower power.\n“I like to take a nice shower to take care of my beautiful hair,” he declared, dismissing fears that his hallmark tresses could create environmental distresses. “You take a shower, the water doesn’t come out…So what do you do? You just stand there longer or you take a shower longer? Because my hair… it has to be perfect,” he had earlier said.\nHowever, the Trump administration has a number of top-level personnel, including FBI director Kash Patel and National Health Director Jay Bhattacharya.\nSuch advisers with subcontinental backgrounds might induce their boss to try out what is sometimes called an ‘Indian shower’, which comprises a balti of water, which, by means of a large plastic mug (pronounced mugga), is splashed upon oneself in great cascades, which would put to shame the most nozzled of American shower heads.\nPerhaps. Though an impetuous Don, displeased by the experience, might be moved to kick the balti, otherwise known as the bucket.\n\n",
        "headline_1": "Shower power",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/shower-power/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "GOI must hunt down terrorists. India must not do what they want: turn tragedy to communal rhetoric\nThat terrorists chose Pahalgam, one of Kashmir’s best-known and most-loved tourist destinations, for executing one of the worst attacks in the Valley in a long time, and that too just as the tourist season began, was clearly aimed at spreading fear and uncertainty among both locals and visitors. We must also consider the timing in three other contexts – Modi is out of the country, visiting Saudi Arabia, a friendly country and arguably the most influential player in the Islamic world, Trump’s deputy Vance is in India for a high-profile visit, and Pakistan’s army chief, Asim Munir, last week made one of the most aggressive comments on Kashmir in recent times. This, therefore, is a huge security challenge for GOI, and it needs to respond quickly and intelligently, with the first job being hunting down the perpetrators.\nWhether or not media reports naming TRF, apparently an LeT franchisee, as the responsible terror outfit are credible, the fact remains that attacks like these – targeting civilians – are notoriously difficult to probe because small teams, armed with very basic weapons, can produce a carnage. GOI’s security top brass would be well aware of this. But it would also be equally aware that a fitting message needs to be sent back to terrorists and their backers.\nChilling, too, are the way the killers went about their job – asking for names, obviously to identify religion, before murdering innocents. This is the same tactic terrorists employed during the last major spate of killing civilians, mostly targeting migrant workers. The aim here is to create inflammatory rhetoric from those horrified by the deaths. Therefore, it’s imperative that a message goes down from the highest levels of GOI that all religion-tinged rhetoric must be avoided, not just in Kashmir, but everywhere in India. If what’s a terrible national tragedy gets wound up in communally charged rhetoric, terrorists will win, India will lose.\nGOI and J&K govt must also reach out to Kashmir’s tourist industry and its many entrepreneurs and workers, for all of whom the summer months are the biggest earners. Livelihoods are at stake here. Giving them credible assurances is an urgent job. What happened in Pahalgam is a huge challenge for India, and it must respond accordingly. \n\n",
        "headline_1": "After Pahalgam",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/after-pahalgam/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "Will tax cuts spur consumption? Can India swing a trade deal with US & appear as an attractive FDI destination?\nFM Sitharaman has been talking up India’s business environment on her 5-day US trip. It’s a timely pitch, not only because Trump’s tariffs could shave some points off GDP growth this year but also because India does not have much headroom for a slowdown. RBI has lowered its 2024-25 GDP growth estimate to 6.5%, and forecast the same level for 2025-26. Other forecasters, like Fitch, are a shade less optimistic. On the tariff front, Trump’s given a 90-day breather. And the fact that India has avoided a confrontation with him – unlike China, Canada and EU – shows the intent for an early resolution. Vance’s India visit at this crucial time is a booster, and Sitharaman has said that the “first tranche” of the India-US trade agreement can be expected “by fall of this year”. Perhaps, her bigger worry, then, is the Indian consumer who became a reluctant spender last year.\nPrivate consumption is the chief engine of India’s economy, accounting for well over 50% of GDP, but this share declined from 58% in 2022-23 to 55.6% in 2023-24, even as govt itself started scaling down spending. Suddenly, everything from shampoo sachets to cars wasn’t moving off the shelves as fast as govt and businesses would have liked it to. That’s why Sitharaman announced a large tax break for the middle class in this year’s budget, hoping that the extra cash in hand – altogether 1L cr foregone in revenue – would spur consumption. May will be the first real test of this decision after workers receive their April salaries.\nThere’s some good news on the energy and monsoon fronts meanwhile. With fears of a Trump-induced slowdown, analysts expect oil to stay in the $55-65 range, providing a cushion. Monsoon is expected to be normal for the 10th year in a row, although that forecast does not account for regional variations. Still, good monsoon means strong rural demand. That and a trade deal that makes India attractive to foreign investors could get growth revving up.\n\n",
        "headline_1": "2 economy questions",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/2-economy-questions/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "What a Pope signifies for Catholics is unique. No other religion is led by a figure of such stature. Part of the reason is that the prestige of the church was a result of imperial political strategy\nA Pope – in Latin, Papa – is dead. Another will be chosen. And in all the commentary about the papacy, there will be one thing missing: the defining role that power politics and the rise and fall of empires had in giving papacy the extraordinary role it has in Catholicism.\nWhen we think of the Pope, we never think about the Roman Empire. We think of an avuncular religious leader, not a shrewd political leader. This is because of the way we are taught history.\n\nIn history textbooks, religion starts with a leader. Judaism starts with Moses, Buddhism with Gautam, Jainism with Mahavir, Christianity with Jesus, Islam with Muhammad.\nRead the full story on TOI+.\n\n",
        "headline_1": "Papas and politics",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/papas-and-politics/",
        "news_paper_name": "The Times of India",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "According to a recent report by the Centre for Policy Dialogue (CPD), Bangladesh lost an estimated Tk 226,236 crore in potential revenue due to tax evasion and avoidance in FY 2022-23. This is an extremely troubling finding. While it is generally known that tax irregularities are widespread in Bangladesh, the extent of the resultant loss, as estimated by the CPD, is staggering. To put it into perspective, the lost amount from FY23 could have funded the construction of approximately seven metro rail lines, provided each cost as much as the revised budget of Tk 33,472 crore for Metro Rail Line-6 connecting Uttara to Kamalapur.\n\nIn other words, had the National Board of Revenue (NBR) managed to collect some portion of the Tk 2.26 lakh crore lost to tax evasion, it could have easily met its revenue target for that year—which it fell short of by Tk 44,728 crore, according to provisional data. Therefore, the fact that the NBR has a history of missing its revenue targets is clearly not a fait accompli, but rather something that can be rectified.\n\nAccording to the CPD report, corporate tax evasion alone accounted for roughly half of the total loss in FY23—about Tk 113,118 crore—highlighting a concerning trend of rising evasion since 2011. The estimated loss in 2012 was Tk 96,503 crore, which surged to Tk 133,673 crore by 2015. According to CPD, corruption and a range of structural issues, including high tax rates, weak enforcement, and a labyrinthine legal framework, have been fuelling this rampant tax evasion.\n\nFor instance, nearly half of the firms surveyed in the study alleged that they were asked for bribes by officials while seeking tax-related services in FY23. Additionally, 40 percent of surveyed companies reported problems when adjusting their tax refunds. Moreover, 79 percent of firms pointed to a lack of accountability among tax officials, while 72 percent cited widespread corruption in the tax administration. Furthermore, 65 percent of businesses reported persistent disputes with tax officials over the calculation of their payable tax amounts. Another controversial factor that deserves scrutiny is the policy on tax expenditure and incentives. According to CPD, Bangladesh's current tax incentive structure is deeply entangled with political interests, rather than being merit-based and time-bound.\n\nClearly, much work is needed to improve our overall tax system. In fact, the entire structure appears to require a significant overhaul. Firstly, the tax submission process must be fully digitalised, with a unified system of financial transactions to ensure that every transaction is traceable and verifiable, thereby creating a barrier against corruption and fraud. Secondly, the NBR must significantly expand its corporate tax net, raising the proportion of tax-paying firms to at least 59 percent of registered companies—up from the current estimate of just 9 percent. Without such transformative reforms, Bangladesh's fiscal progress will remain severely hampered.\n",
        "headline_1": "It’s high time to overhaul our tax system",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/its-high-time-overhaul-our-tax-system-3877576",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "Perhaps Pope Francis' subconscious mind knew that this past Easter Sunday (April 20, 2025), giving a blessing to all the Catholics at the end of the Mass, would be his last. Francis had been in poor health since last February. On Sunday, people had gathered since dawn in St Peter's Square at the Vatican. Sadly, Pope Francis passed away on Easter Monday at his residence in the Vatican's Casa Santa Marta at 7:35am. Francis was 88. This was the first news that came to my newsfeed when I reached for my mobile phone on Monday morning after waking up. At the end of my morning prayer, I prayed for his soul to find eternal peace.\nFrancis' death brings an end to his 12 years as the head of the Catholic Church. From the balcony of the Vatican, Cardinal Giovanni Batista announced the news of the Pope's passing to thousands of mourners who were holding a vigil. Two black cloths were hung from the balcony of the Vatican to symbolise the mourning period for the passing of the pontiff. This tradition will remain in place for 15 days until the cardinals elect a new Pope.\nArgentine-born Pope Francis was the first Pope in the Roman Catholic Church from the Americas. During his poor health in recent months, with repeated hospitalisations, he did not once consider retiring like his predecessor, Pope Benedict XVI. Though Pope Francis' papacy was not without controversy, his message had a profound impact on Catholics and non-Catholics alike. Francis was well loved; the world has lost a champion who fought for human dignity, and stood up for the rights of the marginalised and the disadvantaged.\nAt a time when we cannot explain the deaths and destruction of today in a natural way without causing dread and fear to a child, Pope Francis was a voice of assurance in a bleak world. In 2020, the iconic image of Pope Francis blessing the world with the Blessed Sacrament during the coronavirus pandemic, standing alone in an empty and rainy St Peter's Square, left an indelible impression. The image provided hope to millions of people around the world who were sequestered in their homes. Through it all, the Pope of the people remained fearless.\nFrancis did not mince words when calling on world leaders to stop genocide and killings. He asked them not to seek revenge out of hatred. His message to the world was simple: not to propagate violence in the name of religion.\nThe Pope was very vocal about protecting children's rights. He pleaded on behalf of the world's children who were victims of sexual abuse, conflict, displacement, and of a \"throwaway culture.\" This past February, addressing world leaders in the Vatican, Francis said, \"Nothing is worth more than the life of a child.\"\nFrancis was very persistent in emphasising the importance of acting against radicalism, because he knew that without it, the cancer would grow and its evil would spread around the continent. \"Together,\" he said, \"we must say no to hatred, to revenge and to violence, particularly that violence which is enacted in the name of a religion or of God himself, and God must never be used to justify hatred and violence.\"\nThe Pope always urged his followers to be conscious of the changes in the world. He deeply believed that the Catholic Church plays a positive role in shaping people's moral and spiritual development. He championed education, health, housing, and other related social and economic development. He regularly reminded everyone that young people are being radicalised in the name of religion to sow discord and extreme fear.\nDuring his tenure, the Pope visited 67 countries. On average, he made four international trips each year. Everywhere he went, thousands waited behind the barricades to have a glance at the Pope. He spoke about the same theme that he had once raised in Kenya—development that benefits the poor—and urged Muslims and Christians to live in harmony. Francis frequently addressed the question of religiously inspired violence.\nViolence worried Pope Francis. In 2015, right after the Paris attacks, Francis was on an African tour. He went to Kenya, Uganda, and the Central African Republic. The pontiff tackled issues ranging from Islamic extremism to climate change. The Pope's visit came at a time when the African countries were struggling on many fronts with few options. The visit changed all that, and the role of the Catholic Church increased dramatically in Africa. As the first non-European Pope in nearly 1,300 years, Francis gave appointments to many African cardinals. This gave legitimacy to this long-ignored continent.\nIn Bangui, the capital of the Central African Republic, Muslims and Christians had slaughtered each other for years. More than 400,000 people had been displaced. Both Islam and Christianity in Africa are expected to grow to twice their numbers by 2050. While in Bangui, the Pope made the riskiest venture when he went to a mosque. Before entering the mosque, the Pope took off his shoes according to custom. In that particular region, called PK-5, the Muslim minority had been isolated for months as a rival militia group stood guard. Because of the Pope's visit, the barricade was broken for about three hours. Standing in the mosque, the pontiff spoke of reconciliation across faiths and said, \"Muslims and Christians are brothers and sisters.\"\nThe Pope lashed out at African nations' leaders for neglecting the poor. African leaders have colossal wealth, although it is concentrated in the hands of a few. He called the injustices against the poor \"new forms of colonialism.\" The people's Pope was overwhelmed after seeing so much poverty and lamented that even God is not used to seeing so much suffering.\nGeopolitically, Africa has remained a neglected continent. Pope Francis dubbed it a \"continent of hope.\" Hundreds of volunteers gathered to sweep the litter-filled streets, put gravel on the mud road that led to the mosque in Bangui, and install new lights everywhere. With a visit from this iconic figure, Africa benefited through the visitors' expenditure and some small-scale infrastructure development.\nAfter being ordained Pope, Francis made humility and helping the poor hallmarks of his papal tenure. He was a simple man. He refused to live in the luxurious papal apartment and opted for a two-room guesthouse inside the Vatican. He wore a simple white cassock with a papal belt around his waist. He had his papal ring made out of silver, as he did not want to use the elaborate one made of gold.\nPope Francis denounced violence in every form and shape. He spoke about Christians killing Muslims. He talked about the plight of Christians in the Middle East, and Africans being slaughtered by Muslim militants. He relentlessly spoke about the plight of the Palestinians. He pleaded with the Trump administration to stop its inhuman treatment of migrants when they were being deported.\nFrancis was known for pushing the boundaries of the Catholic Church. He openly discussed priests abusing altar boys in Catholic churches. He spoke against the exclusion of the vulnerable community from mainstream society.\nPope Francis ceaselessly fought for the humanity and dignity of marginalised people to be restored. His central message to the world was about hope, unity, and reconciliation. Pope Francis once said it is important that \"we be seen as prophets of peace, peacemakers who invite others to live in peace, harmony and mutual respect.\" This could be his enduring legacy.\nZeenat Khan is a contributor to South Asia based journals. She also writes short stories and nonfiction.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The people’s Pope dies after giving the final blessing ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-peoples-pope-dies-after-giving-the-final-blessing-3877556",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "Earth Day has been celebrated on April 22 since 1970 on a proposal by US Senator Gaylord Nelson to increase environmental awareness. On this day in 1970, about 20 million people in the United States came out and protested vehemently against environmental pollution. The day has been celebrated globally since 1990.\nThe theme for this year is \"Our Power, Our Planet\" through which everyone around the world is being called upon to unite behind the production of renewable energy and triple global production of renewable energy by 2030. This will make it easier to ensure global energy security.\nThe world is facing serious impact of climate change mainly due to the continuous increase in the density of carbon dioxide in the atmosphere. In 1974, the density of carbon dioxide in the atmosphere was 330.19 parts per million (ppm), which in 50 years has increased to 424.61 ppm.  In fact, 2024 has been marked as the warmest year on record due to abrupt climate change. This year, the temperature in the atmosphere was about 1.55 degrees Celsius higher than the pre-industrial revolution.\nAccording to a World Bank report, about 1.2 billion people in the world are at high risk of climate change but rapid development and sustainable economic growth can reduce the economic and quality of life losses caused by climate change.\nThe report found a 10 percent increase in per capita GDP would reduce the number of the most vulnerable by about 100 million. Therefore, increasing per capita income is crucial at this time.\nIn addition, about 129 countries, including Bangladesh, have prepared their own National Adaptation Plan (NAP) in 2022 for UNFCCC under the NAP Global Network to overcome the damage caused by climate change.\nNAP divided Bangladesh into 11 climate zones and identified a total of 14 risks, it has proposed 110 actions to implement six main goals, where a total of $230 billion in climate assistance is needed till 2050 to address these risks. Bangladesh is among the top ten countries in the world that are most at risk from climate change. In this situation, World Earth Day provides us with an opportunity to make a new commitment related to the Multilateral Green Climate Fund to mitigate climate risks and impacts.\nA 2024 report estimated that climate finance flows would need to increase at least six-fold reaching $8.5 trillion per year by 2030.\nA special climate change fund was created in 2001 to help vulnerable countries cope with the negative effects of climate change. Subsequently, more effective action by all parties are required to implement the terms of 'Kyoto Protocol' to reduce greenhouse gas emissions, which has become urgent. Unfortunately, some developed countries withdrew from the agreement, the US did not ratify while others did not sign the second targets round of targets of the protocol. As a result, the affected countries are struggling a lot to get the compensation.\nHowever, in 2024, the World Bank Group provided $42.6 billion in climate finance. Bangladesh has received $1.16 billion in financial assistance from the World Bank to promote healthcare, water and sanitation, and climate resilience. This includes a $500 million Green and Climate Resilient Development Loan. In addition, other lenders are also allocating a significant portion of their funds to support Bangladesh's climate agenda.\nLocal banks can be more proactive in lending to renewable energy, environmentally friendly industries, green buildings, and agriculture-based sustainable projects, helping to reduce carbon emissions. According to the Bangladesh Bank report, the combined contribution of the country's 61 banks and 34 NBFIs to sustainable finance in the second quarter of 2024 was Tk 1.16 trillion, which is Tk 281.03 billion more than in the first quarter. In the second quarter of 2024, banks invested Tk 1.13 trillion and NBFIs invested Tk 29.92 billion in sustainable finance.\nA directive issued by Bangladesh Bank in November last year stated that from 2025, banks will invest 40 percent of their total loans in the private sector for environmentally friendly and sustainable initiatives of which five percent must go to environmentally friendly initiatives.\nMeanwhile, several banks in Bangladesh continued to pave the way forward to environmental conservation by increasing customer awareness, expanding paperless banking, and revolutionising digital transactions. However, every workplace should adopt policies that reduce unnecessarily interference with our environment.\nProtecting nature and the environment and creating a green world has been essential through more responsible behaviour of the developed world countries, a strong role of the financial sector, and widespread awareness among the people. Everyone must join the fight for survival and stand against the destruction of nature and the environment to combat the negative effects of climate change.\nM M Mahbub Hasan is the head of financial inclusion and school banking at Prime Bank PLC. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "The role that the financial sector can play to combat climate change",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/the-role-the-financial-sector-can-play-combat-climate-change-3877471",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "The body of a six-month-old baby was recovered on Saturday from a canal in Chattogram after the child had gone missing on Friday. A woman and her baby were travelling in a rickshaw when the baby fell into an open sewer, which had a strong current after rainfall. This story has tragically become one that plays out every now and then in Chattogram, notorious for its open drains and canals, where many have perished while others have been severely injured. A significant number of the victims were children. Despite lofty—and expensive—projects by the authorities to fix the city's drainage system, something as basic as closing all the open drains and canals to prevent people from falling into them has not been completed. Why such apathy for public safety?\nIn the last several years, there have been innumerable reports of people falling into open drains or canals, with some of the bodies never found. People have been expressing their fear, as most drains do not have protective slabs or retaining walls, which make them deadly after rainfall. The media has been relentlessly reporting on these incidents. Yet these deaths continue, robbing families of their loved ones.\n\nThe Chattogram City Corporation (CCC) and the Chattogram Development Authority (CDA) are the agencies responsible for maintaining and repairing the drainage system. They are therefore the main government bodies that should be held responsible for such criminal negligence. In 2021, the CCC found 5,527 risky spots along the drains, canals, and footpaths of the city. While around 80 percent of these spots have been covered and 70 percent of retaining walls built along the canals (according to a news report), there are still many vulnerable spots that are potential death traps—which is why a six-month-old baby had to die.\nIt is well known that these open drains and canals become clogged with silt and waste during the rainy season, causing them to become submerged, making it impossible to see them on the flooded roads. Thus, pedestrians or rickshaws falling into the drains, or people getting swept away by the open canals, has become a common occurrence. Yet the four projects worth Tk 14,389 crore initiated by the Awami League government could not complete the renovation of these canals and drains.\nWe expect the interim government to immediately take steps to demand answers from the CCC and CDA, and instruct them to cover the remaining risky spots on an urgent basis. Deaths caused by official negligence can no longer be tolerated. With the upcoming rainy season, they cannot afford to waste any more time.\n",
        "headline_1": "Open drains and canals continue to claim lives",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/open-drains-and-canals-continue-claim-lives-3875041",
        "news_paper_name": "The Daily Star",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 23, 2025 00:00:00  \nEmpowering local governments, which are directly elected by the people, has long been on the agenda of successive governments. So, the recommendations made in this regard by the Local Government Reform Commission (LGRC) in its report do seriously deserve due consideration of all concerned. The proposal such as the one that suggests bringing the district administration under an elected local government body, to be called district council, is welcome since it is reasonable and reflects public expectations. The truth is such a move had always been facing stiff resistance from the bureaucracy. The ruling political class on the other hand had been rather lukewarm at best and apathetic at worst about seeing any change in the existing order.\n A survey of the state of all the existing local government bodies, starting from city corporations down to union parishads, will prove the assertion. In fact, the chairpersons of the Union, Upazila and Zila Parishads as well as the mayors of the municipalities and city corporations do not exercise real authority when it comes to implementing any project or development work they might undertake. Despite being public representatives, they have to be accountable to the administrative bureaucracy for any work to be done. The hardest part of those elected local government representatives' job is to ensure cooperation, far less allegiance, from the public servants. That is more so, if the government officials are from the administrative cadre. To overcome this barrier would be the biggest challenge before the elected local government bodies as suggested in the reform proposal. In a similar vein, the idea of introducing city governments in place of the exiting city corporations to coordinate and supervise the various utility service providers is no doubt a novel one. But, again, the same challenges here would be multiple times harder than that faced by the reelected local government institutions in the districts.\nThat notwithstanding, the fact that the final report of the LGRC embodying some 51 recommendations to strengthen the local government institutions by empowering as well as making those more efficient is a proposition that has been a long time coming. Alongside recommending various legal, structural and operational changes in the local government system, the final report on reform also includes, as could be learnt, establishment of a court at the upazila level. The court, it is said, would function under a senior assistance judge who would dispose of both civil and criminal cases. Also, the suggestion of allocating larger funds for the local government bodies and doubling the funds' amount in the next fiscal are understandably meant to increasing the financial resources and thus empower them.\nNo doubt, all these recommendations constitute a first step towards empowering the elected institutions of the people. The bureaucracy so far enjoyed real power and would lord it over the people and their elected local government representatives. In that case, the public representatives to lead the local government institutions should not be judged solely by their popularity. Unlike in the past, issues like their educational qualifications and strength of character have also to be taken into consideration. Also, the LGRC's suggestion that the separate legal frameworks for different local government bodies should be brought under a single, simplified and inclusive law is also a well-conceived one. That would help streamline the operation of the local government institutions. So, after public scrutiny and review of the Consensus Commission, the recommendations would be required to be made into law by future elected governments. The sooner these recommendations on local government reforms now on paper are made to come into effect the better for common citizens.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Empowering local government",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/empowering-local-government-1745339866",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Wasi Ahmed   |  \n       April 23, 2025 00:00:00  \nThe question of whether Foreign Direct Investment (FDI) in Bangladesh's readymade garment (RMG) sector is ultimately beneficial remains unresolved. Industry stakeholders and policymakers have yet to provide a definitive stance. There are foreign collaborations, but not in the form of any large-scale FDI. However, the government's efforts to attract FDI in both within and outside the Export Processing Zones (EPZs) is not industry-specific, and hence not meant to exclude any specific manufacturing sector beyond the scope of investment. The key question remains: is FDI outside the specialised zones a welcome proposition?\n In recent years, Bangladesh has emerged as a viable destination for industrial relocation, especially from countries like China, Japan, and South Korea. Rising labour costs in those economies have prompted many manufacturers to seek alternative locations for setting up export-oriented industries. Bangladesh, despite infrastructure and governance challenges, offers competitive advantages such as low wages, abundant labour force and experience in mass garment production. Among all manufacturing sectors, the RMG industry stands out as the most promising candidate for attracting overseas investment. Industry observers argue that FDI in this area could generate multiplier effects across various related sectors-logistics, packaging, accessories, and more.\n However, local RMG manufacturers remain wary of such developments. It can well be guessed that much of the concerns of the local manufacturers stem from the fear that if the government allows unconditional approval to foreign investment in the RMG sector, there might be serious competition in the low-end segment products---the key strength of Bangladesh's apparel industry. This fear is further heightened by the fact that China has already made it known that producing low-end apparels is no longer viable in that country, because of soaring wages. So, provided with adequate opportunities, chances of relocation of Chinese factories for low-end products are high. \n In view of this, stakeholders are more inclined to confine foreign investment to the garment sector and the EPZs only. As for investment outside the EPZs, they reportedly agreed some time ago to accept foreign investment outside the EPZs on condition that those factories will produce fashion items for non-traditional and new markets like Russia, Brazil, China, South Africa, India, Australia and Mexico.\n The country's RMG sector is now in a state of uncertainty, if not of panic. Although exports did not suffer any major setback due to the fallout of the Covid 19 and the Russia-Ukraine war on global markets and some ups and downs in export orders coming to Bangladesh, the sector did demonstrate strong resilience that eventually paid to ride out the problems of supply chain disruptions and market instability. However, in order to further strengthen the foundation of the industry, experts including foreign buyers stress upon the need for expanding and diversifying the manufacturing base in ways that will be beneficial to the local industry and the country's economy. Is FDI the right recipe in this regard? \n In the recently held investment summit, the deliberations mainly centred on economic zones including what the country is ready to offer to investors in those zones. Since the event was organised by the Bangladesh Economic Zones Authority (BEZA), the focus was obviously to attract prospective investors to those zones - some of which are country-specific. \n There are quarters in the country who fear foreign investment in the RMG outside the SEZs and EPZs might pose genuine threat to the sector. Looking at the scenario simplistically may not help, as there are counter-arguments that may reveal that the fear of the local manufacturers is more from better wage prospects for workers in the foreign factories, which in turn will have its effect on the local factories. \n Notably, the local manufacturers at the moment are rigid in their stand on wages. The rigidity of domestic entrepreneurs on wage issues has often been a contentious topic, particularly in labour rights discussions. Allowing foreign investment in low-end segments could, they fear, disrupt the wage equilibrium and create labour unrest in existing factories. So, according to them, inviting foreign investment in the basic and low-end segment of apparels would call for undesirable chaos. In this context, critics are at ease to raise the all-important question: if foreign investors can afford to pay better and still make profits, why not the locals? \n Given these complexities, any decision to allow FDI in the RMG sector - particularly outside EPZs -must be preceded by a comprehensive consultation process. Engaging local stakeholders, especially domestic manufacturers, will be critical in finding a workable solution. It is also essential to involve think tanks, policy analysts, and industry experts to weigh the broader implications of such a policy shift.\n Bangladesh's RMG sector is at a crossroads. While FDI could act as a catalyst for transformation and long-term competitiveness, unregulated or poorly managed foreign entry could disrupt the delicate balance the industry has maintained over decades. A thoughtful, strategic approach - rooted in inclusive dialogue and clear regulatory frameworks - will be essential to ensure that FDI complements rather than competes with local industry.\nwasiahmed.bd@ gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Is FDI a boon or bane for RMG sector?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/is-fdi-a-boon-or-bane-for-rmg-sector-1745339925",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 23, 2025 00:00:00  \n\nThe Jagannath University (JnU) is one of the most prominent public universities in Bangladesh, with nearly 20,000 students currently enrolled. Despite its academic reputation, the university faces a long-standing and deeply troubling issue: a severe housing crisis.\nThe JnU is the only public university in the country without a residential hall for male students. The only existing hall for female students is severely overcrowded. Even there, students face daily struggles, including gas shortages, long queues to cook, and substandard food quality.\nAlthough there was once a residential hall for male students, it has since been occupied by outsiders. As a result, the majority of students are forced to rent costly, often unsafe, and unhygienic accommodations in Old Dhaka. The financial burden is heavy-many students must take on private tuition or part-time jobs just to pay rent, leaving little time or energy to focus on academics.\nStudents from lower-income families suffer the most. Some cannot afford to pay rent at all by the end of the month, putting their education at risk. It is heartbreaking to see students so desperate that they retake admission exams simply to transfer to universities where housing is available.\nEven more distressing is that some students commute daily from faraway districts like Cumilla, Manikganj, or Narsingdi to avoid the high cost of living in Dhaka. This daily travel brings immense physical and mental stress, ultimately harming their academic performance.\nThe lack of proper accommodation also robs students of vital opportunities for social, cultural, and emotional development. It tarnishes the university's reputation and fuels frustration and resentment among the student body.\nIt is imperative that the university administration and government take immediate and effective action. Temporary housing solutions should be provided at the new Keraniganj campus, and a fair monthly allowance could be introduced to ease the burden on students. Most importantly, the construction of new residential halls must begin without further delay.\nMst. Mishkatul Islam Mumu\nStudent\nJagannath University\nmishkatislam102@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Accommodation crisis at JnU",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/accommodation-crisis-at-jnu-1745339957",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-04-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       April 23, 2025 00:00:00  \n\nBangladesh has seen mixed results from the international boycott of businesses that support Israel's occupation. Other contentious foreign brands continue to operate here without encountering the same level of opposition, despite Coca-Cola reporting a notable 23 per cent drop in sales as a result of consumer protests. This discrepancy highlights the need for economic activism to take a more calculated approach. Coordinated boycotts have shown quantifiable success on a global scale. In Muslim majority countries, McDonald's saw its first quarterly sales decline since 2020, and Starbucks Malaysia saw a 38 per cent decline in revenue. These results demonstrate the power of coordinated consumer action under well-defined guidelines.\nWe have witnessed encouraging beginnings in Bangladesh. Shifting consumer preferences have benefited local brands like Mojo, showing how ethical consumption can help support homegrown companies. However, the lack of a cohesive plan restricts our influence and runs the risk of weakening the movement's impact.\nEstablishing precise standards for identifying complicit businesses, promoting institutional involvement from corporations and academic institutions, and sustaining public awareness are all necessary to bolster our economic resistance. By monitoring boycott impacts and promoting informed consumer choices, media outlets can play a vital role in strengthening economic activism. Bangladesh can encourage local business while converting moral solidarity into significant economic pressure with the right coordination. The time has come to establish a long-term model of ethical consumption rather than relying solely on intermittent protests.\nSamira Ferdous, \nStudent, BBA\nNorth South University, Dhaka\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bangladesh needs smarter boycotts",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangladesh-needs-smarter-boycotts-1745339983",
        "news_paper_name": "The Financial Express",
        "publish_date": "23-04-2025"
    }
]