[
    {
        "full_article": "The recently announced package of ₹69,725 crore, to revitalise India’s shipbuilding and maritime ecosystem, is to replace the package of 2015, which is set to expire in March 2026. In the last 10 years, while lucrative defence orders had kept some shipyards busy, only half-a-dozen small merchant ships or so were built in all of India. India’s capacity to build large merchant ships remains minuscule, which the package hopes to expand to 4.5 million gross tonnage. The plan is to upgrade shipyards for cutting-edge technology and management principles, promote new yards in clusters housing factories for shipbuilding ancillaries, and support shipowners for financing newbuilds. But key questions remain over how this package will succeed as the earlier one was largely a failure.Globally, shipbuilding has been honed into a fine art. In Korean, Japanese or even Chinese yards, component blocks of large merchant ships are prefabricated outside the actual dry dock and moved to the dry dock, using cranes of say 1,000 tonnes, where they are welded together. The yards are long enough to be assembly lines. In the past, the metric was keel-laying-to-waterborne. Today that takes just three to four months. It takes just about a year from the process of first steel to sea trials for a large merchant ship. Barring an exception or two, Indian yards are neither long enough nor have the crane capacity and space and capability to do the prefabs. Ancillaries are another bottleneck. A turnaround of about two to three years is the norm in India — or two more years of capital sunk without returns. This is a key reason for Indian shipowners not ordering new shipbuilds even if the subsidies in previous policy addressed the issue of high capex. Shipyard upgrading should address this issue. China, for instance, has thought through shipbuilding in full and set up institutions to train manpower. At this point, India will need to start small, such as ships of 500 gross tonnage and above. The bottleneck is that while terming ship newbuilds as infrastructure has brought down the cost of finance through lower interest rates and extended repayment schedules, this applies only to large vessels. Incentives to promote shipbuilding will need to include long-term offtake possibilities. Indian shipowners do not see long-term demand visibility for them to invest in newbuilds in Indian yards with cost overruns from delays. For instance, India’s green fuel production policy has seen projects to make and export green fuels through Kakinada and Kochi but without leveraging them to build green ships and do the offtake as well. Long-term shipping contracts and time charters, for imported coal from State-owned power utilities and imported crude from oil companies, will spur shipbuilding. Published - September 27, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        shipbuilding\n                    \n                            /                      \n                        \n                        waterway and maritime transport\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        green technologies\n                    \n                            /                      \n                        \n                        Kochi\n                    \n                            /                      \n                        \n                        coal\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities",
        "headline_1": "Upgrading shipyards: On strengthening India’s shipbuilding infrastructure",
        "headline_2": "Incentives for shipbuilding must include long term offtake possibilities",
        "link": "https://www.thehindu.com/opinion/editorial/upgrading-shipyards-on-strengthening-indias-shipbuilding-infrastructure/article70098292.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "Three successive Sundays featuring matches involving India and Pakistan are a broadcaster’s windfall dream. This rare cricketing high will be played out when the sub-continental rivals clash in the Asia Cup final at Dubai this Sunday (September 28, 2025). Interestingly, since its inception from 1984, the continental tournament never featured an India-Pakistan summit clash. However, the latest prelude remains dull as the contests over the last two weekends lacked sporting thrills even if the political tension almost bordered on the ‘war minus the shooting’ trope. Suryakumar Yadav’s men overwhelmingly dominated the jousts, yet dimmed their glory as they remained churlish and refused the customary handshake with the opposition, a tradition innate to the willow game and other sports. The Pahalgam terror strike and the resultant Operation Sindoor are part of the backdrop, but if India felt strongly about playing against its western neighbour, then the protest could have been registered by refusing to turn up for these particular games. But walking into the park, playing the match and still refusing to respect the game’s behavioural protocols do not reflect well on the Indian unit. That there is no escaping the nationalism bandwagon and the ensuing domestic pressures was evident in the manner in which some of the Pakistani players gesticulated.Pakistani stars Sahibzada Farhan and Haris Rauf are in the dock with the former using his bat like a gun and the latter hinting at fighter planes being shot down. Meanwhile, Suryakumar’s reference to Pahalgam also came under the scanner. In all this high-strung theatre of anger, India still proved its superior mettle against all rivals, a skill-advantage that was reiterated twice against Pakistan. Opener Abhishek Sharma has been at his riveting best, and his scalding form has forced the opposition bowlers to constantly alter their tactics. His Punjab mate Shubman Gill has also flourished against the men from across the Wagah border. Among the bowlers, even if spearhead Jasprit Bumrah draws attention, spinner Kuldeep Yadav has been in his elements on the dry, abrasive surfaces under West Asian skies. The dip in quality of Indo-Pak tussles is a contrast to the 1980s and 1990s when the games were contested on an even keel. For Indian fans of a certain vintage, Javed Miandad’s last-ball six off Chetan Sharma remains a bruise that never heals. The current Asia Cup has revealed how far India has progressed while Pakistan, Bangladesh and Sri Lanka have stagnated. This Sunday, defending champion India will step in as the favourite unless Shaheen Afridi and his fellow pacers spring an ambush.\r Published - September 27, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        cricket\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Asia Cup Cricket\n                    \n                            /                      \n                        \n                        United Arab Emirates\n                    \n                            /                      \n                        \n                        Operation Sindoor 2025\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025",
        "headline_1": "Bloody Sundays: On cricket, the Asia Cup, India-Pakistan rivalry",
        "headline_2": "Cricket is getting overshadowed by India-Pakistan political rivalry",
        "link": "https://www.thehindu.com/opinion/editorial/bloody-sundays-on-cricket-the-asia-cup-india-pakistan-rivalry/article70098456.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "By Muni Pranamyasagar\nIn the infinite rhythm of existence, nothing happens without a cause, and nothing disappears without leaving its trace. Karm and rebirth are not two separate truths – they are two pulses of the same eternal heartbeat. Without karm, there can be no rebirth; without rebirth, karma remains incomplete. Birth itself is not an accident. The body may be formed by the union of mother and father, but the light of consciousness that animates it is carried forward from the karmic impressions of past lives. These impressions, sanskars, travel with the soul like a subtle fragrance, unseen yet unmistakable. This is why a newborn instinctively knows to drink milk without being taught. Such instincts are not lessons of this life; they are the memories of a journey before this beginning. To deny rebirth is to deny the soul and the law that governs it. If fruits of our actions were confined only to the present life, the moral order of the universe would collapse.\nWhy strive for goodness when evil often seems to bring immediate pleasure, and noble deeds might lead to suffering? Law of karm assures that every cause finds its effect even if it takes lifetimes to unfold.\n\nLook at the world. Differences in skill sets are not random; they are blossoming of seeds sown before. The body is shaped by biology, but the life within it is shaped by karm – by the subtle vibrations created through our thoughts, words, and deeds. Karm works through what may be called chain and change. The chain preserves continuity of the soul’s journey; change arises through new karmas we create in each moment.\nWe may not see our past lives or the ones yet to come, but we are in the middle of a long, unbroken sequence, preceded by countless yesterdays and followed by countless tomorrows, until we attain liberation.\nTo reject karm and rebirth is to invite moral emptiness. Without the knowledge that every action will return, there is no true reason to cultivate patience, compassion, or restraint. But when this truth is accepted, life becomes more deliberate. One begins to act not for immediate gain, but for the purity and freedom of the soul.\nRebirth is not punishment; it is an opportunity to attain Self-realisation. It is the continuation of our journey towards liberation. Each life is a classroom where old karms can be burnt and new, nobler ones can be sown like seeds that blossom in future. The cycle ends only when all karmic bonds are dissolved and the soul shines in its original, pure, and blissful state. Thus, karm, rebirth, and the soul form an inseparable triad. Ignore one, and the whole structure collapses. Recognising this truth transforms how we live – making each action conscious, each choice meaningful, and each moment a step towards liberation. Life is not a single page; it is a vast scripture written across lifetimes. And the ink is karm. What we write today will be the story we live tomorrow.\n\n",
        "headline_1": "Law of Karm: Every cause finds its effect",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/law-of-karm-every-cause-finds-its-effect/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "GOI must engage protesters, even if they demand a lot\nExplanations for “the bloodiest day” in Ladakh remain sharply divided between govt and protesters. But one thing on which there should be consensus is what BJP leader and former Ladakh MP Jamyang Tsering Namgyal has written in his letter to the Lt Governor, “Ladakh stands at a fragile juncture.” The mood in the Himalayan desert region has darkened a lot since it became a separate Union Territory after the abrogation of Article 370. At the time, Namgyal himself gave such a passionate parliamentary speech welcoming these developments that it went viral. Engineer-innovator Sonam Wangchuk, who inspired 3 Idiots, also welcomed them heartily. Wangchuk has now been arrested, with govt linking Wednesday’s mob violence and arson to his “provocative” speeches.27\nNone of this, of course, explains why four unarmed protesters died with multiple bullet wounds that day. Even those who don’t appreciate how Wangchuk’s been talking up a Gen-Z revolution of the Nepal type in Ladakh, should recognise that over-strong police action is the opposite of a solution in this case. Yes, the big local asks of both statehood and inclusion in the Sixth Schedule are difficult to meet. With its 3L population Ladakh has zero chance of getting statehood when it’s still denied to J&K. As for the Sixth Schedule, no govt, whatever its political stripe, is likely to open this Pandora’s box. If it did, Manipur would be ahead of Ladakh in the line. But GOI has a time and tested way of walking situations back from crisis, which is to really get into engage mode.\nGovt told a parliamentary committee this year that none of the 1,275 gazetted posts in Ladakh have been filled since 2019. Wangchuk and others’ talk of Ladakh becoming another Tibet is of course utter nonsense – one is without even a fraction of persecution of the other. But Ladhakis’ fears of becoming climate refugees are connected to real environmental vulnerabilities that need to be taken very seriously. Hearing and calming by the Centre is the need of the hour.\n\n",
        "headline_1": "Listen To Ladakh",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/listen-to-ladakh-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "Trump tariff on pharma is a nudge to diversify markets\nIt isn’t clear whether Trump’s 100% tariff on imported “branded or patented” drugs will affect India, but markets turned cautious on Friday. Pharma stocks fell between 1% and 5%. The tariff isn’t entirely unexpected – Trump has been talking about imposing it since April. In July, he threatened to tax imported pharmaceuticals at 200%. In Aug, he said the tariff could go up to 250%. What stumped the market was the timing, as he had earlier hinted at starting with a “small tariff” and peaking in 12 to 18 months.\nThe impact on India will depend on how “branded” is interpreted. US is India’s biggest pharma market, buying roughly $10bn worth of drugs last year. But these are largely low-cost generics, including drugs for cardiovascular and neurological disorders. Experts believe these off-patent formulations – even if shipped under a brand name – may be exempt from the new tariff. However, clarity on this point will emerge only after US issues enforcement rules.\nFor Trump, making US aatmanirbhar in medicines has been a priority since his first term. According to a White House release, US makes 40% of its finished drugs, but the share of locally made APIs is just 10%. This explains the exemption offered to pharma firms setting up plants in US. But the abruptness of Trump’s decisions – like with H-1B visas last week, and the penal tariff on India in July – is unsettling. Countries like Ireland, Switzerland, and Germany, which supply high-value branded and patented drugs, will clearly bear the brunt of his latest tariff. But if branded generics are also taxed, 40% of India’s pharma exports will be at risk. Even if Indian generics are spared for now, Trump’s sword will hang over them. So, the search for new markets should begin immediately.\n\n",
        "headline_1": "Vitamin T",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/vitamin-t/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "What the life of tree teaches us on survival strategies\nHumans can brag about their ability to control nature, but the reality is we’re powerless in the face of heatwaves, floods, wildfires and natural phenomena. Survival needs collective strategies against threats – and mutual aid goes beyond the species barrier. \nThat’s what forests show us. Collaborate amid competition. Collaborate across species. But humankind, writes Laurent Tillon in Being An Oak: Life as a Tree, “resists co-evolution with the microbes that have shaped us into our species, consciously risking gradual decline in collective immunity through isolation and excessive sterilisation.”\nBut we get ahead of the story – the story of Tillon’s oak, his friend and confidant. Of discovering who the tree – at least 240 years old – is, in forest Silva, near Paris. The tree that showed Tillon the nature of nature – challenges in sourcing nutrients, the fight to grow tall, keeping the canopy safe, and competing and coexisting with a million creatures – plant, animal and microbe. It’s never easy. It’s never hopeless either. \nAn intricate lattice of stories with incredible detail shows the oak’s relationships with other trees, beetles, woodpeckers, salamanders, foragers, lizards, wolves, and humans. “Trees that live in a community make up a super organism whose powers are immeasurable”, Tillon writes.\nBy the 17th century, oaks provided wood for building boats, to meet maritime ambitions of King Louis XVI, also the first to engage in ‘forest management’. Over centuries, railways, cities, industry – all needed wood from the forest. This oak’s life was at risk from the minute it was born, around 1780, an acorn, with a plantlet and a radicle inside, organs provided by the parent oak. \nA fieldmouse grabs and runs with the acorn as it falls to the ground as winter loot – only to forget about it. A good crop of acorns means field mice eat up all the acorns, damaging them, the abundance driving them nuts. So the oaks pull back on producing acorns the next season. Rodents’ population plunges – the plant world, says the book, outwits/ fools the animal – a phenomenon called ‘masting’. That’s just one strategy. \nOnce the acorn strikes root, it is rooted for the rest of its life. Tillon’s oak can’t move at all. “This will be his calling for the rest of his life”. Roots don’t grow randomly – “the tip of each is a veritable homing device. Nothing happens by chance.” It’s not that the oak gives an order, but in chemical and electrical messages still a secret to scientists, stimuli are received for roots to head downwards and a plantlet to vie towards light. Caterpillars time their emergence from eggs when the oak is about to bud. Yet the oak’s branches too appear to hold off on budding – to make it harder for caterpillars to attack.\nThe young oak knows the approach of fungi is an act of aggression, but local “bacterial diplomacy” ensures all three strike up a relationship of nutrient and information exchange, to signal deficiency and danger, for all time to come. These early “breach in defences” only help the oak mount an efficient immune response against attacks through its life. Collaboration and a perpetual learning of strategies – relationships within competition.\nThat’s the lesson for humans.\n\n",
        "headline_1": "Oak Culture & Humans",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/oak-culture-humans/",
        "news_paper_name": "The Times of India",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "Nobody in the world today—or since the end of the Second World War—perhaps resembles Adolf Hitler as Benjamin Netanyahu does. The genocide carried out by Hitler against the Jews is now being replicated by Netanyahu in killing the Palestinians, with the death toll from the ongoing war itself nearing 66,000, many among them children. The label given to him by many—\"child killer of the century\"—is richly deserved. He is now systematically targeting the surviving people of Gaza through mass starvation and blockade.\nAmid this heartbreaking reality, a slight ray of hope is the unprecedented coming together of the international community behind the Palestinian cause. The recent walk-out of most UN delegates when Netanyahu rose to speak marked the global disgust at Israeli actions personified by its prime minister. Colombia's President Gustavo Petro called for the formation of an international army \"as an integral part of humanity, to bring together weapons and armies to defend Palestine.\" Chile's President Gabriel Boric demanded that Netanyahu and his team be brought before an international court of justice for genocide. Slovenia's president called for an immediate stop of the genocide. Earlier, with recognition by the UK and France, four out of the five UN veto power countries—UK, France, Russia, and China—recognised the Palestinian state, along with 157 out of 193 UN members.\nIn many ways, however, this massive UN and veto-power support for Palestine remains largely symbolic, as no one has been able to stop the daily genocide. Realism dictates that without the involvement of the United States, meaningful action is unlikely. Here, the partial good news is that President Trump has declared the US will \"not allow\" the Israeli plan to occupy the West Bank. We urge him to use the same authoritative language to immediately halt the killing of the people of Gaza.\nAmid these developments, the BBC and The Economist have reported on the possibility of the formation of a \"Gaza International Transitional Authority\" headed by former UK premier Tony Blair, with \"supreme political and legal authority\" for five years, after which full authority would revert to the Palestinian Authority in Ramallah, West Bank. This plan, rather than restoring the rights of the Palestinian people, seeks Western concentration of power for five years, but to do what, really? Given Mr. Blair's controversial role during the Iraq invasion—where he supported the justification of war based on false claims of WMDs—and his unsuccessful tenure as the Quartet's special envoy for the Middle East between 2007 and 2015, he is hardly a person to be entrusted with the future of Gaza. Besides, the Tony Blair Institute's alleged links with the controversial \"Riviera\" project in Gaza, floated by President Trump, raises serious conflict-of-interest concerns.\nThe most urgent actions needed now are stopping the genocide immediately; forcing Israel to cease killing Palestinians in Gaza and the West Bank; ending the supply of lethal and offensive weapons to Israel; and recognising the Palestinian state by truly re-enforcing Palestinian rights. Only after delivering on those can the world consider a political setup for a transitional authority. Here, President Trump has an opportunity to earn a place in history by bringing about a fair and just deal for the Palestinians. Will he do that?\n",
        "headline_1": "Gaza genocide calls for decisive, not symbolic, response",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/gaza-genocide-calls-decisive-not-symbolic-response-3996111",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "Today, the world observes World Tourism Day with the United Nations World Tourism Organization's theme, \"Tourism and Sustainable Transformation.\" For Bangladesh, this is more than a ceremonial event. It is time to ask the question: can we sail confidently into a sustainable tourism future while safeguarding our heritage and empowering our people?\nBangladesh holds treasures admired worldwide. From the mystical Sundarbans to the seemingly endless Cox's Bazar beach, from the tea valleys of Sylhet to vibrant cultural traditions, the country is richly endowed. Yet, while our neighbours thrive on tourism as a significant economic driver, this sector's contribution to our GDP remains modest—only three percent in 2024. By contrast, Thailand generated nearly 8.9 percent of its GDP from tourism in 2024, employing millions. Sri Lanka, despite its economic turmoil, earned $328.3 million in revenue in 2024. Even Nepal, with fewer infrastructural resources, attracted over 1.1 million tourists, relying on trekking, eco-tourism and heritage sites. Clearly, the issue in Bangladesh is not a lack of assets but how those assets are managed.\nOur current approach often prioritises numbers over quality. During Eid holidays, the surge of visitors to Cox's Bazar or Srimangal brings congestion, pollution and disappointment. Instead of strengthening our reputation, such unmanaged growth risks damaging it. Consequently, the very resources that attract tourists are strained. This is why sustainable transformation is not optional; it is essential if Bangladesh wishes to remain competitive.\nMoreover, sustainability is more than an environmental issue; it is a survival imperative. Bangladesh is among the most climate-vulnerable countries in the world. Rising seas threaten our coasts, while salinity intrudes into the Sundarbans. If we allow unchecked construction, plastic waste and over-tourism, we will accelerate the risks of losing our natural resources. Besides, global travellers are becoming more discerning. Increasingly, they seek eco-friendly destinations and authentic cultural encounters. If Bangladesh fails to adapt, it risks being sidelined in the global tourism market.\nThe question then becomes: how do we chart a course towards sustainability? At least three directions deserve attention.\nFirst, green tourism development must be prioritised. Eco-resorts powered by renewable energy, hotels with global green certifications and strict conservation measures are essential. St Martin's Island illustrates the urgency; without limits on visitors and bans on single-use plastics, its fragile ecosystem may collapse. Countries like Nepal, which utilise conservation fees from trekking in the Annapurna region to fund both environmental protection and community welfare, offer relevant models.\nSecond, tourism must become community-centred. The benefits should not flow only to large investors but also to ordinary people. Imagine homestays in the Chittagong Hill Tracts where tourists experience indigenous culture firsthand, or festivals in rural Bangladesh where Baul music and crafts are celebrated. Such initiatives preserve traditions while generating income. Importantly, women and youth can emerge as entrepreneurs in tour guiding, handicrafts and hospitality. Sri Lanka's tea plantation tours and Nepal's village homestay networks show how communities can successfully drive tourism.\nThird, Bangladesh must embrace digital and policy transformation. A national tourism app could showcase maps, heritage stories and multilingual booking systems, while cashless transactions and e-tickets would modernise travel. Yet, technology alone is insufficient without policy. Stronger regulations are needed to curb coastal overdevelopment, reduce pollution and manage visitor flows in fragile destinations. Here, Bhutan's \"high-value, low-impact\" model is instructive: by controlling numbers and emphasising sustainability, Bhutan has positioned itself as a global leader in responsible tourism.\nTaken together, these pathways highlight that transformation is not a luxury—it is the only way forward. If appropriately managed, tourism can become a third pillar of the economy, alongside garments and remittances. It can diversify growth, create jobs and strengthen \"Brand Bangladesh\" internationally. By focusing on sustainability, we can reposition ourselves not as a budget destination, but as a nation renowned for its natural beauty, cultural richness and responsible hospitality.\nUltimately, this year's World Tourism Day is more than a commemoration. It is a mirror held up to us, asking whether we are ready to balance growth with responsibility. If we invest in green practices, empower communities and embrace digital innovation, we can transform tourism into a source of resilience and pride. But if we continue on the current path, we risk losing the very treasures that make Bangladesh extraordinary.\nThe answer to whether Bangladesh can sail into a sustainable tourism future lies in our collective choices today. Policymakers must create stronger frameworks, businesses must adopt greener models, and communities must be empowered to lead. Above all, we must see tourism beyond recreational purposes. It is a reflection of who we are and the future we want to build. The Sundarbans, Cox's Bazar, and Sylhet, as well as the country's cultural traditions, are our living legacies. If we protect and nurture them, tourism will not only thrive but also transform Bangladesh into a global example of sustainable progress.\nDr Mohammad Shahidul Islam is associate professor of marketing at BRAC Business School in BRAC University. He can be reached at [email protected].\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Can we transform tourism into a national strength?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/can-we-transform-tourism-national-strength-3995751",
        "news_paper_name": "The Daily Star",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 28, 2025 00:00:00  \nThe new guidelines issued by the Financial Institutions Division for incentive bonuses of state-owned banks and financial institutions are driven as much by the aim of linking rewards to actual performance as by the broader need to bring discipline and accountability to a troubled sector. For a long time, these banks and financial institutions (FIs) have been weighed down by mounting loan defaults and losses that were often glossed over in polished audit reports. However, the July uprising of last year shattered this facade and exposed how bad things truly were. Reports revealed that state-owned and specialised banks were drowning in non-performing loans, short on capital and riddled with money laundering scandals disguised as loans. Yet, even as these losses piled up, officials of some of the same banks and FIs were receiving multiple incentive bonuses in violation of existing rules. This was seen as unfair and offensive to the public, especially when ordinary depositors and taxpayers were paying the price for the sector's failures. The new guidelines for 2025 are meant to correct this practice by making incentive bonuses strictly dependent on performance across all state-owned and specialised banks and FIs.\nIt is indeed commendable that through these new guidelines the Financial Institutions Division (FID) has sought to rein in past excesses, such as instances where banks awarded as many as five incentive bonuses in a single year. Under the new arrangements, state-owned commercial banks must now meet five performance benchmarks including net profit rate, deposit growth, loan growth and recovery rates before bonuses can be approved. Specialised and non-scheduled institutions face similar, though in some cases fewer, criteria. This is undoubtedly a positive change. After all, incentives should be earned, not simply handed out, because they encourage officials to work harder to improve the health of their institutions. When a bonus depends on recovering bad loans, employees have a direct reason to prioritise this critical task. Such a system helps build a culture where rewards are tied to real results, which is a necessary step toward restoring public trust in these banks. \nIronically, the new rules also keep a provision for ex gratia payments which allow banks to pay an extra month's basic salary even when they fail to meet the criteria. This mechanism fundamentally dilutes the strictness of the performance rules, making one to question the purpose of rigorous targets if a safety net is always there. In a sector where many institutions are technically insolvent and survive on government bailouts funded by taxpayers, such ex gratia payments are deeply inappropriate. They risk turning bonuses into consolation prizes for poor performance, or worse, rewards for failure, and could pave the way back to the old practice of awarding incentives regardless of results. \nThat's why the FID's initiative, while a move in the right direction, requires immediate and decisive refinement. To be effective, bonuses must reflect genuine performance, not political favour or the fictional gains of creative accounting. The provision for ex gratia payments in particular has no place in a struggling banking system and must be abolished. Furthermore, transparent reporting mechanisms are essential to prevent a return to the arbitrary practices of the past. The ultimate goal is a strong, stable and publicly trusted banking sector. To achieve this, the government and regulators must ensure that every incentive payment is tied to clear, verifiable results. Only then can bonuses function as tools for improvement rather than symbols of waste, allowing state-owned banks to begin the essential work of restoring discipline, credibility and long-term stability.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Ending the culture  of free bonuses",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/ending-the-culture-of-free-bonuses-1758983458",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Asjadul Kibria   |  \n       September 28, 2025 00:00:00  \nNotwithstanding a significant strain in relations, bilateral trade between Bangladesh and India witnessed a modest rise in the last fiscal year, reflecting the reciprocal reliance on each other for sourcing various goods for domestic consumption. It also indicates that long-term trading partners cannot abruptly end their partnership, despite deterioration in the bilateral relationship and an increase in the frequency of disputes. \nIndo-Bangla bilateral trade increased by 6 per cent to US$11.24 billion in FY25 from $10.57 billion in FY24. The bilateral trade reached its highest level at $15.68 billion in FY22, mainly due to a big surge in imports from India, and it declined to $11.26 billion in FY23. Both exports to and imports from India increased in the last fiscal year, which also widened the trade gap with India. Export increased to $1.77 billion in FY25 from $1.57 billion in FY24, whereas imports from India stood at $9.44 billion and $9.0 billion, respectively. \nAfter the fall of the autocratic regime of Hasina in August last year in the face of student-led mass uprising, Bangladesh and India's bilateral diplomatic relations deteriorated significantly for obvious reasons. During her 15-year regime, Hasina in exchange for securing full backing to stay in power had offered all possible concessions to India. The July uprising, however, changed the calculation, although to curb the movement, the Hasina regime resorted to the use of brutal force, killing 1,400 people in less than three weeks. More than 20,000 people were also injured. Nevertheless, she was forced to resign on August 5 last year and flee to New Delhi for shelter.\n\nBesides providing shelter to Hasina for her loyalty in advancing Indian interests for more than a decade, the Modi-led Indian government has initiated several steps to exert pressure on the Yunus-led interim government in Bangladesh. Restricting exports to India by making it costlier is a key tool in this connection. For instance, India cancelled the transhipment facility granted to Bangladesh for third-country exports using Indian sea routes and airports. The country also imposed restrictions on imports of certain products, including ready-made garments (RMG), from Bangladesh, primarily to the north-eastern states of India via land routes. Through these measures, New Delhi expressed its dissatisfaction with the political changeover in Bangladesh and has yet to accept the new reality. \nNew Delhi is also unresponsive to Dhaka's repeated requests to discuss trade-restrictive measures. Instead, there is a hint from India that it is likely to impose more trade restrictions in the near future to mount pressure on Bangladesh. \nSo, what drives the modest increase in bilateral trade, especially the rise in exports to India from Bangladesh, in the last fiscal year? At least three major factors are behind the increase in exports to India from Bangladesh. \nFirstly, most of the trade restrictions have been imposed by India in the last quarter of FY25. So, the negative impacts of the restrictions are yet to be visible at the macro level.\nSecondly, most exporters want to maintain their market share in India. Therefore, they shifted to sea routes after India restricted exports through land routes for RMG and other products. By exporting products through the Nhava Sheva port in Mumbai (western India) and the Kolkata port in West Bengal (eastern India), they incur an additional 10 per cent cost. Nevertheless, Indian importers are still able to obtain the product at a competitive price. \nThirdly, during the last fiscal year, the Bangladesh taka against the US dollar depreciated by around 3.90 per cent. At the same time, the Indian rupee appreciated by around 0.90 per cent against the greenback. These currency fluctuations, which are often overlooked, also played a role in the modest increase in export earnings. \nHowever, it's important to note that jute and jute goods have been severely affected by India's imposition of restrictions and non-tariff barriers (NTBs). Previously, jute could be exported through both land and sea ports. But in the last month, India banned imports of jute products from Bangladesh through land ports, allowing only the Nhava Sheva port in Mumbai. This has led to a significant drop in jute exports to India, almost to zero. \nOther products, such as food items, plastics, and wooden furniture, have also been subject to restrictions. Indian importers are now only allowed to import these products through a limited number of land ports. For instance, land ports and customs stations near the borders of north-eastern Indian states like Assam, Meghalaya, Tripura, and Mizoram are no longer permitted to ship these Bangladeshi products. \nImports from India posted a modest growth of five per cent in the last fiscal year, when there were almost no restrictions on imports from India, except for rice, onions, and a few food items. The Indian government withdrew the export suspensions on onions in the last month. Bangladesh also allowed duty-free imports of rice from India in the last month. In the last week, India, however, imposed a new condition on exporting non-basmati rice from India. \nFor Bangladesh, it is not easy to import many raw materials and intermediate goods from a third country other than India due to the high cost. Geographical proximity makes the imports from India faster and competitive. Only some of the products may be possible to import from China if India also imposes restrictions. Already, China is the largest source of imports for Bangladesh, and in the last fiscal year, imports from China jumped by 9 per cent after a decline of 6 per cent in FY24. It is also unlikely that India will impose stringent conditions for exporting a large number of products to Bangladesh in the near future, as this would also hamper its export earnings. New Delhi may, however, continue to put various trade restrictions on a limited scale to increase the cost of trade for Dhaka. The move night be driven more by resentment than economic considerations. \nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Bangla-Indo trade sees modest rise despite restrictions",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/bangla-indo-trade-sees-modest-rise-despite-restrictions-1758983565",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       September 28, 2025 00:00:00  \nIn a country where agriculture remains the mainstay of the economy, the steady erosion of farmland is a cause for serious concern. An increasing number of farmers are losing their land and livelihoods as arable areas shrink under the combined pressures of climate change, rapid population growth, unplanned urbanisation, and industrialisation. According to the Bangladesh Bureau of Statistics, the country lost 1 per cent of its net cropped area in just three years, declining from 20.08 lakh acres in 2020 to 19.83 lakh acres in 2023, the sharpest fall in a decade. If this alarming trend continues unchecked, Bangladesh risks losing all its arable land by the end of this century. Immediate and effective measures are therefore imperative to curb unplanned development and protect the agricultural base that underpins national survival.\nAgricultural experts have long warned that while industrialisation and urbanisation are essential for growth and job creation, indiscriminate grabbing of farmlands directly threatens food security. The interim government seems to have recognised the urgency. Agriculture Adviser Lt Gen (retd) Md Jahangir Alam Chowdhury recently announced that a farmland protection ordinance is being drafted with strict provisions against violations. \"Cultivated land must not be destroyed under any circumstances. Construction of structures will be prohibited on land used for two or three crop cycles,\" he said at an event in Dhaka. The plan also includes a crop zoning map to improve land-use planning. These steps are promising, but unless rigorously enforced, they risk meeting the same fate as earlier policies, with farmland continuing to fall prey to public projects, private resorts, and real estate ventures.\nLegal protection alone will not suffice. People must also be given viable alternatives so they are not compelled to encroach upon farmland for housing or other purposes. A key solution lies in promoting vertical housing in both rural and urban areas. Building upward rather than outward can preserve cultivable land, while incentives, proper planning, and affordable financing schemes can make high-rise housing more accessible to the wider population.\nAt the same time, boosting agricultural productivity is essential. Despite declining farmland, Bangladesh has tripled its food production over the past five decades, thanks to research, high-yielding crop varieties, and the gradual adoption of modern technologies. However, the country still lags behind its regional peers such as India, Pakistan, and Sri Lanka in crop yields, particularly in Boro rice, which dominates national production. Closing this productivity gap will require greater investment in agricultural research, wider dissemination of technology, improved irrigation systems, and targeted support for small farmers. Alongside, policies must encourage crop diversification and the cultivation of nutrient-rich foods to ensure a balanced and secure food supply for a growing population.\nFinally, no strategy for protecting farmland can succeed without addressing the root cause - unchecked population growth. Overpopulation not only adds millions of extra mouths to feed but also exerts relentless pressure on land, water, and other scarce resources. For a resource-constrained country frequently battered by natural calamities, controlling population growth is a prerequisite for sustainable development. The work of the National Population Council must therefore be revitalized. Strict vigilance by RAJUK and all city corporations is essential to prevent unplanned construction and industrial sprawl.\nBangladesh cannot afford to lose any more farmland. Protecting agricultural land must be treated as a matter of national security, tied to food self-sufficiency, economic resilience, and the very survival of future generations. The Farmland Protection Act, with strong enforcement and complementary measures, brooks no further delay.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Farmland protection  act brooks no delay",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/farmland-protection-act-brooks-no-delay-1758983703",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 28, 2025 00:00:00  \nWorld Pharmacists Day 2025 was observed worldwide on September 25 under the theme \"Think Health, Think Pharmacist.\" On this occasion, it is worth reflecting on the often-overlooked contribution of pharmacists in our healthcare system.\nTake the example of Dhaka Medical College Hospital. Every day, thousands of patients queue at its outpatient pharmacy. Medicines are dispensed with proper instructions on use, side effects, and precautions. Yet, the professionals performing this crucial work remain largely unrecognised. Many assume they are ordinary pharmacy clerks, but in fact, they are registered diploma pharmacists-graduates of a rigorous four-year programme under the Bangladesh Pharmacy Council.\nEach year, 1,000-2,000 diploma pharmacists graduate from 57 institutions. Admission requires a science background with biology and a minimum GPA of 3.00, followed by an entrance test. The course is taught in English, graded under the CGPA system, and demands a 60% pass mark-far stricter than most other diploma courses. Despite this, pharmacists enter government service in the 11th grade, while engineers, nurses, and agriculturists with comparable qualifications secured the 10th grade long ago. Proposals to upgrade pharmacists remain stalled in bureaucratic files.\nRecruitment is another source of frustration. In a 50-bed Upazila Health Complex, at least five pharmacists are needed to manage pharmacies, NCD corners, vision centres, and stores. Yet only two posts exist. District hospitals and medical colleges face the same shortage-where thousands of patients are served daily by just four or five pharmacists. To make matters worse, medicine distribution is often handled by non-pharmacists, violating both the Pharmacy Ordinance of 1976 and the Drugs and Cosmetics Act of 2023.\nThe mismatch between demand and policy is stark. If one pharmacist post was sanctioned for every ten beds, services would improve while reducing unemployment among qualified pharmacists. Moreover, unlike other diploma holders, pharmacy graduates have no structured path to higher education. The introduction of a B.Pharm programme at Bangabandhu Sheikh Mujib Medical University or the Institute of Health Technology could solve this gap.\nOn this World Pharmacists Day, it is essential that the government recognises the neglected role of diploma pharmacists. Their expertise is indispensable for safe, effective, and lawful healthcare delivery. Proper evaluation, fair pay scales, adequate recruitment, and opportunities for higher education are long overdue.\nMotasim Billah Munna\nPharmacist (Diploma) \nmotasimmunna96@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Pharmacists' role neglected",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/pharmacists-role-neglected-1758983760",
        "news_paper_name": "The Financial Express",
        "publish_date": "28-09-2025"
    }
]