[
    {
        "full_article": "The 25% tariff “plus penalty” on imports of Indian goods in the United States, announced by President Donald Trump, should have come as no surprise to India. Mr. Trump has, for a while now, been voicing his displeasure at India’s dealings with Russia, with regard to energy dealings and military equipment. He has also been quite vocal about India’s high tariff and non-tariff barriers. These were the reasons he cited in his announcement on Wednesday. Add to this these facts — first, U.S. Trade Representative Jamieson Greer, as recently as Monday, had said that a trade deal with India needed “some more negotiations”, and second, Indian Commerce Ministry officials had stopped talking about a mini-deal for a while now. Thus, the writing on the wall was pretty clear: a deal before August 1 was not in the offing. The only uncertainty in this mix was the mercurial Trump, but he has finally made his position clear. However, while there was an expectation that a mini-deal would not materialise, something does seem to have shifted in India-U.S. relations. This is showing up now in Mr. Trump’s language — as a snide remark on Thursday about Pakistan selling oil to India in the future, or he, even more recently, calling the Indian economy “dead”. Whether this was him venting his frustration at not being able to secure a deal with India — after calling himself the “Dealmaker in Chief” — or whether something else has triggered him is not clear yet. The fact is that both sides have not budged from their core policies. The U.S. wants India to reduce its tariffs and provide market access across the board and India has held firm about ring-fencing agriculture and dairy.All of this makes negotiating a potential bilateral trade agreement (BTA) that much more complicated. Where government officials have constantly changed deadlines for a mini-deal, they have been remarkably consistent about meeting the Fall deadline for the BTA. But now Mr. Trump has linked India’s dealings with Russia to India’s trade relations with the U.S. Who India does business with is a sovereign matter, and the Ministry of Commerce and Industry rightfully reiterated its commitment to securing India’s national interest. On the other hand, the U.S. accounts for around a fifth of India’s exports. The 25% tariffs plus a yet-unknown penalty places India at a relative disadvantage when compared to competitors such as South Korea, Indonesia, Malaysia, the Philippines and Vietnam. Trade associations representing several sectors have already voiced their concern. Indian negotiators will have to work doubly hard to conclude an acceptable deal. Published - August 01, 2025 12:30 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        taxes and duties\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        Russia\n                    \n                            /                      \n                        \n                        energy and resource\n                    \n                            /                      \n                        \n                        defence equipment\n                    \n                            /                      \n                        \n                        military equipment\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        oil and gas - upstream activities\n                    \n                            /                      \n                        \n                        Malaysia\n                    \n                            /                      \n                        \n                        Philippines\n                    \n                            /                      \n                        \n                        Vietnam\n                    \n                            /                      \n                        \n                        engineering\n                    \n                            /                      \n                        \n                        jewelry\n                    \n                            /                      \n                        \n                        pharmaceutical\n                    \n                            /                      \n                        \n                        ministers (government)\n                    \n                            /                      \n                        \n                        agriculture\n                    \n                            /                      \n                        \n                        dairy\n                    \n                            /                      \n                        \n                        South Korea\n                    \n                            /                      \n                        \n                        Indonesia",
        "headline_1": "​Soured relations: On Trump’s 25% tariff, ‘penalty’",
        "headline_2": "The higher U.S. tariffs place India at a relative disadvantage",
        "link": "https://www.thehindu.com/opinion/editorial/soured-relations-on-trumps-25-tariff-penalty/article69878531.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "The GSLV-F16 mission lifted off from Sriharikota on July 30, placing the NASA ISRO Synthetic Aperture Radar (NISAR) satellite into a sun synchronous orbit. The ascent capped a decade-long bilateral effort and opened a new phase in global earth observation cooperation. NISAR is a 2.8-tonne observatory that combines a NASA-built L-band radar with an ISRO-made S-band radar — also a first. They allow NISAR to detect surface changes measuring only a few centimetres, even through clouds and vegetation. NISAR will supply freely accessible data on ground deformation, glacier flow, biomass, land use changes, and sea ice dynamics. As its dawn-dusk orbit repeats every 12 days, its radars will be able to revisit the same point under nearly identical lighting conditions. This geometry, coupled with a duty cycle exceeding 50% in the L-band, has been designed to yield closely spaced time series observations that can quantify geological processes. Indeed, its various engineering firsts lead up to NISAR’s unusually broad science agenda: map mangrove extent, urban subsidence, crop-soil interactions, and calving rates in polar ice shelves in a single orbital cycle. Its data could help support the Sendai Framework on reducing disaster risk and refine IPCC models.For ISRO, flying a flagship payload on the GSLV Mk II rocket is notable for a vehicle once dubbed “naughty boy” for its early-career setbacks. The ISRO-NASA partnership would also have eased technology transfer between the two countries. Developing the S-band radar would have demanded tighter tolerances in radiofrequency electronics, thermal stability, and data throughput than previous Indian satellites. From a diplomatic standpoint, the launch confirms that India can be trusted with high-value hardware and demanding integration schedules, although it is still learning to shape joint missions on equal terms. The 12-metre reflector, the Ka band downlink, and much of the flight software stack were imported, and the key design reviews were led by NASA. Achieving parity will require larger domestic investments in advanced materials, deep-space communications, and systems engineering plus earlier Indian involvement in framing the scientific agenda of future multilateral missions. NISAR’s data downlink rate also presents a challenge. ISRO must expand its Ka-band ground network, automate cloud-based processing, and release analysis-ready products within hours if state agencies are to make timely use of the data. Sustaining the time-wise data will also depend on authorising follow-on SAR spacecraft before 2030 and finalising data-sharing rules that encourage private analytics while protecting sensitive scenes. Addressing these gaps will determine how fully NISAR’s potential is realised in India. Published - August 01, 2025 12:15 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        ISRO\n                    \n                            /                      \n                        \n                        nasa\n                    \n                            /                      \n                        \n                        satellite technology\n                    \n                            /                      \n                        \n                        space programme\n                    \n                            /                      \n                        \n                        geology\n                    \n                            /                      \n                        \n                        engineering\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        USA",
        "headline_1": "New phase: On the NISAR mission",
        "headline_2": "NISAR capped a decade-long bilateral effort of NASA and ISRO",
        "link": "https://www.thehindu.com/opinion/editorial/new-phase-on-the-nisar-mission/article69878508.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "People who speak that Indian language face deportation from Gurgaon and other parts of the country\nBunny and I are living under the Damoclean sword of summary deportation. No, we’re not facing the prospect of deportation from Trump’s America, where thousands of so-called illegal migrants are being rounded up wholesale and chucked out of the country. \nWe fear being deported out of Gurgaon where we’ve been living for more years than we, or Gurgaon, might care to remember. The powers-that-be in what bills itself as the Millennium City have launched a drive to identify and deport Bangladeshi migrants who’ve snuck into India, and then into Gurgaon, to find employment as domestic help and in other menial jobs. \nThe problem is that the powers-that-be lack the linguistic ability to distinguish between a Bangladeshi and a citizen from the Indian state of Bengal. For Gurgaon’s officialdom, anyone speaking Bengali is a suspect Bangladeshi who should be ejected forthwith.\nThat the Bengali a Bangladeshi speaks is easily distinguished from the Bengali spoken by an Indian Bengali by the way the letter ‘s’ is pronounced – Bangladeshis use the hard ‘s’ as in kiss; Indian Bengalis use the soft ‘s’ as in dish – is a piece of elocutionary trivia of which the local authorities remain blissfully ignorant. \nHaving lived most of our lives in what was Calcutta, Bunny and I speak fluent if ungrammatical Bengali and occasionally converse with each other in that language to keep our lingual hand in, to mix metaphors. If some snoopy eavesdropper were to overhear us, would we be reported for immediate expulsion as illegal migrants? \nIndeed, we are migrants who as economic refugees left Calcutta, which after years of Marxist rule had become not just a backwater, but a stagnant pond, to seek gainful employment in National Capital Region, and had done it without seeking official sanction. \nDoes that make us instantly deportable illegal migrants? If so, where should we be deported to? Bangladesh won’t have us. So would our only deportable destination be Mamata’s welcoming Republic of Bengal, ultimate refuge for the illegal Bengali? \n\n",
        "headline_1": "Illegal Bengali",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/illegal-bengali/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "SC right in withdrawing own order on Bhushan Steel. But GOI must finetune aspects of insolvency law\nSC’s recall of its order from May that reversed JSW Steel’s $2.3bn acquisition of the bankrupt Bhushan Power & Steel Ltd in 2021, is wholly welcome. The May order had considered two technical grounds: one, the eight-year timeline and two, fact that JSW completed the takeover with a mix of equity and optionally convertible debentures, when it should have used equity alone. SC had also found adjudicatory bodies NCLT and NCLAT lacked jurisdiction and set aside their approvals – IBC’s Section 32A that says that on approval of a plan, new investors would not inherit criminal liabilities of previous promoters & directors was a key sticking point. But SC’s position was that such immunity could not override statutes like PMLA. SC’s focus was entirely on statutory compliance of the takeover process.\nAs TOI and our columnists wrote, SC’s reversing the revival of a mismanaged corporate entity was a big blow to India’s insolvency framework. Not only would it hurt JSW lenders and workers, but it would also affect investor sentiment and prospects of finding buyers for other insolvent companies. Investors would run scared. On Thursday, SC said the May order had not correctly considered precedents. IBC, introduced in 2016, is one of India’s most significant reforms – enacted to revive distressed assets, protect employment and maximise stakeholder value. SC reversing its own order is an opportunity to also finetune jurisdictions and boundaries. As the case proceeds, GOI should also explore legislative or institutional redress for a clarity of roles for NCLT and NCLAT, especially in light of SC’s questions on application of Section 32A. Finality of insolvency proceedings is IBC’s fundamental base.\n\n",
        "headline_1": "Well Judged",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/well-judged/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "He may rant but the road to a trade pact is open. India should study how Japan, EU, S Korea did it\nThe sky didn’t fall after Trump’s tariff shock. Sensex ended Thursday just 0.36% lower, and if the markets have held their nerve, so should Indian negotiators working on the trade deal. It’s impossible to answer “what now” when Trump’s diktats end in ellipses. One moment he rants about India’s “strenuous and obnoxious non-monetary trade barriers”, then says talks are still on, “You’ll know by the end of this week,” then vents again: “(India and Russia) can take their dead economies down together, for all I care.” Notes of petulance and impatience, but no clarity on the Russia penalty he’ll charge on top of a 25% tariff starting today. Which is why Trump’s act feels like a bluff.\nPerhaps, Trump’s more keen on a deal with India than he lets on. So the Indian side should learn from his recent actions. His 40% additional tariff on Brazil – total of 50% – is instructive. Starting with the lowest rate of 10% in April, Trump’s hit Brazil with the highest rate now, to meddle in its internal affairs. But that’s his way. On Thursday, he also said Canadian support for Palestinian statehood “will make it very hard for us to make a trade deal with them.” Yet, Brazil isn’t too badly bruised because its aircraft, iron, precious metals, wood pulp, energy, fertilisers – and orange juice – industries have been spared. Largely because Brazilian negotiators got their US clients to lobby for them. The Indian side should do likewise.\nKorea’s deal also has useful pointers. Trump posted on Wednesday it would have to “buy down” its tariff rate from 25%, and the Koreans bid $350bn to get the 15% rate that Japan and EU got earlier with investment pledges of $550bn and $600bn, respectively. In the bargain, Korea can keep its rice and beef markets closed. Since agriculture and dairy are key sticking points in Indian negotiations, India could take this approach. Meanwhile, there’s no point losing sleep over Pakistan’s “deal”, with an undisclosed tariff and Trump’s promise of “developing their massive oil reserves”. Instead, the Russian oil question needs all of India’s attention.\nUntil 2022, Russia supplied less than 1% of India’s oil, so scaling back from the current 35-40% level is possible, especially with the per barrel discount down to about $2 from a high of $18-20. But it’s a geopolitical question, bigger than the economics of tariffs. After all, Russian S-400s, not American Patriots, took down Pakistani missiles and drones in Op Sindoor. India must choose very carefully.\n\n",
        "headline_1": "Trumped? Not Yet",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/trumped-not-yet/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "Patch-making, Supreme Court style\nThe mandap too often turns into a fractious mandi. Unsavoury, but not unexpected because in Indian terminology, ‘market’ usually comes after ‘marriage’. The Big Fat Desi Shaadi is often followed by Big Fat Messy Sequel, which is why both are the staple of  big and small screens. This may or may not be the ‘Kyunki’ behind feisty Smriti Irani returning to the avatar that made her role model of saas and bahu alike. Not that her later stomping ground was really different. Politics makes as strange bedfellows as do faulty horoscopes,  and many netas go in for divorce, and stick with their new party provided it keeps them in the bungalows to which they want to be accustomed. \nSo it was only a matter of time before lofty Supreme Court began functioning like lowly family court. It happened thrice last Friday, the judges sounding more like life-honed Chandrika chachi, or standard-issue Agony Aunt. In one, they ticked off an Indian ambassador who carelessly acquired two wives. The second involved  a decorated IAF pilot — veteran of Balakot bombing — and his wife who were strafing each other ; the Bench soothingly told them to reconcile, saying, ‘You are not enemies.’ The third hit a target more obdurate than cross-border terrorism. \nIt dealt with the major cause of joint-family fracture: monster-in-law. In my Mumbai Mirror ‘Giving Gyan’ column, I constantly had to mollify desperate wives for whom ‘The Other Woman’ was not some sassy siren but scheming saas. Most Indian men being Mama’s boys – and mamas using every ploy to keep them so – the son chooses to maintain the peace by siding with her. He says: ‘After all, so much Ma has suffered for me. Besides, she won’t be among us for long, no?’ The first reasoning is so unmindful of the bahu’s suffering that — finally fed up — she’s the one who fulfils the second. Justices BV Nagarathna and KV Viswanathan admirably  counselled  this  ‘dutiful son’ to hear out his wife’s  POV, and respect her feelings as well. \nHonourable SC  judges won’t have to return home to face the hellish fury of a mother-in-law scorned. But Justice Nagarathna repeated the sensitivity she advised last February while reinstating two callously dismissed women judicial officers in MP. Such a desirable change from patriarchal bilge spewed from more backward benches. \n                                           ***\nAlec Smart said: “14K males among 26,234L illegit recipients of Ladki Bahin funds. Vote a way to disburse welfare!”\n\n",
        "headline_1": "Justice Seema Aunty",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/justice-seema-aunty/",
        "news_paper_name": "The Times of India",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "The recent fighter jet crash at a school campus in Dhaka has led many to question the wisdom of running an airbase in Kurmitola and conducting training flights from there. This is an issue seldom broached in public media, let alone being discussed or debated.\nThe Bangladesh Air Force (BAF) chief explained why the airbase was necessary during an emotional address a day after the crash, standing on the tarmac of the BAF Base Bir Uttam AK Khandker adjacent to Dhaka's main airport. Then two senior officers, both one-star generals, explained the necessity of an airbase in Dhaka during a press conference on July 28.\nOn July 27, the government formed a nine-member probe commission to examine the cause of the tragic crash, assess damage and casualties, and determine the responsibilities. The commission has been told to submit a report within four weeks.\nThe remarks and the formation of the probe commission raise questions that have not so far been answered—perhaps because they have not been asked in the first place.\n\nLet us begin with the airbase and flight training. Air Chief Marshal Hasan Mahmood Khan said, \"This is our main base... this is our most important space. All the VIPs live here, our structures are here, and the parliament is here. There is a matter of protection. So, it's very important to have a strong air base here.\"\nHis remarks boil down to the air force's overriding priority of protecting the skies over Dhaka. Air Commodore Shahidul Islam, director of air operations, echoed his chief on July 28. He also pointed out that Dhaka was not alone in having an airbase in the capital. This was common around the world, he said. The one-star general explained that flight training was part and parcel of an airbase.\nA cursory look at neighbouring countries and commonly referred capitals finds that airbases, or even airports, typically lie outside city limits, unlike Kurmitola which is very much within Dhaka city, just over eight kilometres away from parliament.\nFor instance, the Hindon air force station is about 16 kilometres from the Indian Lok Sabha but outside Delhi city limits. However, Hindon is used for VIP movement and not for fighter aircraft operation. From that respect, the nearest airbase (with fighter aircraft activity) is Ambala, home to the Rafales, about 200 kilometres away in Haryana.\n\nThe closest air base to Islamabad is Nur Khan, which is in the neighbouring city of Rawalpindi almost 13 kilometres away from the Pakistan parliament. The Katunayake airbase in Sri Lanka is integrated with the Bandaranaike International Airport, very much outside Colombo city limits, about 30 kilometres from the parliament building.\nThe air force base at Andrews is in Maryland, the adjacent state to Washington DC, about 15 kilometres away from the US Congress. The Northolt air force station is also outside London city limits, about 20 kilometres away from the House of Commons. Although the Kubinka air base is 60 kilometres away from the Moscow city centre, it is officially within the \"greater Moscow\" area.\nIt may be that the operational and strategic necessity for having a base in Dhaka is unique and thus may not be likened with other cities, but it has not yet been clarified. Nor does the air force explain why it is that flight training cannot be conducted from other locations.\nTo put things in perspective, the F7 can reach a top speed of Mach 2, which is double the speed of sound at about 2,465 kilometres per hour. Presuming that it flies at a modest speed of 1,200 kilometres per hour, it would be barely two minutes' flying time away from a base in Arial Beel, for instance, or seven minutes away from the base in Jashore.\nIt has rightly been pointed out that the airbase was built at a time when there was no such dense settlement in Uttara. The airport was well outside the city limits. But Dhaka has since grown to completely engulf the airport. It should by all means be examined why the city authorities did not exercise caution when sanctioning plans for residences and schools that fall in the flight path. It should also be kept in mind that even if the airbase were removed, the airport would still be there and there would be hundreds of buildings in the flight path of passenger aircraft.\n\nHowever, to suggest that having airbases in capitals is almost a standard practice around the world, when it is clearly not, raises doubts in the public mind.\nThe air chief said, \"A strong air force is essential for our sovereignty. Do not weaken this pillar with rumours.\" Exploring the possibilities of an alternative airbase is not an attempt to weaken it at all. But when responsible air force officers make sweeping statements, it does eat away at the credibility of this integral part of our armed forces and weakens its very foundations.\nThe decision to run an airbase or conduct training out of Kurmitola, however, rests with the defence forces. It would be encouraging to see relevant experts putting their heads together to re-evaluate their operational and strategic priorities under the current context.\nAs for the second issue of a probe commission formed by the government, the official notification says that the nine-member body will examine the cause of the crash, assess damage and casualties, and determine the responsibilities.\nThis commission headed by former Secretary AKM Zafar Ullah Khan also includes a retired air vice marshal, three additional secretaries from three ministries, Dhaka divisional commissioner, an urban planner, and a professor of mechanical engineering from BUET. There have been several accidents involving the F7, but the commission does not include anyone from the manufacturer. One recalls that India included Boeing officials when probing the recent crash in Ahmedabad.\nNoting that there are no aviation experts, no aeronautical engineers or anyone with technical knowhow, how is this committee to examine the reason for the crash? Presumably, another investigation by the air force will be delving into that, and the findings may be kept away from the public for security reasons lest they compromise classified information. That is quite understandable. But it should then be clarified by the government. Other than this investigation, there has been no visible initiatives that might lead to some sort of corrective measures, a point of chronic weakness for the interim government.\nThe jet crash has cost lives. Lives of children who were in school. It would not be unreasonable to expect that all quarters approach this matter with due sincerity and earnestness. Anything less would be an insult to the memory of those we lost.\nBut so far, it bears all the features of yet another half-baked initiative meant merely to placate, with no real intention to resolve.\nTanim Ahmed is digital editor at The Daily Star.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "A few questions over the Dhaka jet crash",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/winkers-aweigh/news/few-questions-over-the-dhaka-jet-crash-3952321",
        "news_paper_name": "The Daily Star",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 01, 2025 12:00:00  \nThe so-called \"reciprocal tariff\" policy of the U.S. administration has already emerged as a potentially destabilising force in global trade -- arguably more damaging than any recent disruption. While third world countries are likely to suffer the worst consequences, particularly those like Bangladesh that enjoy a trade surplus with the U.S., others -- even those with minimal trade ties to the U.S. -- may also face significant fallout. The Asia Floor Wage Alliance (AFWA), a coalition of trade unions representing garment workers across Asia, has raised the alarm, warning that the tariff imposition could trigger a humanitarian crisis and deepen inequality in the global garment industry. In a strongly worded statement, the alliance called for brand accountability, asserting that companies benefiting from outsourced production must not remain silent when tariffs result in factory closures and mass layoffs. \"The U.S. government's recent imposition of tariffs on apparel imports from Asia endangers the livelihoods of millions of garment workers -- most of them women -- who already earn poverty-level wages,\" the statement noted.\nDrawing unsettling parallels with the COVID-19 pandemic -- when global brands abandoned their responsibilities, leading to widespread layoffs, unpaid wages, and factory shutdowns -- AFWA cautioned that a similar catastrophe looms. Without proactive intervention, history may well repeat itself. AFWA's Deputy International Coordinator, Wiranta Ginting, emphasised that tariffs should not be wielded as weapons in geopolitical conflicts. While tariffs can be legitimate fiscal tools, they are now being used as punitive measures with little regard for consequences. Realistically, reshoring apparel manufacturing to the U.S. is economically unfeasible due to high production costs, which would render clothing unaffordable for domestic and international consumers alike. AFWA also pointed out that the current U.S. tariff policy does not serve the interests of American labour. Instead, it punishes Asian economies for geopolitical reasons and risks destabilising the region's production base. The alliance warned that such disproportionate measures could incite unhealthy competition among countries and fragment the garment workforce.\nIn addition to condemning protectionist trade policies, AFWA underscored the need to hold global brands accountable for their sourcing decisions. Rejecting what it described as an exploitative global trade model that enriches brands while plunging workers into poverty and debt, AFWA said that brands must not be allowed to profit from low-wage labour and then disappear when crisis strikes, emphasising that governments should not weaponise trade at the expense of human lives. The alliance called for a vision rooted in balanced industrial development and equitable revenue distribution.\nThere is little room to dispute the merit of AFWA's concerns. The so-called reciprocal tariff undermines the rule-based international trading system, one that strives for equity and cooperation. As things stand, the prospects of avoiding a looming crisis appear slim. For Bangladesh, the situation is particularly alarming. With an economy heavily reliant on apparel exports -- and the U.S. as its largest single market -- the fallout from these tariffs could prove devastating.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Trump’s tariff and the impending catastrophe for many nations",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/trumps-tariff-and-the-impending-catastrophe-for-many-nations-1753982506",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       August 01, 2025 12:00:00  \nThe Dhaka Stock Exchange (DSE), Bangladesh's main financial marketplace, has now been on a steady upward climb for eight consecutive weeks. During this gaining streak, the benchmark DSEX index crossed the 5,400 mark for the first time since last November. The index surged by 5.06 per cent in the third week of July to settle at 5,392 points on July 24, 2025, posting its strongest weekly performance this year. After that, the index stayed mostly steady before jumping again to close at 5,443 points on July 31. This continued upward trend shows that buyers are still confident and willing to invest rather than taking quick profits. More broadly, given how the stock market often reflects public sentiment about the country's financial future, this growth suggests their growing confidence in the economy.\n\nThis positive trend is all the more remarkable considering everything the market has been through. For example, the threat of a 35 per cent US tariff on Bangladeshi exports hung heavily during this entire period of stock price gains. Meanwhile, wars raging worldwide have disrupted trade routes impacting Bangladesh's export-dependent economy, and domestically, a mass uprising has made businesses wary of future investments. Yet, these challenges haven't dampened the market's spirits. \nThis infectious enthusiasm for investing is precisely what had been missing from the stock market. For a long time, the market had struggled under the weight of deep-rooted problems, including structural inefficiencies that steadily eroded investor confidence. One major issue was the floor-pricing mechanism imposed by the Bangladesh Securities and Exchange Commission (BSEC) in March 2020 to prevent a pandemic-induced crash. While the measure temporarily halted the freefall, it distorted market dynamics for years. Most of these restrictions were lifted in January 2024 with the rest removed by August. During the period the floor was in place, the index fluctuated between 3,963 and 7,368 points, though it hovered mostly around the 6,000 mark. Once the floor was removed, many investors worried about rising interest rates and the country's balance of payments deficit rushed to sell their shares. \nThere were other long-standing problems too which continued to prevent the market from functioning efficiently. Among them were persistently low liquidity, limited investor participation and a drying up of the pipeline of new listings. Average daily trading volumes has fallen sharply from over Tk 1,500 crore in FY 2021 and 2022 to just Tk 600 crore in FY 2024. It is worth noting that much of the earlier highs were driven more by speculation than by fundamentals, a practice often described as share gambling. While some degree of speculation exists in all stock markets, trading based purely on rumours is damaging in the long run. The declining daily turnover in 2024 also resulted from a liquidity crunch, including a decline in foreign exchange reserves from $48 billion in August 2021 to under $21.8 billion by December 2023, driven by reduced demand for Bangladesh's key export ready-made garments amid global economic slowdowns. \nAdding to the woes, the DSE failed to attract any new initial public offerings (IPOs) in FY 2024-25. Even in previous years, the flow of new companies had been slow, and those that did join were not well-known enough to attract strong investor interest. Of the 359 active companies listed on the DSE today, market insiders say only a few dozen are solid choices for long-term investment. Meanwhile, big names such as Unilever, Nestlé, MetLife, Banglalink and Incepta still avoid the stock market and remain private. This has kept the DSE's market size from growing and dulled its appeal to foreign investors. \nUsually, when a central bank tightens monetary policy to control inflation, it reduces money supply and slows economic activity, typically leading to lower corporate profits and declining stock prices. Bangladesh Bank has followed this path since early this year and kept a tight monetary stance to combat inflation. Surprisingly, this hasn't dampened stock market performance. That may be because there were some supporting factors that helped offset the pressure. For instance, remittances have remained strong, the banking sector has shown tentative signs of recovery and expectations of economic reforms under the new government have lifted investor confidence. However, as is often the case, the primary driver of rising stock prices in Bangladesh has been the return of both retail and institutional investors chasing quick returns, driven more by speculative fever than sound financial analysis. Many are buying stocks based on market rumours and herd mentality rather than evaluating key fundamentals like dividend yields, earnings per share or company asset values. This sentiment-driven trading dramatically increases market volatility. History shows that when confidence in the market wavers, these same investors can exit just as quickly, leaving shar declines in stock prices in their wake. \nThe bottom line is that investor interest in the DSE is clearly coming back. News that companies like Ashuganj Power Station Co. Limited and Essential Drugs might get listed has added to the excitement and further fuelled demand. A few good IPOs could increase stock supply and support further growth. But to keep things on the right track, investors must proceed with caution. Just because the market is rising doesn't mean it's wise to rush out and blindly buy stocks. Over the long term, company profits are what drive stock returns. If share prices climb too high without matching growth in earnings, returns will stay low and the market could be setting itself up for another painful fall. Let's hope this time the lessons of the past aren't ignored.\nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Stock market hopes and hype",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/stock-market-hopes-and-hype-1753976174",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Shiabur Rahman   |  \n       August 01, 2025 00:00:00  \nConsumers in Bangladesh are the ones whose rights have long been overlooked. Though some consumer protection mechanisms have been developed and put in force over the last couple of years here, the consumers still fall far behind their peers in enjoying their rights. In fact, consumer protection in Bangladesh never got the attention it deserves from the government. For example, neighbouring India took less than two years to formulate and enforce its national consumer protection statute since the United Nations adopted Guidelines for Consumer Protection in 1965, whereas Bangladesh took long 24 years for it. Still the mechanisms in India have been made far stronger than those in Bangladesh with the Indian law providing for quasi-judicial consumer rights commissions at the federal, state and district levels accommodating representatives from stakeholders and Bangladesh one establishing a fully government-controlled department led by bureaucrats. And Bangladeshi consumers are paying the price for this lapse every day. They are compelled to pay more than their peers in India do despite surprising similarities in economic standing of the two close-door neighbours. According to the World Bank, Bangladesh's nominal GDP per capita was estimated to be $2,593 US dollars in 2024 against 2,697 dollars in India. Still the cost burden on average families of the two countries differs sharply as the cost of most services and products are higher in Bangladesh than in India.\nLet's take a few things as examples. A 32-kilometer ride on Kolkata's underground Metro Line 1 or Blue Line costs 25 rupees, equivalent to 35 Bangladesh taka whereas Dhaka's much shorter elevated 20-kilometer MRT Line 6 charges fares of taka 80. It needs to be noted there that the construction of subways or underground metros involves much higher cost than those built on the surface or on elevated platforms. Again, a 500-milliliter bottle of water sells at 10 rupees (equivalent to taka 14) at the retail level in India but an equivalent volume of bottled water costs taka 20 in Bangladesh.\nThis price disparity is not simply currency conversion. It reflects national policy choices, governance, economic priorities, etc. There are a few valid reasons behind the disparity, but there are some unfounded reasons too. It is true that larger population, stronger production base, greater percentage of locally sourced raw materials, more efficient supply chain, subsidies in fields, particularly public transit, in India allow systems to keep their costs low, but Bangladesh authorities overlooking public interest, failure in checking corruption and handling syndicates, and inefficiencies at different levels contribute a lot to enhancing the cost of products and services. For example, Kolkata Metro is deeply integrated into public transport systems where fare adjustments are coupled with political and social priorities. But in Bangladesh, fare pricing is driven by investor cost recovery, which couples with limited subsidy, corruption, and weaker consumer protection allow higher charges. We all have come across media reports on how the construction cost of government infrastructures keeps going up and goes far beyond peers of Bangladesh.\nNow the question is if we can address the higher cost issue in Bangladesh. We should and we can. But it will not be easy. It will require the government to prioritise public interest over anything and take multipronged actions such as checking corruption in both public and private sectors, addressing inefficiencies in the part of service providers and in supply chain, and dismantling syndicates. Otherwise, our consumers will keep paying through the nose.\nrahmansrdk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why do we pay so much more?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-do-we-pay-so-much-more-1753976330",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-08-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       August 01, 2025 00:00:00  \n\nThe misuse, overuse, and unnecessary use of medicines have reached alarming levels in our country. A significant portion of the population remains unaware of the potential dangers of taking medication without proper guidance. This has led to a situation where individuals routinely purchase medicines over the counter without prescriptions, while some unscrupulous doctors and pharmacy owners freely dispense drugs without any medical justification.\nEvery medicine-no matter how commonly used-comes with potential side effects and adverse reactions. It is the responsibility of doctors and pharmacists to explain these clearly to patients, rather than assuming patients will reject treatment out of fear. Proper dosage and selection of drugs depend on several factors: the nature of the disease, patient's age, weight, kidney and liver function, as well as the pharmacological profile of the drug.\nTo break this cycle, urgent reforms are needed. Prescription audits should be enforced to deter unnecessary prescriptions. The sale of prescription drugs without valid prescriptions must be strictly prohibited. Most importantly, qualified pharmacists must be appointed in both hospitals and pharmacies to ensure the rational use of medicines.\nSuch steps would not only reduce drug-induced illnesses and relieve pressure on our healthcare system but also lessen the financial burden on patients.\nAshikujaman Syed\nBusiness Development Manager\nTianjin Pharmacn Medical Technology Co., Ltd.\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dangers of irrational use of medicines",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dangers-of-irrational-use-of-medicines-1753976346",
        "news_paper_name": "The Financial Express",
        "publish_date": "01-08-2025"
    }
]