[
    {
        "full_article": "Arbitrariness and brazen bias in law enforcement have undermined the rule of law in India for decades. Despite the spread of education and growing awareness of rights among the masses, high-handedness by the state often threatens the fundamental rights and dignity of citizens. Custodial torture and extrajudicial killings are reported with alarming frequency. Police and civic authorities in several States now routinely resort to demolition of property as a convenient and extra-legal form of punishment — not just for criminal suspects but also for political opponents. Given the spread of this disturbing trend, the Supreme Court of India’s strong remarks against the practice this week offer a glimmer of hope. A Bench headed by Justice A.S. Oka stated that the illegal demolition of properties belonging to six individuals by the Prayagraj Development Authority in Uttar Pradesh in 2021 had “shocked the conscience” of the Court. The order followed findings that the demolitions were carried out without even serving show-cause notices to the house owners, either in person or by registered post. “These cases shock our conscience. Residential premises of the appellants have been high-handedly demolished… There is something called the right to shelter, something called due process… The authorities, and especially the development authority, must remember that the right to shelter is also an integral part of Article 21 of the Constitution,” the Court observed. The top court has ordered the payment of ₹10 lakh as compensation to each house owner. Through its observations, the Court has reiterated the basic principles of the rule of law — that there can be no punishment without trial, no collective punishment, that every person is presumed innocent until proven guilty, and that guilt cannot be ascribed by association.While this is mostly reassuring, it remains doubtful whether such judicial intervention is sufficient to act as a deterrent. For one, despite earlier disapproval of the bulldozing of property under the guise of law enforcement, the practice has not only continued in Uttar Pradesh but has also spread to other States. Bharatiya Janata Party-ruled States have been eager adopters of this trend, but it has also found appeal beyond partisan lines. The Aam Aadmi Party government in Punjab, for instance, recently resorted to property demolition as a tool in its campaign against the drug mafia. The apparent social approval of state high-handedness in many situations is a troubling commentary on collapsing standards of governance. Mob lynching is a menace the state is duty-bound to curb with an iron fist; it is tragic when the state itself adopts tactics akin to mob justice. The Supreme Court must ensure that its orders are implemented in letter and spirit — consistently and throughout India.\r Published - April 04, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        laws\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Uttar Pradesh\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        Aam Aadmi Party",
        "headline_1": "​Instant injustice: On state high-handedness",
        "headline_2": "The state must not be allowed to adopt the playbook of the mob",
        "link": "https://www.thehindu.com/opinion/editorial/instant-injustice-on-state-high-handedness/article69408749.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "This week, NITI Aayog, in partnership with the National Council of Applied Economic Research (NCAER), launched the NITI NCAER States Economic Forum — a portal aggregating data and analysis on State finances. It presents State-wise reports covering macroeconomic indicators including tax and non-tax revenues, as well as human development statistics such as school dropout rates, literacy levels, employment, and historical trends in the devolution of central funds. At a time when Centre-State relations are under renewed scrutiny, particularly in the southern States, where fiscal federalism has been a long-standing flashpoint, this portal is a timely and welcome move. The data is not new, drawn as it is from established sources such as the 2011 Census, the Periodic Labour Force Survey, and the Reserve Bank of India’s State Finances Report. However, its comparative presentation across States brings clarity to the diverse fiscal realities of India, offering a structured lens through which to assess disparities and development. Concerns persist about the quality of economic data in India, and this portal is not immune to these, relying as it does on existing sources. Yet, by organising the data in a user-friendly and comparative format, it can help anchor contentious debates — such as those around revenue-sharing and parliamentary delimitation — in facts rather than sentiment. While these issues are serious, they are part of a much larger set of challenges tied to fiscal relations and political power-sharing between the Union and the States.\rThe effective use of such data depends on ongoing engagement by States, especially through institutions such as the Sixteenth Finance Commission. For India’s federal structure to work equitably, regional data must be translated into policies that ensure fair representation, resource allocation, and administrative responsibility. Unfortunately, discussions on federalism often get reduced to narrow and polarised frames such as debates around the three-language policy or calls to defer delimitation. Over-centralisation can breed discontent, while regional resistance often risks turning parochial. Navigating this balance requires cooperation rooted in evidence and mutual recognition of diverse State realities. Leaders in both New Delhi and the State capitals must engage in a spirit of transparency and trust. The new data platform is not a panacea but offers a credible starting point — a tool for fostering informed, pragmatic conversations around governance, development, and the future of Indian federalism.\r Published - April 04, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        finance (general)\n                    \n                            /                      \n                        \n                        development\n                    \n                            /                      \n                        \n                        school\n                    \n                            /                      \n                        \n                        employment\n                    \n                            /                      \n                        \n                        population and census\n                    \n                            /                      \n                        \n                        labour\n                    \n                            /                      \n                        \n                        Reserve Bank of India\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        Delimitation\n                    \n                            /                      \n                        \n                        macro economics",
        "headline_1": "​Data and federalism: On the NITI NCAER States Economic Forum portal",
        "headline_2": "Reliable data can lead the dialogue between the Centre and the States",
        "link": "https://www.thehindu.com/opinion/editorial/data-and-federalism-on-the-niti-ncaer-states-economic-forum-portal/article69408553.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "Criminal defamation has a chilling effect on free speech. Civil law can protect right to reputation\nTwo defamation cases decided within a week again highlight why criminal defamation is an unreasonable restriction on free speech. A Delhi court upheld activist Medha Patkar’s conviction in a case filed by VK Saxena 24 years ago when the current Delhi LG headed an NGO in Gujarat, and Patkar led NBA. Last year, she was sentenced to 5 months in jail and fined Rs 10L. Patkar will receive her sentence on April 8. In Bengal, Calcutta HC quashed a defamation suit by an educational institute’s superintendent, who had sued over 280 people in 2013 for petitioning Bengal CM against him. Calcutta HC said public interest far outweighed official’s right to reputation. But for 15 years, 280 people had a criminal case against them – that can wreak havoc with students’ futures.\nRahul Gandhi was convicted in a defamation case and disqualified from Parliament. Kejriwal apologised to Arun Jaitley. From Digvijaya Singh to Subramanian Swamy, defamation is a suit easily slapped, hard to shake off. If the widely varying outcomes of such cases are any indication, what stands out is the inconsistency and vague interpretations of ‘reputation’ and chilling effect on free speech. There are two ways to review this. Ideally, remove defamation totally. Removal will not leave reputation unprotected. BNS Sec 351 deals with criminal intimidation – threatening someone with harm to body, reputation, or property. Further, BNS Sec 352 provides for “insult to someone to provoke breach of peace”. Both are reasonable restrictions on free speech with provisions that protect right to reputation. Or, decriminalise defamation. A civil law would reflect the sensitivity required to preserve both right to free speech and right to reputation. And of course, our politicians do need to grow a thick skin. \n\n",
        "headline_1": "2 cases, 1 conclusion",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/2-cases-1-conclusion/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "Thanks to the UP chief minister, we now have a simple and infallible method of identifying potential traitors\nThe problem with traitors – apart from the fact that they are traitors – is that only too often they are devilishly difficult to identify, subterfuge and concealment being part and parcel of their treasonable nature.\nThough they sometimes inadvertently give themselves away by sporting kurtas emblazoned with the slogan ‘I love JNU’, and/or carrying jholas containing the collected works of Marx and Lenin, by and large they remain below the radar of patriotic vigilance to pursue their nefarious and seditious activities.\nTo expose suspected anti-nationals – be they acquaintances, neighbours, friends, or relatives – one could strap them down in an interrogation chamber and subject them to a lie-detector test to determine their patriotic credentials or lack of them, but such direct-action methods, particularly if the testee was proven innocent, could lead to oneself getting unfriended on Facebook.\nHowever now, thanks to UP chief minister Yogi Adityanath, we have a simple and effective way – a litmus test for traitorism, so to speak – to sniff out, or rather sound out, such anti-national elements.\nAccording to Yogiji, the “glorification” of Aurangzeb is a give-away sign of a traitor, and as such abhorrent to the ethos of a “new India”.\nThe CM’s formulation on traitor-detecting is, in its own way, as significant a breakthrough in political science as Alexander Fleming’s discovery of penicillin to combat infection was in medical science.\nHow does one apply the Aurangzeb test to unmask traitors? In casual conversation, slip in a random question such as: Wasn’t this Aurangzeb guy who’s in the news a proto-urban Naxal who should have been put under digital arrest, if they’d had digital arrest in those days? If the person spoken to doesn’t emphatically endorse this opinion, then he obviously harbours treasonous sentiments and should immediately be reported to the…\n(Editor’s note: Jug Suraiya has been detained by police for repeated mention of a non-person belonging to a non-existent people called Mughals)\n\n",
        "headline_1": "Aurangzeb test",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/aurangzeb-test/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "The worst thing, for US & all others, about Trump’s tariffs is the chaotic uncertainty they’ve produced\nSuspense over Trump’s tariffs is over, or is it? Anyone looking at bare numbers for clarity is driving blind through fog. Those ‘discounted’ tariffs are as nuanced as national boundaries in Africa, drawn by colonialists in a room. Don’t ask for the source code, because there isn’t any. As financial writer James Surowiecki pointed out yesterday, the tariffs used for computation are “made-up numbers”. But the pain is real, and nobody knows how bad it will get.\nFor starters, stock markets fell yesterday. That was expected because tariffs are never good for business. And tariffs on a global scale are like a magnitude-10 quake. Former US treasury secretary Larry Summers estimated that tariffs could cost America $30tn – roughly one year’s GDP. But that’s without knowing what other countries will do next. Should China and EU retaliate with tariffs, 2025 could be a very bad year for everybody. Even if they don’t, the uncertainty is killing.\nBusinesses, for instance, are in a bind. Move manufacturing from China or India to US? But Trump could negotiate new deals, making such moves futile. It is widely believed his tariffs are just a ploy to force other countries to negotiate trade terms. Apple, for instance, built up a supplier base in India over the past few years, and exported iPhones worth 1L cr last year. With tariffs, its India plans look less rosy. That’s true for garment exporters in Bangladesh, and footwear factories in Vietnam also. In fact, tariffs could cost Vietnam 5.5% of its GDP, according to an ING analysis.\nThere are other unknowns. The dollar slipped yesterday, although Team Trump were hoping it would rise to offset the impact of tariffs on US customers. If it remains depressed, US could face high inflation. But if the Fed raises rates, economic growth could slow or stall. There’s no clarity on how high America’s average tariff will be – 22%, estimated by Bloomberg, or 25-30%, estimated by others. In the best case, if every country makes terms with Trump, the new baseline tariff of 10% would be far higher than 2.3% last year.\nUnlike China and EU, India has not taken a combative stance on tariffs, choosing to study “opportunities” instead. For now, with China and its offshoring destinations taxed more severely, India seems to have a comparative advantage, but again, nothing’s certain. Trump could change his tariff map, keep tariffs for the rest of his term or drop them six months from now. As of now, no one knows, including Trump. \n\n",
        "headline_1": "What now? No idea",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/what-now-no-idea/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "The system needed reform. But GOI’s solution, despite some good ideas, actually weakens regulation. And denying non-Muslims the choice to donate is problematic\nWaqf is the most direct expression of Islamic philanthropy. True Quran does not use the expression ‘waqf’ but that does not mean it has no theological basis. Over 20 verses encourage people to spend their wealth on charity. For instance: “And in their wealth, the beggar and deprived had due share” (XXVI:19).\nThe Prophet in all created seven waqfs of date palm gardens (Al-Bukhari, Vol 4). Moorish traveller Ibn Battuta mentioned several waqfs in Damascus in 1327 – for wedding gifts for girls; freeing prisoners; serving food and clothes to travellers; improving roads etc. A waqf for the replacement of Chinese porcelain dishes accidentally broken by a slave boy or anyone to save him from scolding greatly impressed Battuta (Travels in Asia and Africa 1325-1354).\nRead full story on TOI+\n\n",
        "headline_1": "Is this the right Waqf?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/is-this-the-right-waqf/",
        "news_paper_name": "The Times of India",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Chief Advisor's visit  to China",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/chief-advisors-visit-to-china-1743689046",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Fighting the twin problem of discrimination and disparity",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fighting-the-twin-problem-of-discrimination-and-disparity-1743689088",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Banking on holidays",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/banking-on-holidays-1743689154",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-04-2025"
    },
    {
        "full_article": "",
        "headline_1": "Cyber attacks: The invisible war",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/cyber-attacks-the-invisible-war-1743689167",
        "news_paper_name": "The Financial Express",
        "publish_date": "04-04-2025"
    }
]