[
    {
        "full_article": "The Prime Minister Dhan-Dhaanya Krishi Yojana (PMDDKY), a scheme approved by the Union Cabinet, is to be implemented through the convergence of 36 existing schemes across 11 Departments. According to Union Agriculture Minister Shivraj Singh Chouhan, the scheme seeks to address the “disparities in productivity” between States, and even among districts within a State. The Centre’s pet schemes such as the Pradhan Mantri Kisan Samman Nidhi (PM-KISAN) and the PM Fasal Bima Yojana (PMFBY) as well as relevant State schemes, to be identified by the District Dhan Dhaanya Samitis, will be subsumed in the PMDDKY. Local partnerships with the private sector will also be promoted under the proposed scheme, which will begin in October during the rabi crop season. The scheme is to get an annual outlay of ₹24,000 crore for six years. Modelled on NITI Aayog’s Aspirational Districts Programme, the Centre will identify 100 districts based on low productivity and cropping intensity and less credit disbursement. The hope is that the scheme will result in higher productivity, value addition in agriculture and allied sectors, local livelihood creation, leading to increased domestic production and self-reliance. This convergence of schemes must be viewed in the background of decreasing public spending on agriculture. The Parliamentary Standing Committee on Agriculture, in the latest report on Demands for Grants, had observed a continuous decline, from 3.53% in 2021-22 to 3.14% (2022-23), 2.57% (2023-24), 2.54% (2024-25) and 2.51% (2025-26), of the allocations for agriculture as a percentage of total Central Plan outlay.This aggregation of all schemes under one umbrella suggests that the Government wants uniformity in running the welfare, financial and technical schemes in the agriculture sector. It is keen to add States’ measures too in the new scheme. It remains to be seen how effective such uniformity will be on the ground as further decrease in public investment in agriculture could be disastrous. Private-public partnerships should be for the larger good of self-reliance, particularly in the production of foodgrains, edible oil and pulses. The progress of area coverage under kharif crops, released last week, points to a decrease in the sowing of oil seeds and popular pulses. Though it promotes national uniformity, it is welcome that the new scheme will function based on ‘District Plans’ that will be aligned to the national goals of crop diversification, conservation of water and soil health, self-sufficiency in agriculture and allied sectors. For the PMDDKY, the Centre will monitor 117 key indicators of progress on a monthly basis. But to make it more participatory, States, local self governments, primary agriculture cooperative societies, agriculture universities and organisations of farmers and traders must be involved in this process. Published - July 19, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        agriculture\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        welfare\n                    \n                            /                      \n                        \n                        finance (general)\n                    \n                            /                      \n                        \n                        technology (general)",
        "headline_1": "​All in one: On the Prime Minister Dhan-Dhaanya Krishi Yojana scheme",
        "headline_2": "Agriculture needs more public spending, not just one umbrella scheme",
        "link": "https://www.thehindu.com/opinion/editorial/all-in-one-on-the-prime-minister-dhan-dhaanya-krishi-yojana-scheme/article69828378.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "For many cricket lovers in Bengaluru and Karnataka, the one lingering disappointment was the persisting failure of Royal Challengers Bengaluru to win the Indian Premier League (IPL) trophy. Virat Kohli may have been king across the world but in the IPL he was not, until a dramatic change of fortunes at the very end of his career. The cup win in 2025 was to be the crowning glory of Kohli, RCB, and, eventually, Bengaluru itself. But tragically enough, the stampede at the M. Chinnaswamy Stadium during the victory celebrations on June 4 upended that glory. In its probe of the stampede that killed 11 and left 71 injured, the John Michael D’Cunha Commission has come down severely on the RCB management and the police. It has pinpointed the cause as “not regulating the entry into the gates and making reckless announcements with regard to the entry into the stadium”. It has named many and recommended legal action against them while discussing how such gatherings can be made safer and the medical backups that may be required. But its terms of inquiry were limited and missed the bigger picture. Blame must be apportioned to all stakeholders who just did not think of the consequences of calling for such a large gathering and going ahead with it without the permissions and arrangements. The police must be faulted for not beefing up the arrangements at the stadium’s entry and exit points. But it may not be fair to blame them for allowing the event — it had practically become a fait accompli as the administration was going along with the celebrations and the euphoria.The stadium event was among the three planned that day. As if to kick off the celebrations, Karnataka Chief Minister Siddaramaiah felicitated the team in an open-air event outside the Vidhana Soudha in the morning. These celebrations set the tone for what unfolded that day. To their credit, the police did refuse to allow the planned victory parade on an open bus. And at the Vidhana Soudha, where only a few among the lakhs who had gathered got to see their favourite stars, an announcement was made that people could proceed to the stadium which has a seating capacity of just 32,000. In a broader sense though, the stampede was a reflection of the realities of urban life too, where massive flash crowds can generate from communities sharing a common passion and kindled by social media. Urban planners and managers have little clue on how to handle such mobilisations, which have resulted in stampedes at religious, social and cultural events, leading to the loss of hundreds of lives.\r Published - July 19, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        cricket\n                    \n                            /                      \n                        \n                        Indian Premier League\n                    \n                            /                      \n                        \n                        bengaluru\n                    \n                            /                      \n                        \n                        accident (general)\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        urban planning",
        "headline_1": "Taking responsibility: On the stampede in Bengaluru",
        "headline_2": "Karnataka government must share the blame for the stampede",
        "link": "https://www.thehindu.com/opinion/editorial/taking-responsibility-on-the-stampede-in-bengaluru/article69828011.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "Fasting, personalised nutrition, regular exercise\nLongevity is the new new holy grail. Naturally, therefore, the market offers magic diets, pills and exercises promising a sure-shot path to healthy nineties – and beyond. Thing is, the science of longevity is still largely a mystery. Outlive: The Science & Art Of Longevity by Peter Attia breaks it all down helpfully. Turns out we intuitively know some of the hows, but we don’t quite get the whys.\nThe problem, Attia says, is with the approach of current medicine – described as Medicine 2.0 – that has become very adept at staving off death by months or years, but not prolonging lifespan or healthspan. This is because modern medicine intervenes too late – when disease has already taken root. What’s needed, per the book, is Medicine 3.0, which identifies markers of disease based on a person’s unique genetic and medical history, and intervenes way before actual disease sets in. This approach has the potential to change the last bits of most people’s lives – 70s or 80s – into productive disease-free years or even bestow us with a bonus decade that could see us make it to healthy nineties.\nWhat’s needed though is a system-wide reorientation. Greater medical focus on prevention. And tweaking health insurance so that it covers preventive treatments. Sounds a lot. But the effort is well worth it, the book argues. It addresses the Four Horsemen of bad health – heart disease, cancer, neurodegenerative disease, and Type 2 diabetes and related metabolic dysfunction. Understanding how to keep them at bay is key.\nThe book offers plenty of scientific clues. For example, one possible longevity gene that has emerged in multiple studies of centenarians is FOXO3 and its variants. The gene actually regulates other genes that maintain cellular health. And guess what! FOXO3 tends to be more active when we are slightly deprived of nutrients or when we are exercising.\nSimilarly, rapamycin, the miracle molecule that was discovered on remote Easter Island but is now a mainstay of transplant medicine, works on the intracellular protein complex called mToR, which plays a key role in longevity at the cellular level. When food is plentiful, mTOR is active and cells go into growth mode. When food is scarce, mTOR is suppressed and cells go into recycling or cleaning mode, making them more resilient. This bit of science on cellular mechanisms supports the logic of fasting to promote health.\nExercise is the most powerful longevity drug, the book says. But it’s not about strength training vs cardio. Instead, think about the 10 physical activities you want to be doing in your eighth or ninth decade and work back to determine how much fitness you should have now. To lift a 20kg suitcase overhead when you are older means being able to lift a 40kg suitcase now. Exercise can reverse both physical and cognitive decline. And almost any kind of exercise is better than none at all. High aerobic fitness and strength are linked to longer lifespan. The more aerobically fit you are, the more your body will be able to use oxygen to generate ATP – the chemical that powers our cells.\nAttia warns against a dogmatic approach to diet and wants the term replaced with nutritional biochemistry. Each of us reacts to food molecules in a different way. So the same diet can produce different results. Hence, nutrition has to be highly personalised and pegged to our own unique health parameters. Decode yourself, eat right, do the brisk daily walk – live long.\n\n",
        "headline_1": "How To Live Long, Minus Disease",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/how-to-live-long-minus-disease/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "Using science to save lives is great. Using it just for fun? Maybe not so much.\nIn the UK, there are now eight babies who have something unusual – three parents! They have a dad, a regular mom (let’s call her Mummy-I), and a second mom (Mummy-II). But Mummy-II won’t be in birthday pictures or family vacations. She only gave a tiny bit – just 0.1% – of the baby’s genes. That’s like 1 part in 1,000!\nWhy did she help at all? Because that tiny bit of DNA can stop babies from getting a very serious illness called mitochondrial disease. It’s rare, but dangerous, and right now, there’s no cure. The special science used to fix this is called mitochondrial replacement. It’s not about making “perfect” babies with blue eyes or blonde hair – it’s about helping babies be healthy.\nNow, some people do try to make “designer babies.” And they don’t always need super high-tech labs. For example, sperm banks let parents choose donors based on traits like height or eye colour. In 2009, a clinic in Los Angeles even let parents choose things like skin and hair colour before the baby was even born!\nA Chinese scientist named He Jiankui went much further in 2018. He edited genes to try to create designer babies. It was such a big deal that he was sent to jail for 3 years! But he’s out now, and he says people are again interested in his work.\nStill, just because we can do something doesn’t mean we should. Wanting your baby to be super smart or super good-looking might not work out the way you expect. As the joke goes, if a smart man and a pretty woman wanted a baby with his brain and her looks, what if the baby ends up with her brain and his looks?\nSo – using science to help sick babies? Amazing. Using it just to try and create the “perfect” kid? Not so smart.\n\n",
        "headline_1": "Gene Studio",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/gene-studio/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "Authorities must learn the art of good press briefing\nAAIB was upset enough over a report published on Thursday to issue a statement against alleged ‘misreporting’ of its preliminary probe report into last month’s crash of a Dreamliner in Ahmedabad. AAIB said its preliminary report had addressed only the WHAT of the crash, and incorrect conclusions were being reported. Soon after AAIB’s briefing, Indian pilots’ association criticised AIIB report’s ‘tone’. More questions were raised than answered. The nub of communication is that audiences interpret the facts presented in the manner intended by the communicator. And it is that standard and quality of communication that Indian authorities often fail to deliver. What investigators believed they put out was not what the world heard.\nThis isn’t the first time this has happened. In the recent conflict between India and Pakistan, the single powerful communication delivered on point was ‘no escalation’. There were no mistaken takes on New Delhi’s restraint. But authorities failed to address questions on fighter jets, allowing a flood of speculation. In a connected world, when high value news hits headlines, you can’t control the narrative. Authorities couldn’t avoid the question when some of India’s military seniors spoke of the issue weeks later.\nBut when the issue at stake is civil aviation security, every word, every phrase, will be weighed and measured even more. Had communication on AAIB’s prelim report been weighty and substantial, instead of providing ‘trailers’ and having media turn to ‘sources’, it would’ve killed the opportunity for possibly tendentious briefings. There’s no point crying misreporting when the fault lies with the initial inadequate press briefing.\n\n",
        "headline_1": "Get Your Story Out",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/get-your-story-out/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "Tinkering to save lives is good, to satisfy whims bad\nIn news from UK, eight babies have three parents each – Papa, Mummy-I and Mummy-II. Mummy-II remains anonymous, and won’t get a seat in baby’s birthday photos, college convocation, wedding, etc. Baby doesn’t look much like Mummy-II either because she only pitched in with 0.1% – that’s 1 in 1,000 parts – of baby’s DNA. But that jot of genetic material will be crucial for baby’s survival. Which is the whole point of “mitochondrial replacement”, as the breakthrough technique is called. It’s not about making designer babies with blue eyes and blonde hair, but preventing mitochondrial disease that affects about 1 in 5,000 babies, and is incurable. So, don’t lose sleep over it.\nBesides, “designing” babies hardly requires cutting-edge technology. Sperm banks promise it with nothing more than self-attested declarations. In 2009, a Los Angeles fertility clinic caused a furore by letting parents’ choose their children’s skin, hair and eye colours through the IVF equivalent of a “brute force attack” – analysing embryos for desired traits before implantation. Chinese scientist He Jiankui used the admittedly very advanced method of gene editing to make designer babies in 2018, and spent three years in jail for it. But he’s out now, and “warmly welcomed” by US investors, he told SCMP last month. He might, conceivably, succeed this time.\nBut prospective clients should consider how their designer babies might turn out to be like nouveau riche mansions – glass facade, Mughal dome and aeroplane-shaped water tank on the roof. Or as GB Shaw supposedly told a famous dancer, who wanted a baby with his intellect and her looks: “Yes, but supposing it had your brains and my beauty.”\n\n",
        "headline_1": "Gene Studio",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/gene-studio-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 19, 2025 00:00:00  \nAs a temporary answer to the acute supply shortage in the national grid, a number of power plants were set up in the private sector during the previous autocratic regime. But the contracts for those quick rental, rental and independent power plants (IPPs) were arbitrarily awarded to companies favoured by the authorities of that time and not through any competition by way of open biddings. So, to shield such deals from any legal challenge as well as provide impunity to those power companies, the government of the time passed an indemnity law, styled, \"The Quick Enhancement of Electricity and Energy Supply (Special Provision) Act 2010\". Notably, section 9 of the Act states that no court may question the validity of any actions, decisions or orders made under the law. Section 10 of the Act, on the other hand, provides complete immunity to employees/officers performing their tasks from any criminal or civil criminal proceedings in the court. \nRun by expensive fossil fuels like diesel, furnace oil and coal, those private power plants were meant to be replaced within three to five years with less expensive state-owned power plants. But their operation continued though many government-owned power plants were meanwhile built resulting in a 50 per cent overcapacity of all the power generation units so installed. Under the condition of the contracts, the government went on paying capacity charge meaning payments made to the private power companies according to their installed capacities, and not on the basis of how much power they actually produced. Naturally, after the fall of the autocratic government followed by establishment of the current interim administration, energy experts advised the incumbent government to review and even cancel, where necessary, the contracts awarded to the rental power plants. Also, in September last year, the High Court (HC) issued a rule asking why the provision that acquits rental and quick rental power plants from any questioning regarding their establishment and operations should not be declared illegal. However, the HC made allowance for any action already taken in good faith in exercise of the two noted sections of the indemnity law to avoid any legal complexities. Given that all the quick rental and rental power plant contracts under the ousted regime were concealed from the public scrutiny under cover of the indemnity law, it is hard to speculate what legal and financial fallouts of any cancellation of the contracts might be. The financial consequences may involve capacity charges against the rental power plants' renewed contract periods. That is why, it calls for careful scrutiny, especially of the renewed power purchase deals, which can provide important clues to dealing with any shady power contracts made during the past autocracy. \nAgainst this backdrop, to address widespread allegations of inconsistencies/anomalies in those power deals reached with the privately run independent power plants then, the incumbent administration, in line with the HC directive, approved last week a proposal to seek legal assistance and hold deliberations as necessary so the controversial agreements inked earlier with the private power companies could be recast. Since some foreign companies are also involved in these power deals, the proposed review of the contracts cannot the done one-sidedly, the Finance Adviser Dr Salehuddin Ahmed who briefed journalists on the issue, explained. So is the need for legal support. \nThe government move is likely to not only help relieve the nation of some bad legacies handed down from the past autocracy, but also stop making some oligarchs richer at the expense of the state exchequer. Reportedly, the previous regime extended the rental power plants' tenure of contract three times beyond their recommended efficient operational life, thereby paying them to the tune of Tk330 billion between 2009 and 2023.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Getting rid of shady private power deals",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/getting-rid-of-shady-private-power-deals-1752848053",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       July 19, 2025 00:00:00  \n\nThe burden of public debt in Bangladesh is rising, both in absolute terms and relative to the size of the economy. By the end of the 2025-26 fiscal year, the government's total domestic and external debt is expected to reach Tk 23.42 trillion and it could go beyond Tk 28.93 trillion by 2027-28. This mounting debt is one of the most serious challenges inherited by the interim government from its predecessor. When the previous Awami League government left office in August 2024, it had Tk 18.36 trillion in public debt accumulated through reckless borrowing in the name of development. The responsibility for repaying principals of these loans and servicing the interest now rests squarely on the current government. This unchecked accumulation of debt is creating intense economic pressure which could easily escalate into a full-blown crisis unless public finances are managed with utmost caution. \nOne of the most commonly used indicators in discussions of government debt is the debt-to-GDP ratio. Many consider the IMF's threshold for this ratio as a definitive benchmark for determining when debt crosses the danger line. For Bangladesh, the debt-to-GDP ratio stood at 37.62 per cent in the 2023-24 fiscal year, later revised down to 37.41 per cent in the latest budget. Projections suggest this ratio will gradually rise, reaching 37.72 per cent by the 2027-28 fiscal year. According to the IMF's fiscal monitoring report, a debt-to-GDP ratio of 55 per cent or higher would raise concerns for Bangladesh, meaning the current level does not immediately set off alarm bells. However, the upward trend warrants close attention. Ideally, if Bangladesh's borrowing had been subject to rigorous scrutiny and directed towards productive investments that boosted GDP growth, the rising debt would not have been seen as harmful. Unfortunately, much of the external borrowing over the past 15 years occurred without adequate scrutiny or negotiation, making the debt burden more severe than it needed to be. Moreover, many of the large-scale infrastructure projects financed by these loans were plagued by corruption. This often took the form of inflated costs, with unnecessary components added to justify budget escalations. Groups with vested interests reportedly exploited these loan-based mega projects by inflating costs multiple times. As a result, the country is now facing mounting pressure to pay back both interest and principal on a debt that it can no longer manage easily.\nIn theory, there is nothing inherently wrong about a country carrying debt. If the borrowed funds generate returns that exceed the cost of borrowing, such debt can be considered productive and sustainable. This is, in fact, a common feature of modern economies. But in practice, what happened in Bangladesh is that a growing share of public borrowing had gone towards covering routine expenses, propping up loss-making state-owned enterprises and subsidising sectors without credible reform plans. Entities such as the Bangladesh Power Development Board (BPDB), Bangladesh Petroleum Corporation (BPC) and Bangladesh Jute Mills Corporation (BJMC) continue to receive fiscal support despite persistent inefficiencies and structural weaknesses. Even within the ambit of the Annual Development Programme, capital spending is often hampered by poor project selection and implementation delays. Such uses of borrowed funds produce limited long-term economic returns, making the debt less justifiable and harder to service over time. \nThe ratio of interest paid to revenue is another critical indicator for assessing whether a nation's debt is becoming unmanageable. This matters because the cost of debt is closely tied to interest rates, and as those rates rise, the difficulty of servicing debt increases. Not all countries generate revenue at the same rate relative to GDP, nor do they borrow at the same cost. Countries that can borrow cheaply have more room to manage higher debt levels than those facing higher borrowing costs. Unlike advanced economies, Bangladesh cannot raise taxes or borrow at low interest rates with the same ease. In the fiscal year 2025-26, a staggering Tk 1.13 trillion has been allocated just for interest payments. This alone accounts for nearly one-seventh of the entire national budget. These interest expenses are expected to rise further in the coming years, placing increasing pressure on public finances. Bangladesh's upcoming graduation from the United Nations' Least Developed Country (LDC) status in 2026 will only add to this challenge. Once the country transitions out of the LDC category, it will no longer qualify for concessional financing which typically features low interest rates and long repayment periods. As a result, future borrowing will take place on more commercial terms, involving higher interest rates and shorter maturities. Consequently, debt servicing would consume growing portions of both foreign exchange reserves and fiscal revenues.\nHad the country achieved stronger domestic revenue mobilisation in line with its expenditures, the debt burden would not have escalated to its current level. However, the National Board of Revenue (NBR) has consistently fallen short of its tax collection targets year after year, forcing the government to increasingly depend on borrowing, even to cover routine expenditures. \nThe government's own Medium-Term Debt Management Strategy reportedly acknowledges that Bangladesh has moved from a \"low\" to a \"nearly high\" risk category due to the growing volume of public debt. Notably, the country's external debt-to-export ratio has now reached 140 per cent, a level that the Finance Division itself considers alarming. This indicates that Bangladesh is earning significantly less from exports than it owes in foreign currency. If this trend persists, any combination of global events, be it a rise in oil prices, a slowdown in remittances or another pandemic, could trigger a balance of payments crisis. \nAll of this suggests that while Bangladesh may not currently face an imminent debt crisis, it has been heading in a risky direction for some time. The national budget for FY 2025-26 hints at a more cautious approach to spending, but greater discipline in project selection and debt management remains essential. Bangladesh still has the time and opportunity to place its public debt on a sustainable path, but that time is running out fast. \nshoeb434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Can Bangladesh afford servicing its debts?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/can-bangladesh-afford-servicing-its-debts-1752848169",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       July 19, 2025 12:00:00  \n\nAnother Shrabon, or Shaon, is there in Bangladesh now. The fourth month on the traditional Bangla calendar is also the second month of Barsha, the wet season when rainfall occurs heavily. One year back, the month of Shrabon in Bangladesh was full of fury against the now fallen autocratic government's brutal oppression. Though it started earlier as a protest movement against the resumption of the discriminatory quota system in the public service, the movement reached a critical juncture on the first day of Shrabon (July 16) last year. On that fateful day, fearless Abu Syed of the Begum Rokeya University in Rangpur was shot dead by the police. The brutal killing intensified the raging protests across the country and further unified students against the oppressive government of Sheikh Hasina. \nThe day before, on July 15, leaders and activists of the now-banned Bangladesh Chhatra League (BCL) ruthlessly attacked the protesting students at the Dhaka University campus and some other educational institutions in the country. The goons of BCL once again showed their ugliest faces, as they had done for the last 15 years, terrifying ordinary students on various occasions. Hasina and her associates in the government and the party were confident that the BCL goons would suppress the protestors as they had done before. The BCL goons reinforced the brutal attack on the next day, presuming that the protesters had already been subdued. But the killing of Abu Syed and some others, coupled with BCL brutality, had reenergised the protestors, and they strongly resisted the BCL goons on different campuses the next day. For the first time in 15 years, students forced the BCL goons to leave the campuses. Protestors fearlessly chased the goons across the country and did not hesitate to counter-attack them where necessary. \nIn this way, the movement reached a new peak, clearly giving a signal that the government would achieve little by using brutal force. The Hasina regime was, however, determined to suppress the movement by any means and so resorted to further brutal actions. Only some partisan people, shameless loyalists and vested beneficiaries extended their unqualified support to the regime's cruel policy. Even an internet shutdown was imposed in Bangladesh following the example of the internet blackout in Indian Kashmir by the central government there. \nThings, however, started to slip out of the regime's hands as people from different walks of life expressed their support for the protesting students and youths. As the death toll had been increasing, violent clashes erupted between the protestors and law-enforcing agencies and goons of the Awami League. The rainy days of Shrabon were bloodied red. Coordinators of the movement had announced programme after programme to keep the momentum in the face of intimidation. Programmes like 'complete shutdown', 'march for justice' and 'droho jatra' (rebel parade) were joined by a growing number of people in solidarity with the students' movement. \nAs the regime felt that things were getting out of control fast, it continued suppressive measures, resulting in block raids to arrest anyone who joined or supported the movement and also indiscriminate firing by the police, along with firing from helicopters by the RAB. The killing spree and constant intimidation forced the protesters to announce a one-point demand: resignation of the Hasina-led government. To realise the demand, the protestors also announced nationwide non-cooperation campaigns. The final blow came when the coordinators announced the 'March to Dhaka', urging people from different parts of the country to assemble in the capital city on Shrabon 21 (August 5). The rest is history. The army refused to move against the people. Hasina resigned and flew to New Delhi to seek shelter. She left the country with a legacy of killing 1,400 people, more than 20,000 injured, a decade-long period of intimidation and chaos. Shrabon thus becomes a red-letter month in the history of Bangladesh.\nasajdulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Shrabon's transition into a red-letter month",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/shrabons-transition-into-a-red-letter-month-1752848232",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-07-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       July 19, 2025 00:00:00  \n\nIn cities like Dhaka, Chattogram, and Rajshahi, walking has become a daily challenge. Sidewalks, which should serve as safe spaces for pedestrians, have been overtaken by hawkers, makeshift stalls, construction materials and even political banners. What should be a basic right has turned into a constant risk, forcing people onto dangerous roads and worsening traffic congestion.\nVisit New Market, Gulistan, or Farmgate in Dhaka, or Reazuddin Bazar in Chattogram, and the problem is evident. Instead of offering safe passage, sidewalks have become contested, commercialised spaces. The result? Accidents are rising, traffic flow is disrupted, and pedestrians-especially children, women, the elderly, and people with disabilities-face daily threats.\nThe reasons behind this crisis are complex. There is no formal system for managing street vendors, many of whom rely on sidewalk stalls for survival. Eviction drives by city authorities are temporary at best-hawkers often return within days, protected by informal political networks. In many cases, illegal fees are collected in exchange for access to public space, with law enforcement turning a blind eye.\nBut blaming hawkers alone is neither fair nor productive. They are citizens, too, trying to earn a living in a system with few alternatives. The solution lies in urban planning that balances livelihood with pedestrian rights. Many global cities have adopted models like hawker zones, night markets, or rotational stalls-designated spaces where street vendors can operate without obstructing public movement.\nBangladesh can learn from these examples. What's needed is a coordinated, long-term sidewalk management policy. City corporations, urban planners, and local administrations must work together to reclaim sidewalks for pedestrians-through proper planning, relocation strategies, and strict enforcement.\nUltimately, a city's progress is not measured by the number of roads or flyovers, but by how safely and freely its people can move. If walking becomes a daily battle, the city fails its residents. It's time to take honest, inclusive action-before sidewalks are lost permanently to chaos and control.\nA. R. Salauddin Ferdous\nDhaka\nferdous5803@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Sidewalks held hostage: Pedestrians suffer",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/sidewalks-held-hostage-pedestrians-suffer-1752848269",
        "news_paper_name": "The Financial Express",
        "publish_date": "19-07-2025"
    }
]