[
    {
        "full_article": "The Election Commission of India (ECI) seems to have softened its stand about disclosing absolute numbers of booth-wise votes cast in elections. Last year, when the question arose in the midst of the multi-phase general election, the ECI took the position that it had no legal mandate to disclose details of Form 17-C, part one, which contains the total number of electors in each booth and those who had actually voted, to anyone other than the candidate or its polling agent. In a recent hearing, it has said the Chief Election Commissioner, Gyanesh Kumar, who took over recently, is open to meeting representatives of organisations and individuals who have sought a direction to the ECI to upload scanned, authenticated and legible copies of Form 17-C on its website. The Supreme Court of India has asked Trinamool Congress Member of Parliament Mahua Moitra and representatives of the Association for Democratic Reforms (ADR) to give a representation to the ECI and seek a meeting. While it may not mean that the ECI has already agreed to make absolute numbers of voters universally available, it may result in evolving a system of disclosure about turnouts, both in terms of numbers and percentages. In 2024, the ECI did release some details about turnout through its voter turnout app, but it also became a source of endless speculation as the percentages given were seen to be unusually higher than what was disclosed at the close of polling.The prevalence of a difference of five to six percentage points between the turnout declared on polling day and subsequently revised figures, based on inputs from all booths, was noted at the end. This is normally explained as the result of a delay in collation of data from all booths, including those located in far-flung areas. However, the petitioners before the Court argue that Form 17-C is collected by available booth agents by hand, and it would not be a major problem for election officials to scan and upload it within 48 hours. The main grouse of political parties and activists is that the discrepancies, in the absence of the absolute number of votes cast but with only turnout percentages in hand, would raise suspicions about the whole process when the final results are released. The ECI has done well to offer to meet the petitioners on this question. There can be no dogmatic opposition to a procedural step to reduce the apprehension about any election being less than fair. It is futile to hold the position that every step demanding greater transparency in the electoral process is aimed at undermining its integrity or casting the process in a bad light. There ought to be a constant reassessment of existing procedures and practices to increase transparency and reduce the time taken to do so. Published - March 21, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Election Commission of India\n                    \n                            /                      \n                        \n                        General Elections 2024\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        All India Trinamool Congress\n                    \n                            /                      \n                        \n                        voting\n                    \n                            /                      \n                        \n                        politics",
        "headline_1": "​Free and fair: On the Election Commission, calls for transparency",
        "headline_2": "The Election Commission of India must not view calls for transparency as attempts to undermine it",
        "link": "https://www.thehindu.com/opinion/editorial/free-and-fair-on-the-election-commission-calls-for-transparency/article69353957.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "Indian cricket’s summer spectacle is entering its eighteenth season. The Indian Premier League (IPL), which debuted on a warm night at Bengaluru’s M. Chinnaswamy Stadium in 2008, has evolved into a global sporting juggernaut with immense commercial clout. The sheer volume and pace of matches may render individual moments fleeting, yet the tournament has deep roots and an ardent fan base. When defending champions Kolkata Knight Riders face Royal Challengers Bengaluru at the Eden Gardens on Saturday night, the commentary box will inevitably amplify the hype. Over the next two months, culminating on May 25, 10 teams will criss-cross India, battling for T20 supremacy. While similar leagues thrive in Australia and elsewhere, the IPL remains the gold standard. Beyond the on-field drama, the IPL continues to be a game-changer, with other cricketing nations struggling to retain their stars as freelance players increasingly prioritise IPL contracts. While the league runs on high stakes and intense performances, the Indian government’s recent move to ban alcohol and tobacco companies from leveraging IPL telecasts for surrogate advertising is a welcome decision. Given the tournament’s massive youth following, such restrictions are both necessary and responsible.Once, the Ranji Trophy was the primary gateway to India’s national team; today, the IPL serves as an escalator, fast-tracking talent into the international arena. From R. Ashwin in the early years to Hardik Pandya now, the league has been a launch pad for future stars. The once-daunting experience of sharing a dressing room with global icons has diminished, as young Indian cricketers now arrive at the highest level fully prepared. Longevity, too, is a hallmark of the tournament — stalwarts including M.S. Dhoni, Virat Kohli, and Rohit Sharma have been part of the IPL since its inception. At 43, Dhoni may be playing his final season for Chennai Super Kings, but with him, retirement predictions often go awry. While big-hitting batters dominate headlines, enigmatic spinners and lethal pacers command attention too. More than just watching Jasprit Bumrah in Mumbai Indians’ colours, fans will be eager to see when the injured speedster can make a full-fledged return. The same scrutiny will follow Pat Cummins and other key players, as the IPL not only sets the tone for the cricketing calendar but also provides crucial insights into the form and fitness of the game’s biggest names when the time comes for performance on the international stage. Published - March 21, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        Indian Premier League\n                    \n                            /                      \n                        \n                        cricket\n                    \n                            /                      \n                        \n                        bengaluru\n                    \n                            /                      \n                        \n                        Australia\n                    \n                            /                      \n                        \n                        tobacco\n                    \n                            /                      \n                        \n                        advertising",
        "headline_1": "​Coming of age: On the IPL, its 18th edition",
        "headline_2": "The Indian Premier League is setting new standards in cricket’s shortest format",
        "link": "https://www.thehindu.com/opinion/editorial/coming-of-age-on-the-ipl-its-18th-edition/article69353977.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "The gilli-danda of my childhood has come a long, long way since then\nMy childhood was a self-inventive enterprise. It had to be, because no one had yet invented video games, or smartphones to play them on. There was no text messaging, c u l 8er, no internet, no Facebook, no TV, not even black-and-white, to watch Netflix on.\nSo what did we do for entertainment? We flew kites, we spun tops, we played marbles, all requiring varying degrees of skill.\nBut the game that required the greatest hand-eye coordination was gilli-danda. The gilli was a small, about four-inch long, rounded piece of wood, whittled to a taper at both ends. The danda was a stout baton of wood, about a foot and a half long.\nA small hollow was made and the gilli was placed across it, a tiny bridge spanning a minuscule chasm.\nThen, knees slightly flexed, each player – the normal minimum requirement was two, but more were welcome – would in turn stoop over the gilli and, holding the danda in a firm double-handed grip, with a swift and smooth wrist action, flip the gilli up and out as far as possible.\nWhen all the gillis had been deployed afield the players in turn would go to their gilli and, with the danda, sharply strike one of the tapered ends, causing the gilli to spring up, cartwheeling in the air, from where in mid-flight it would be administered a resounding thwack! and sent soaring like a miniature ballistic missile in search of a horizon.\nThe game would continue until the imperatives of homework put an end to play, the winner being the one whose gilli had travelled the farthest distance.\nSince those half-remembered days of my boyhood, gilli-danda has come a long way, and is now a game for children of all ages. Special equipment has been designed for it, and it takes place in large, jam-packed arenas. Its players, dressed in colourful uniforms, are accorded an aura that outshines the limelight of movie stars. Yes, gilli-danda has indeed come a long way. Except it’s no longer called gilli-danda. It’s called IPL.\n\n",
        "headline_1": "Games people play",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/jugglebandhi/games-people-play-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "X’s lawsuit against govt is pushback against far too many takedown orders\nTwo cases, one fight. In Delhi HC, social platform X has said it cannot be “compelled” to join Union home ministry’s nodal cybercrime portal Sahyog. It said it cooperates on all crime-related matters. In Karnataka HC, X has filed a petition saying GOI has created a censorship mechanism using Section 79(3)(b) of the IT Act and Sahyog portal.\nIT Act’s Section 69A is the main tool that empowers GOI to direct intermediaries – social media platforms – to block access to material online that meet criteria from ‘national security’ to ‘public order’ etc. X and Indian govts have long been at loggerheads over their differing assessment of what constitutes ‘free expression’ and ‘harm to public order’. Section 79(3)(b) of the IT Act is a separate blocking process that mandates online platforms to remove content when directed by a court order or govt notification. It removes ‘safe harbour’ provisions for intermediaries – making them liable for third party content – if they don’t comply. It’s been argued that Section 79(3)(b) creates a gray zone for takedowns, encouraging often arbitrary use by a wide range of law enforcement agencies, ministries and govt depts.\nX in its previous avatar had lost its safe harbour protection in 2021 for not appointing compliance officers. It fell in line soon enough. Now, Musk’s X has sued GOI alleging “unlawful content regulation and arbitrary censorship”. While Trump’s US is moving towards unrestrained expression online, it’s also true that social media companies haven’t created sufficient protections against malice or incitement. Indian govts, on the other hand, have a low threshold for restrictions: journalists’ stories, farmers’ protests, handling of Covid, tag of manipulated media, satires, even documentaries. X, whose compliance on takedowns post Musk’s takeover has been high, is simply pushing back against GOI’s aggressive use of takedown provisions. It’s going to be an interesting battle.\n\n",
        "headline_1": "Musk vs GOI",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/musk-vs-goi/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "Memo to Trump: US needs foreign students as much as they need America’s excellent higher education\nIt’s too early to say what Trump wants from US universities, but freedom of speech is not it. The Mahmoud Khalil case is still playing out. Born in Syria to Palestinian refugees, he is under arrest for leading pro-Palestine protests at Columbia University. Ranjani Srinivasan, doctoral student from India, dodged handcuffs and a deportation flight just in time. Her visa was revoked for liking pro-Palestine posts. And now Badar Khan Suri, an Indian student at Georgetown University, has been detained for allegedly spreading Hamas propaganda. He has no criminal record and has not been charged with a crime, but is marked for deportation under the same rule as Khalil. Politico says Suri may be in US crosshairs because of his wife’s Palestinian origin. A few more of these cases could give international students and their families chills. Data shows that won’t be good for America.\nLast year, US had 1,126,690 foreign students from more than 200 countries – a record. More than one quarter of them – 331,602 – were Indian. Trump’s admin views these students as Uncle Sam’s Burden. “It is a privilege to be granted a visa to live & study in the United States of America,” the chief of Homeland Security wrote on X in connection with the Srinivasan case. Yes, but these 1.1mn-plus students poured $43.8bn into the US economy, which is equal to Apple’s July-Sept iPhone revenue in 2023, and not far behind GM’s global revenue in Oct-Dec 2024. The average annual spend per student touched $40,000, which compares well with US median pay of $48,000 in 2023.\nClearly, international students aren’t a burden on the US taxpayer. Most of them pay full tuition, which helps universities subsidise US students. And don’t forget the 378,000 US jobs these students create. At a time when universities from Harvard to Pittsburgh have frozen hiring due to reduced govt support, international students are a revenue stream they can’t afford to lose.\nBeyond money, consider America’s shortage of citizens in STEM courses. That’s why one in every five STEM workers is a foreigner. How do they reach America? Mostly as students. Data shows 56% of international students study STEM in US. Like Hollywood, US universities are part of America’s soft power. They mould views and widen America’s circle of influence. All of this is seemingly at stake now.\n\n",
        "headline_1": "Suri/Srinivasan Story",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/suri-srinivasan-story/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "The long-awaited conversation between Trump and Putin on March 18 confirmed what was already clear – Russia is not prepared to end its war.\nFor Kremlin, talk of a ceasefire is merely a tactic to prolong aggression. Following their discussion, Putin refused to agree to a proposed 30-day truce, instead vaguely suggesting a mutual halt to strikes on energy infra. Just hours later, he brazenly violated his own words, launching another wave of Shahed drone attacks on central Kyiv.\n\nFor Trump, the situation is fraught with difficulty. Pressuring Moscow would be an admission that his approach since assuming office two months ago has been flawed.\nRead full story on TOI+.\n\n",
        "headline_1": "Trump-Putin won’t cease the fire",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/trump-putin-wont-cease-the-fire/",
        "news_paper_name": "The Times of India",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "We are concerned about the prevailing sense of inertia and stagnation within the administration despite more than seven months passing since its formation following the mass uprising. According to a report by this daily, the public's expectations for swift and dynamic governance have yet to be met, for which multiple factors are responsible. While part of it was beyond the control of a non-political government with a short lifespan—inheriting as it did a deeply dysfunctional system riddled with obstacles—its failure to steamroll through them with tact and firmness is also largely to blame.\nReportedly, one of the most significant disruptions in the administration has been the frequent transfers. For instance, since August 5, the regulation wing of the public administration ministry alone has seen at least four additional secretaries being appointed and then transferred in quick succession. Such inconsistency undermines the continuity and on-the-job experience needed to ensure effective governance. Equally problematic has been the effect of contractual appointees, many of whom were brought back from retirement and seemingly have little incentive to push for change while long-serving officers, deprived of promotions due to their presence, continue to feel disconnected and demoralised. One statistic that perfectly captures this chaotic shake-up combining transfers, promotions and contractual appointments is that, out of the 81 secretaries, 25 were appointed during the previous government while 56 by the current administration, including 17 on contract. This overhaul has not had the outcome intended.\nCritical reforms that could have been implemented with mere administrative directives remain stalled. Our correspondent spoke to a dozen bureaucrats, ranging from deputy secretary to secretary in five ministries, who acknowledged that the lack of order, coordination, motivation, or accountability is having an effect on even routine tasks. For example, despite an Advisory Council directive on January 30 to review the quota system, no proposal has been presented to the cabinet to date. Similarly, the transfer of the Land Registration Office from the law ministry to the land ministry, a move that could improve efficiency, remains unaddressed. The absence of strong and regular engagement from top officials has also contributed to this inertia. Reportedly, Chief Adviser Prof Muhammad Yunus has held only one secretary-level meeting and visited the Secretariat only once since taking office. In such a vacuum, officials have defaulted to a passive stance.\nThis needs to change. The interim government was entrusted with stabilising the country and setting the stage for long-overdue reforms, especially in the administrative system. Allowing bureaucratic apathy and inactivity to persist will only erode public confidence in it. The authorities must take steps to ensure that all departments and offices are held accountable regularly, and that mechanisms are implemented to ensure that officials at all levels work collaboratively to serve citizens.\n",
        "headline_1": "Bureaucratic inertia must be fixed urgently  ",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/bureaucratic-inertia-must-be-fixed-urgently-3853621",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "US Director of National Intelligence Tulsi Gabbard's recent remarks on Bangladesh are not only irresponsible but also unfair and baseless. As the chief of US national intelligence, her words carry significant weight, making it imperative that they be backed by credible evidence and diplomatic prudence. Instead, Gabbard's comments reflect a broader pattern of propaganda, particularly one emanating from India, that seeks to malign Bangladesh's reputation on the global stage. This is not merely a diplomatic faux pas but an act with severe repercussions for Bangladesh's global standing.\nDiplomacy is not just about power but also responsibility. As former UN Secretary-General Kofi Annan once said, \"To live is to choose. But to choose well, you must know who you are and what you stand for.\" As a senior intelligence official, Gabbard should recognise that her statements about Bangladesh carry consequences. A responsible diplomat does not make sweeping generalisations about another nation without substantial proof. Ethics in international relations demand fairness, respect, and factual accuracy—qualities evidently absent in her remarks.\nGabbard's approach to Bangladesh can be analysed through the lens of international psychology. States that perceive themselves as superior often develop a patronising attitude towards smaller nations, a phenomenon best described by political scientist Noam Chomsky, \"The powerful do what they want, while the weak suffer what they must.\" This mindset drives nations to interfere in the affairs of others under the pretext of human rights concerns, when in reality geopolitical motives often lie beneath the surface.\nHer comments mirror a long-standing psychological pattern where Western and larger states adopt a paternalistic role towards smaller, developing nations. Psychologist Alfred Adler's theory of superiority and inferiority complexes explains this well: powerful nations often assert dominance over others, under the guise of guidance or correction, to reinforce their own self-image as global leaders. Bangladesh, having fought against extremism with great success, does not need unsolicited and factually incorrect judgements from a foreign intelligence head.\nAs historian Edward Said noted in his seminal work Orientalism, the West has long held a distorted and condescending view of the East, shaping narratives to maintain ideological dominance. Tulsi Gabbard's statements reflect this enduring bias, where Bangladesh is unfairly categorised despite its strides towards progress and stability.\nGabbard's words are not just an oversight but a strategic move in the broader game of influence. By painting Bangladesh as a breeding ground for extremism, she indirectly strengthens India's long-held geopolitical ambitions in the region. This aligns with what Italian philosopher Antonio Gramsci called \"cultural hegemony,\" where dominant forces manipulate discourse to maintain control over the international order. The theme of labelling independent nations as \"unstable\" or \"extremist\" has been used repeatedly by powerful states to justify intervention and coercion. Gabbard's accusations fit this troubling pattern.\nIt is no coincidence that Gabbard made these comments at a conference in India. The historical pattern of propaganda against Bangladesh from a certain section in India is well-documented. From exaggerated reports of human rights violations to the systematic portrayal of Bangladesh as a hub of Islamist extremism, this section, which also includes some media platforms, has repeatedly sought to undermine Bangladesh's independent political and social trajectory.\nThe timing of her remarks is also suspect. The interim government in Bangladesh is actively working to rebuild democratic norms and restore stability after years of authoritarianism. By raising unfounded allegations at this juncture, Gabbard inadvertently or deliberately provides fodder for forces that seek to destabilise Bangladesh.\nResponsible statesmanship requires basing assertions on verified facts, not political expediency. As Aristotle aptly put it, \"The least initial deviation from the truth is multiplied later a thousandfold.\" If Gabbard had credible evidence of systemic persecution in Bangladesh, it should have been presented through proper diplomatic channels instead of being aired in a sensationalised interview.\nFormer US Secretary of State Colin Powell, reflecting on the Iraq War intelligence failures, famously admitted, \"What we know now, we should have known then.\" This acknowledgment of past mistakes highlights the dangers of acting on misinformation, something Gabbard should take into account before making unverified claims.\nBangladesh's track record in protecting minorities speaks for itself. The country's constitution guarantees religious freedom, and its leadership has consistently condemned communal violence. The occasional incidents that do occur are neither state-sponsored nor reflective of the nation's broader ethos.\nHistory is rife with examples of how unverified allegations have led to disastrous consequences. The 2003 invasion of Iraq, justified under the pretence of \"weapons of mass destruction,\" remains one of the most egregious cases of misinformation being used as a tool for political manoeuvring. Philosopher George Santayana's warning remains relevant, \"Those who cannot remember the past are condemned to repeat it.\"\nGabbard's statements, if left unchallenged, could create an international perception that justifies unwarranted interventions, sanctions or diplomatic hostilities against Bangladesh. This is not just about national pride, it is about protecting the country's sovereignty against an emerging pattern of disinformation.\nGabbard, and politicians like her, should practise greater prudence when assessing another country. Reckless comments based on flawed narratives do not help Bangladesh, the US, or the cause of global peace.\nThe international community must demand higher standards of integrity and objectivity from political figures entrusted with global security. Engaging in constructive dialogue, rather than relying on baseless rhetoric, is the way forward.\nBangladesh has fought hard against extremism and has made commendable progress in religious inclusivity. Unsubstantiated allegations from foreign officials should not be allowed to dictate the narrative of a nation that has time and again proven its commitment to peace and progress. It's high time that international leaders remembered the words of Voltaire, \"Those who can make you believe absurdities can make you commit atrocities.\" Let's resist the politics of misinformation and stand firm against the forces that seek to tarnish Bangladesh's reputation for their own strategic gains.\nH.M. Nazmul Alam is an academic, journalist, and political analyst. He can be reached at [email protected].\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Why Tulsi Gabbard’s statements on Bangladesh matter",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/why-tulsi-gabbards-statements-bangladesh-matter-3853281",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "On a cold, frosty winter's night in early January, I was standing outside a women's prison about 20 miles from where I live in Bath. I was not alone; we were about 300, mainly middle-aged or older.\nWe convened first in a pub close by to receive our instructions and walked in the dark, holding lanterns, for about half a mile, in an orderly procession. We were there to celebrate and protest. Gaie Delap was aware of our presence outside as she observed her 78th birthday inside the prison, as we were doing. The prison authorities had acceded to the request for us to be there, outside the entrance to the floodlit campus, fenced off with razor wire. Inside were approximately 380 women, many of whom, in Gaie's judgement, should not be there but rather supported in the community whether for drug addiction or mental health issues or defending themselves against domestic abuse. And then there was Gaie, a retired teacher, grandmother, and indeed a sister-in-law of a former director of Oxfam in Bangladesh, which is how I came to know Gaie, having also taught her niece as a student. Her niece also spent some time in Bangladesh, working in Dhaka slums with Proshika. Gaie's brother, Mick, my student's father, had worked with the Africa desk of the BBC World Service. He campaigned tirelessly for Gaie's release. I record all this to demonstrate that this is a family with a strong social conscience, and thus not your typical prison inmate!\nLast year, Gaie was sentenced to 20 months in prison for being part of the Just Stop Oil protest, which blocked traffic for a while on the M25 motorway that encircles London. Some of her fellow protesters were given longer sentences, up to five years. Under sentencing practices in the UK, one can be released earlier and electronically tagged with a leg or wrist bracelet. This ensures that the conditions of release are honoured, usually subject to an HDC (a home detention curfew,) from 7pm to 7am. The reader should also be aware that in the UK, following years of Tory government neglect, the prison capacity is seriously overstretched. The new Labour government were approving early releases for quite serious offences during this winter, much to the disgust of the hypocritical Tory press. Gaie was released under this scheme on November 18, 2024 and re-arrested 20 days later just before Christmas and recalled to prison.\nWhat went wrong? The UK government sub-contracts the tagging service to a large private company, Serco, which provides a multitude of services to the government across justice, immigration, defence, transport, health, and citizen services. It describes itself as bringing \"the right people, the right technology and the right partners to create innovative solutions that make positive impact and address some of the most urgent and complex challenges in the modern world.\" Well, not in this case! Tags are usually placed around the ankle, but Gaie had a medical condition in her legs which inhibited that option. But she had wrists! However, Serco could not access an appropriately sized bracelet tag for her wrists. So, just before Christmas, she was re-arrested and sent to a different prison, nearer to her home in Bristol. This was despite Gaie indicating her agreement that she had offended under the law and had accepted her sentence while also indicating that she had no intention of offending again. By any amount of common sense, this nearly 78-year-old grandmother was not a threat to the public.\nThis is why more than 300 of us were outside the entrance to her prison on a cold, frosty night in early January, engaged in a silent, dignified protest, though also singing \"Happy Birthday\" to her.\nThree weeks later, the news appeared that her 20 days of \"freedom\" (from late November until mid-December, just before Christmas), through no fault of her own, were deemed \"illegal,\" and that these days would be added to her sentence before her next \"early release\" date in March this year. In the UK, we are familiar with Charles Dickens's expression \"the law is an ass!\" Well, it certainly has been in this case. And then in the first week of February came the news that a wrist tag had been sourced, and Gaie could be released on licence!\nIn 1994, in Bangladesh: Whose Ideas, Whose Interests, I included a chapter on the problem of the franchise state. I then argued that the solution to good governance was not to franchise out essential, rights-based, government functions to private profit or not-for-profit organisations. At that time, I was concerned about the paradox of donors supporting good governance on the one hand, while funding NGOs to undertake essential state functions as voluntary rather than statutory organisations. That separation prevents governments from being held accountable, as governments defend themselves by blaming the contractor, while the contractor asserts their compliance with the contract and denies responsibility for failure. Since Margaret Thatcher, we have had that problem in spades in the UK; blame for failure is bounced around between ministries and private contractors, between policy ideas and those responsible for implementation.\nIn Gaie Delap's case, Serco failed to uphold their contract. Will it be prosecuted or fined for this failure? Unlikely. It employs many lawyers. Instead, the absurdity of the law even adds 20 days to Gaie's sentence, when just a shred of common sense would dictate otherwise. The UK is experiencing several current such examples of Alice in Wonderland: the post office scandal with thousands of sub-postmasters prosecuted for accounting discrepancies because the software provider provided a faulty service with compensation still owed after years of enquiry and judicial findings against both the post office and its contractor; poor regulation of blood quality in transfusions, unresolved after decades, claimants with blood infected by HIV or hepatitis C dying through old age before claims are met; Andrew Malkinson imprisoned for 17 years for a murder he did not commit, because the contracted review service (Criminal Cases Review Commission) ignored new evidence a decade ago, and now that he has received some upfront modest compensation, he is in danger of his entitlement to social housing being denied. How does Malkinson stand up to this unholy alliance between the bureaucratic state and corporate interests? No chance to do so given monopoly lawyers' fees and the withdrawal of publicly funded Legal Aid. Absurdity is reinforced by exclusion. Rights denied.\nDr Geof Wood is a development anthropologist and author of several books and numerous journal articles, with a regional focus on South Asia. He is also emeritus professor of international development at the University of Bath, UK.\n\nViews expressed in this article are the author's own.\nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Absurdity of justice",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/letters-the-uk/news/absurdity-justice-3853266",
        "news_paper_name": "The Daily Star",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Complying with core ILO Conventions by deadline",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/complying-with-core-ilo-conventions-by-deadline-1742483987",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "World community leaves Palestinians and Rohingya in the lurch",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/world-community-leaves-palestinians-and-rohingya-in-the-lurch-1742484053",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Deterrent to campus violence",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/deterrent-to-campus-violence-1742484111",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-03-2025"
    },
    {
        "full_article": "",
        "headline_1": "Measures to curb fare evasion in Metro Rail",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/measures-to-curb-fare-evasion-in-metro-rail-1742484188",
        "news_paper_name": "The Financial Express",
        "publish_date": "21-03-2025"
    }
]