[
    {
        "full_article": "The IMF’s ‘C’ grade for India’s national accounts statistics should be a matter of concern for India, which has a reasonably robust data collection and analysis apparatus in place. A ‘C’ grade is the second lowest there is, and implies that there are some issues with the data that impede the adequate surveillance of the economy. National accounts not only include zoomed out macro indicators such as GDP and GVA but also sectoral metrics and measures of investment levels, consumer spending and — of particular interest right now — how exports are doing. Issues with these metrics, therefore, impede effective and targeted policymaking. A grade of ‘C’ puts India in the same league as China when it comes to its national accounts, a decidedly unenviable position to be in. The IMF is not the first to point out the flaws in India’s national accounts. Nor is this the first time that it has pointed them out. The IMF’s main problem with the national accounts data, that its base year of 2011-12 is very outdated, has been pointed out time and again. Outdated data is a problem India has been grappling with for a while now. The Index of Industrial Production and the Consumer Price Index both have a base year of 2011-12. In fact, even the IMF said the reason that India’s CPI received a grade of ‘B’ and not ‘A’ was because of the outdated base year. The outdated base year and the inordinate weightage of food in the CPI have resulted in India not being able to accurately capture price movements. Consequently, the RBI’s monetary policy is also impaired.The government is currently in the process of updating the base years and methodologies for national accounts, CPI, and IIP, with the new series due to be launched in early 2026. Perhaps the biggest issue with the national accounts statistics in India — and the area that requires the most attention — is the inability to accurately capture the informal sector. The informal sector, by definition, is extremely difficult to quantify since it comprises entities that are unregistered and cash-based. Yet, a more accurate estimate of the informal sector will not only materially impact the growth rate and size of the economy but will also lend crucial insight into how the bulk of India’s population is doing. India’s national accounts estimation has certainly improved over the years. The 2011-12 series included granular data from India’s corporate sector through the MCA-21 database, replacing the earlier Annual Survey of Industries. The proposed inclusion of GST data in GDP estimation in next year’s series is a welcome improvement. The IMF’s grade just further underscores how damaging delays in data releases and upgrades can be. Published - November 29, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        investments\n                    \n                            /                      \n                        \n                        China\n                    \n                            /                      \n                        \n                        government\n                    \n                            /                      \n                        \n                        economy (general)\n                    \n                            /                      \n                        \n                        exports\n                    \n                            /                      \n                        \n                        Reserve Bank of India",
        "headline_1": "​Data deficiencies: On India and the IMF’s low grading",
        "headline_2": "IMF’s low grading shows how damaging delays in data upgrades can be",
        "link": "https://www.thehindu.com/opinion/editorial/data-deficiencies-on-india-and-the-imfs-low-grading/article70335187.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "The recent escalation of tensions between China and Japan has become one of the most serious diplomatic crises between the two Asian giants. The trigger was Japan’s new Prime Minister Sanae Takaichi’s November 7 statement that any Chinese military actions against Taiwan could pose a threat to Japan’s survival, implying that Tokyo might intervene militarily. This was the first time a sitting Japanese Prime Minister made an explicit remark about Japan’s stance on a potential Chinese military action in Taiwan, marking a sharp departure from the cautious strategic ambiguity that Tokyo had long maintained. An enraged China has demanded that Ms. Takaichi retract her remarks, and has banned Japanese seafood imports and issued travel advisories to its citizens to avoid Japan. China has also claimed that Japan is planning to deploy missiles on Yonaguni island near Taiwan, calling it “an extremely dangerous move”. Chinese Coast Guard vessels are also patrolling the waters around the disputed Diaoyu/Senkaku Islands in the East China Sea, actions Japan says violate its territorial waters. Beijing has warned that any Japanese military intervention in Taiwan would be treated as an act of aggression.China’s anger is not entirely unfounded. Japan’s colonial legacy still casts a long shadow over the region. From 1895 to 1945, Taiwan lived under Japanese occupation following the Treaty of Shimonoseki. Japan’s brutal occupation of parts of China left wounds that are still raw in Chinese collective memory. Taiwan was returned to Chinese control after Japan was defeated in the Second World War, but became a separate administrative entity when the Kuomintang retreated there following the communist revolution of 1949. Although Taiwan has been self-ruled ever since, China considers it as a core sovereignty issue, a position acknowledged by most countries, including the U.S., through their adherence to the One-China policy. For decades, the status quo helped preserve the Taiwan Strait. Despite the deep mistrust, China and Japan remain economically intertwined — bilateral trade exceeds $300 billion annually. But the election of Ms. Takaichi, a hardline nationalist, and her provocative rhetoric, coupled with China’s forceful response, now threaten to usher in an era of full-spectrum hostility in East Asia. An immediate solution to the Taiwan issue is unlikely. For peace and stability to endure, especially amid global conflicts, the status quo — shaped by China’s claims, Taiwan’s self-rule, America’s strategic ambiguity and restraint on all sides — must be preserved. China and Japan should de-escalate and refocus on strengthening economic cooperation. The U.S., Japan’s treaty ally, must balance its security commitments with diplomatic efforts that are aimed at preventing miscalculation. Published - November 29, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        China\n                    \n                            /                      \n                        \n                        Japan\n                    \n                            /                      \n                        \n                        diplomacy\n                    \n                            /                      \n                        \n                        unrest, conflicts and  war\n                    \n                            /                      \n                        \n                        Taiwan\n                    \n                            /                      \n                        \n                        oceans\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        trade policy\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        seafood\n                    \n                            /                      \n                        \n                        imports",
        "headline_1": "Tense waters: On China-Japan tensions",
        "headline_2": "China and Japan must de-escalate and focus on economic cooperation",
        "link": "https://www.thehindu.com/opinion/editorial/tense-waters-on-china-japan-tensions/article70335160.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "Product design is dying, India should revive it \nWhy did T800, the Terminator, have an internal display reading out data in English, when it was an autonomous machine ‘thinking’ in zeroes and ones? Well, it needed the ‘feature’ to reinforce the character’s ‘machineness’ – a purpose arguably better served by Schwarzenegger’s wooden dialogue delivery . In that light, T800’s display was genius design. Alas, judging by all the new stuff on our shelves and streets, the design genie has left the building. \nTime was when even Robinson Crusoe, when he returned to civilisation, wouldn’t have mistaken a radio for an oven. Now, the rest of us can sometimes mix up Musk’s Cybertruck with a deep freezer. As for his ‘Robovan’ – “it’s coming,” he wrote on Friday – it could be a camping tent or Iron Man’s mask, depending on your angle of view. This is not to pick on Musk, who has fathered some nice looking cars before, but to generally assess the state of the design art. \nThe prevailing mantra is to make everything flat, and black. Or shiny silver. Microwave, water purifier, TV – they all look like variations on your smartphone. This, we are told, is futuristic. But since good design draws inspiration from environment – the classic Vespa from a wasp, and the classic VW Beetle from a beetle – are we headed into a future where our only inspiration would be flat walls? It could happen if AQI remains as dreadful as it is now, but it would be a depressing future. \nWhat will it take to make things beautiful and evocative again, like the moka pot (1930s), and the Eames lounge chair (1950s)? Where’s the gorgeous modern scooter that could star in a remake of Roman Holiday? As the world’s two-wheeler king, India should make it. In fact, given its rich design traditions, India should aspire to become the world’s product design studio. That’s one thing China, with its regimented thinking, hasn’t been able to do. Young and free India has an edge.\n\n",
        "headline_1": "Studio India",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/studio-india/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "Power & prejudice define what we mean by mental disability \nSimon Jarrett, a nursing assistant in the 1980s in a south England hospital for the mentally ill, recoiled when he read the file of his first patient, G, who had been admitted in 1924 aged 6. The file said: ‘G is a bat-eared cretin’. Only for Jarrett to learn the insult was the ‘official’ term for the mentally deficient in 1920s-30s. \nThose They Called Idiots: The idea of the disabled mind from 1700 to the present day by Simon Jarrett traces how society’s view on ‘intellectual disabilities’ evolved – historically labelled ‘idiots’, ‘imbeciles’, ‘feeble-minded’ etc. The “idea of the disabled mind”, the book argues, is neither fixed nor natural but has changed given cultural, legal, medical, racial and political contexts.\nIn the 18th century, those considered ‘idiots’ were neither isolated nor locked away. They lived within families or communities, worked (even if involuntarily) and contributed. They weren’t ‘beyond’ society but lived in everyday social imagination – including in unkind jokes. \nThe mid-19th century to 1980s saw their ‘incarceration’ – about 140 years of institutionalisation, locked away from the mainstream. This had its roots, the book argues, in ideas of Enlightenment, which had built ‘mental attributes’ that made one ‘human’. The bureaucratic state that followed took those ‘different’ in its ‘care’ – a life of routine & regulation, cruelty & humiliation, were part of the drill. Emerging ideas of citizenship, responsibilities & roles, demanded certain ‘mental ability’ in order to ‘belong’. Those deemed deficient were carted off to the ‘medical terrain of asylums’. \nEugenics deeply influenced attitudes. Nazi experiments saw the ‘mentally defective’ as threats to social “purity”, leading to untold horrors of dehumanisation. Enter democratisation & meritocracy, and, where was the place for the unintelligent? \nThe race for mechanisation, cybernetics, disappearance of ‘routine work’, the book quotes laureate physicist George Thomson, were problematic: “What is to happen to the really definitely stupid man, or even the man of barely average intelligence?” Thomson foresaw the “stratification of society and allocation of resources according to intelligence as nothing less than a headache for future politicians.” \nIn England, post-war welfare state model swept all mental deficiency charities and hospitals into state care under NHS. But as the book argues, “What role could medicine play in the lives of these people who were simply who they were, who happened to have a lower level of mental faculty than others but for whom there was no form of medical intervention that could treat, change or cure?”\nParents would be pressured to institutionalise infants, and the “authority was so… unquestionable, it was difficult for parents to resist, even if they were desperate to keep their baby.” The book argues that even post war, the eugenics influence was sustained, if “disguised”. The idea was to forget this one, and try for a “more successful outcome”.  \nBut then, parents began to oppose the “soulless arrogance” of doctors who would dismiss their offspring as “less than human”. They became a “site of opposition” to medical authority. The movement captured public attention, till laws and govts and societies conceded these are people in need of justice, not isolation. Jarrett provokes a rethink of the idea of mental disability not as a flaw, but a reminder that the measure of ‘normal’ is shaped by history, power, and attitude. Who we call an ‘idiot’ says much about us. \n\n",
        "headline_1": "An Intelligent & Caring Guide To ‘Idiots’",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/an-intelligent-caring-guide-to-idiots/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "Few frauds are as funny as those related to insurance\nRemember the farmer in England who claimed insurance for his phone that had disappeared into the insides of a cow while he was helping it calve? Or the woman who lost her phone when she left it in a sponge cake pre-bake? Both phones were, ahem, retrieved, as it were, but not quite in working condition. If ever there’s a list of bizarre and fraud insurance claims, here’s one for the top five. A businessman in UP tried to cremate an employee’s remains. Only, ground staff discovered the corpse was a dummy. Verily, the doll is dead, long live the droll. The businessman had a neat Rs 50L policy in the employee’s name in the hope of cheating insurers by faking his death. \nTo be dead serious, insurance fraud is no joke. Just weeks ago in Nov, Lucknow cops arrested a couple for duping insurers of Rs 25L payout by faking the husband’s death. Financial distress and mounting debts are apparently pushing otherwise-most-ordinary middle-class people to extreme actions and criminal behaviour. Of course, crash-for-cash and burning down property are classic frauds insurers are ever alert to. As is inflating medical bills or pretending an injury is more severe than it is. So what’s the upshot? Insurers get even more tightfisted when it comes to honouring genuine claims. Every insurance fraud makes insurance companies 10 times more nasty when dealing with people who really need help. \n\n",
        "headline_1": "Claim To Fame",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/claim-to-fame/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "That SC has many times overturned its own rulings should be celebrated, not lamented. The 2-judge bench’s critique misses the point. From strengthening fundamental rights to decriminalising gay sex, guaranteeing right to privacy to stopping misuse of sedition, SC reviews have protected citizens\nOn Wednesday, a two-judge Supreme Court bench observed the court is pained at the “growing trend of revisiting and overturning of its own verdicts by subsequent benches”. Ironically, this obiter dictum came on the day the country commemorated its 75-year-old Constitution, one recognised by SC and jurists as a living document, open to dynamic interpretations with passage of time.\nRead full story on TOI+ \n\n",
        "headline_1": "Supreme change of mind",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/supreme-change-of-mind/",
        "news_paper_name": "The Times of India",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 29, 2025 00:00:00  \nThe findings by the 12-member government probe body formed following last month's devastating fire at the import cargo complex of the Hazrat Shahjalal International Airport (HSIA) are nothing extraordinary. That the fire resulting from an electrical short circuit was a pure accident and not caused by any design was only expected. This observation by the probe body is no doubt reassuring as it dismisses any speculation of sabotage. However, the probe report sounds too familiar as one might recall here instances of other destructive fires such as the one that broke out last December at the highly protected Bangladesh Secretariat buildings. \nThe secretariat fire destroyed invaluable government documents. The high-powered probe committee in that case also found from CCTV footage that loose electrical connection had caused sparks which gradually turned into a flashover. Now, in the present case of HSIA fire, the relevant authorities need to explain as to why private courier outlets were allowed to operate and inflammable materials kept in a very sensitive area of the airport without any regulatory oversight for so long. As the probe report exposed, the area of the HSIA destroyed by the fire was marked by dangerous storage practices lacking in the most rudimentary fire prevention measures like fire alarms, smoke detectors, sprinklers or any operational hydrant.\n What is further shocking about the just submitted government probe report is its reference to the fact that the destroyed cargo village of the HSIA in question did, also in the past, experience seven similar incidents of fire, which, if common sense is any guide, were no less damaging, since 2013. The public were reported to have been denied access to any information regarding those fire incidents for reasons best known to the Civil Aviation Authority of Bangladesh (CAAB) of that time. But why was this hush-hush approach to those past fire incidents by CAAB which is supposed to oversee the overall management of HSIA? It is hard to believe that all such incidents of fire were accidental. Otherwise, why was the information about the past HSIA fires suppressed? In that case, it is not enough to just state that the fire incidents also happened in the past and that those went unreported. Given such a history of repeated past fires at the HSIA's import cargo complex, the issue demands more serious attention than it has received until now from the interim government. \nAdmittedly, it has been a commendable step on the part of the high-level government investigation committee to have brought to the fore the past instances of gross professional negligence by the authorities concerned. But the public would like to know if any heads did roll in the past for the callous neglect of the safety issues at the same section of the HSIA and if any action would be taken against those responsible at present for ensuring safety of import cargo space of the airport. Even if the latest HSIA fire has been caused accidentally by an electrical short circuit, as stated in the probe report, the failure to install fire safety measures at such a sensitive place cannot go unaccounted for. Also, those in charge of the place and supposed to have every inch of the cargo complex under close inspection must answer for the failure to fix the loose electrical circuit. Hopefully, the interim government this time would do the needful to ensure safety and security of the HSIA's cargo village.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "HSIA fire probe needs to go deeper",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/hsia-fire-probe-needs-to-go-deeper-1764335357",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Muhammed Showaib   |  \n       November 29, 2025 00:00:00  \nIt is never wise to put all eggs in one basket where a single misstep can cause them all to break. A nation's \"basket\" is its export profile and over-reliance on a single sector makes it vulnerable to volatile global demand. Yet despite decades of discussion and repeated calls for diversification, Bangladesh's export structure has shifted very little since it first entered global markets. The decline of jute and jute goods from their once-dominant position did not trigger any meaningful broadening of the export base either. Instead, export concentration simply shifted to a narrow set of new products. Today, a handful of goods make up most of the export basket and a limited number of markets continue to absorb the bulk of what Bangladesh sends abroad.\nOver the past few decades, readymade garments came to define Bangladesh's export identity and it still influences where Bangladeshi products can reach. While some nations have moved away from apparel manufacturing and now import from Bangladesh, many others still produce their own garments and have limited demand for our supplies. But because the garment sector already guarantees a dependable global market, they draw most of the focus, leaving other exportable products without the push they need to grow. Until new products establish themselves, the expansion of destinations will continue to be limited. It is in this context that the recent gains in a few non-traditional sectors should be judged. Rather than signalling a sudden transformation, these trends highlight how long Bangladesh has waited for industries beyond apparel to gain a solid foothold. The toy industry and the wider plastics sector provide examples of what might have emerged much earlier and on a much bigger scale had there been sustained investment and consistent policy commitment. \nRecent figures show that toy exports could grow more than eightfold within the next five years, a pace that would have seemed unthinkable not long ago. In 2022-2023, toys from Bangladesh reached 88 countries and earned more than US$75 million. Projections now suggest that by 2030 this amount could climb to nearly $470 million. If Bangladesh stays on this path, it could even break into the ranks of the world's top 30 toy exporters soon. At home, plastics now serve a massive domestic market worth Tk 400 billion. The industry contributes about Tk 35 billion in annual revenue and supports nearly 5,000 factories, most of which are small and medium enterprises that form the backbone of our local economy. This goes to show that there are industries in Bangladesh with genuine potential, ready to grow if given the right support.\nThat said, the success of toys and plastic, impressive as it is, doesn't change the fact that they remain isolated examples within an export basket still heavily dominated by one sector. The clearest evidence of this is that readymade garments continue to account for more than 82 per cent of export earnings. Policymakers and business leaders have acknowledged the need for a broader product base and more diverse destinations but this shift has not taken place. Businesses have simply responded to the incentives and market conditions in front of them, and those conditions have kept garments at the centre of the export earnings. \nThis overconcentration doesn't stop with products but it extends to markets as well. Nearly two thirds still go to Europe and the United States for reasons understandable. According to the Export Promotion Bureau, 44 per cent of all exports go to the European Union alone because tariff-free and quota-free access is still available for least developed countries. Even as Bangladesh achieved a record $48 billion in exports last year, the share going to these two markets declined only slightly from 65 per cent to 62 per cent over three years. Taken together, these trends show how firmly set our reliance has become. A few emerging sectors, promising as they are, cannot change this underlying vulnerability. Without real diversification, Bangladesh will continue to depend on a small and fragile group of markets which keeps the economy exposed in ways that have persisted for years. \nThus far, the range of exportable goods remains critically narrow, which is why non-apparel products have struggled to gain significant traction in new markets. When the list of products is small, the list of markets naturally stays small too, no matter how often diversification is discussed. This basic issue also explains why cash incentives for non-traditional exports have yielded only modest results. Today, these incentives cover more than 40 products, with garment exporters receiving an additional two per cent for shipments beyond the main markets of Europe, North America and the UK. Yet analysts are far from unanimous on how effective these measures really are. Because garments dominate the export structure so heavily, most of the incentives inevitably end up in that single sector. Many experts argue that support should instead target specific products and specific destinations where progress can be clearly tracked, rather than being shaped by pressure from powerful industry groups. \nOutside the garment sector, most industries face a different set of challenges. Many struggle to meet international quality and certification standards while weak domestic testing and accreditation systems slow down market entry and drive up costs. High logistics expenses, chronic congestion and inefficient transport networks further weaken competitiveness. On top of that, the absence of free trade agreements blocks access to lower tariff rates in potential new markets. These barriers must be removed. \nThe journey towards a more diverse export economy is challenging but it cannot be avoided. If Bangladesh wants lasting economic stability, the vision of diversification must move beyond rhetoric and translate into decisive action. The rise of the toy industry is a proof that steady effort can pay off. Applying the same commitment to other promising sectors is the surest way to build a balanced and resilient export future.\nshowaib434@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Why Bangladesh fails to diversify its exports",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/why-bangladesh-fails-to-diversify-its-exports-1764335424",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Tanim Asjad   |  \n       November 29, 2025 00:00:00  \nAfter the July mass uprising that led to the downfall of the autocratic regime of Hasina on August 5 last year, numerous groups have emerged in the country with various demands. Though some of the demands are rational and legitimate, many were deployed mainly to create chaos. Again, some of these groups are aggressive and try to present themselves as the sole agents of certain ideas and thoughts. Several religious groups have also emerged with demands for establishing religious laws, Islamic shariah to be precise, and removing anti-Islamic practices. The rise of the so-called Tawhidi Janata is such a group which has also come out in different parts of the country. \nIt is true that during the suppressive and intolerant regime of Hasina, any legitimate move to place a demand was brutally suppressed on the plea that an anti-state or anti-liberation force ignited the demand or protest. So, it was really difficult for many to press their justified causes and seek remedial steps. Such oppression has also intensified disappointment and anger against the previous regime. As the July mass uprising removed these barriers to a large extent, many think they could do whatever they like. In reality, some are also doing things on their own whims without caring about others. The weak enforcement of law and order by the Yunus-led interim government also created room for these disturbances by these groups, including the so-called Tawhidi Janata.\nThe Arabic term Tawhid means the oneness of Allah as the supreme creator and lord in Islam. In other words, it is Monotheism which is the core foundation of Islam and a precondition for being a Muslim. The Islamic principle of Tawhid strongly disapproves of any form of partnership with Allah. Anyone who associates anything with Allah in any form as another god or lord is known as a Mushrik, and the act is a matter of grave crime and sin in Islam. The Islamic clerics and scholars have also outlined several activities as acts of Shirk or partnership with Allah. \nNow, the term 'Tawhidi Janata' literally means a group of people who strongly believe in Tawhid or the oneness of Allah and also denounce any kind of partnership with Allah. Labelling a group of people in this way by themselves, however, is quite troubling and misleading. It indicates that those who don't endorse the group and its activities are not believers in the oneness and supremacy of Allah, and so they are not true Muslims. This kind of inference is not only dangerous but also unacceptable. In Islam, there is no such rule or obligation that the Muslims have to declare themselves as Tawhidi or endorse a group of people who claim themselves as 'Tawhidi Janata'.\nWhat is the so-called 'Tawhidi Janata' doing? Last week, they attacked supporters of baul singer Abul Sarkar in Manikganj. The singer was recently arrested in a case over derogatory remarks about religion. Earlier in September, a group of people stormed the grave of Nura Pagla in Rajbari and set it ablaze. They also exhumed Nura Pagla's shrouded corpse and burned it on the street. Early this year, a person who harassed a female student at the Dhaka University campus was garlanded by a small group under the banner 'Tawhidi Janata'.\nThroughout the year, several shrines across the country were attacked and vandalised by those who claimed to be 'Tawhidi Janata' in the pretext of anti-religious activities. There is no denying the fact that a number of shrines in the country are infamous for objectionable activities like drug abuse in the disguise of religious rituals. Some are also used by local goons for moneymaking. It does not mean that someone has to vandalise the shrines. Instead, they need to ask the administration to curb these misdeeds and keep the shrines free from all types of aberrations. \nAgain, some religious extremists also attack the gatherings of bauls (Baul Sadhu Sanga) in different places of the country, alleging the bauls for disrespecting Islam and practising a distorted culture. Though harassing the bauls is not new, incidents have intensified in recent times, which is quite alarming. It is also not unlikely that supporters and activists of the ousted regime are in the group of 'Tawhidi Janata' in disguise to destabilise the country with the backing of a neighbouring country. So, the government needs to take strict measures against these mischief-makers for taking law into their own hands. Islamic scholars also need to stand against such aggressions in the name of religion.\nasjadulk@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "No aggression in the name of religion",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/no-aggression-in-the-name-of-religion-1764335449",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-11-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       November 29, 2025 00:00:00  \n\n\"Exercise regularly; it keeps you fit and makes you feel happy,\" said Advocate Jahangir Hossain, General Secretary of the Morning Health Society, after a group exercise session on a Friday morning this month. The Morning Health Society, a non-profit organisation consisting of professionals from various fields, was established in Banasree, Dhaka, with the goal of promoting good health and raising awareness of the importance of physical exercise among local residents.\nModern urban life has become hectic, making it challenging for many city dwellers to find leisure time. However, it is essential to set aside time daily for exercise to keep both mind and body healthy. Free-hand exercises play a vital role in toning muscles and internal organs, improving blood circulation, and delivering fresh oxygen throughout the body. These exercises are especially effective for strengthening core muscles and increasing resilience. Additionally, regular exercise burns extra calories and helps prevent obesity-a root cause of many illnesses.\nFree-hand exercises offer numerous health benefits and can be done almost anywhere without special equipment. Despite the availability of modern gymnasiums in the city, many people find it difficult to maintain a regular gym routine due to time constraints. Free-hand exercises are a practical alternative that requires little time, no cost, and minimal space. These exercises can be performed at home, in parks or open fields. They provide an opportunity to break free from a sedentary lifestyle while enhancing overall fitness and confidence.\nIn today's fast-paced world, mental stress and dissatisfaction are common. Exercise serves as a powerful tool to block negative thoughts and promote mental tranquility. It also improves sleep quality-a critical factor for maintaining good health. People who exercise regularly often experience better mood and deeper rest compared to those who lead sedentary lives.\nTo promote lifelong health, experts recommend at least 30 minutes of moderate physical activity daily for all age groups, including children, adolescents and adults. Incorporating regular exercise into daily routines is a key to better physical and mental health and reducing the risk of chronic diseases.\nTaifur Rahman\nA Banker \ntaifurrahmanibbl@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Fitness facts",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/fitness-facts-1764335500",
        "news_paper_name": "The Financial Express",
        "publish_date": "29-11-2025"
    }
]