[
    {
        "full_article": "In fraught times, every restatement of the basic elements of free speech law and democracy is wholly welcome. The Supreme Court of India judgment quashing a Gujarat police case against Congress Member of Parliament (Rajya Sabha) Imran Pratapgarhi for posting an allegedly inflammatory poem on social media is a welcome intervention in favour of free speech. Its importance is that it restates nearly forgotten aspects of free speech jurisprudence in an era in which any speech can be criminalised if powerful or influential people claim to be hurt by it. The Court has reminded the police that they have to honour and preserve the freedom of expression of citizens. For overzealous policemen who rush to register a first information report (FIR) splattered with as many of speech-restrictive penal provisions as possible, even when it is clear that the complaint is politically or communally motivated, the Court has advised that they should consider the effect of spoken or written words based on the standard of their effect on “reasonable, strong-minded firm and courageous individuals, and not based on people with weak and vacillating minds”. “The effect of the spoken or written words cannot be judged on the basis of the standards of people who always have a sense of insecurity or of those who always perceive criticism as a threat to their power or position,” says the Bench comprising Justices Abhay. S. Oka and Ujjal Bhuyan.The Court has gone on to analyse the poem posted by Mr. Pratapgarhi. It finds that it is not concerned with any religion, race, language, regional group, caste or community and makes no imputation against any of them. It contains no appeal likely to cause disharmony or feeling of enmity, or hatred or ill-will. It dismisses as ‘ridiculous’ to accuse the appellant of any intention to outrage the religious feelings of any class by insulting its religion or belief. “The poem only tells the rulers what the reaction will be if the fight for rights is met with injustice.” In effect, the Court has found that none of the ingredients of the offences relating to divisive speech, speeches having a detrimental effect on public order or any insult or provocation against any religious sentiments, could be found in it. Overall, the verdict will have to serve as a guide to police officers deciding to invoke Section 196 of the Bharatiya Nyaya Sanhita (equivalent of the Section 153A of the Indian Penal Code), often under political direction, whenever a speech containing trenchant criticism of the government or Ministers is made by anyone. As defamation cannot be the subject of an FIR or a complaint, the police often invoke the sections related to speech restrictions to browbeat critics and dissenters. Published - March 31, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        laws\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        police\n                    \n                            /                      \n                        \n                        Indian National Congress\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        poetry\n                    \n                            /                      \n                        \n                        religion and belief\n                    \n                            /                      \n                        \n                        Caste\n                    \n                            /                      \n                        \n                        language",
        "headline_1": "​Timely restatement: on top court and Gujarat police case",
        "headline_2": "Free speech restrictions should be reasonable, and not a tool to stifle views",
        "link": "https://www.thehindu.com/opinion/editorial/timely-restatement-on-top-court-and-gujarat-police-case/article69393974.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "31-03-2025"
    },
    {
        "full_article": "Huge temp difference between two Mumbai areas shows what’s in store for Indian cities this summer\nA difference of 13°C in temperature within a 7km radius sounds hard-to-believe. It is the new normal, as witnessed in average temperature difference in March between Mumbai suburbs Ghatkopar (33°C) and Powai (20°C). Heat islands like Ghatkopar are complex urban phenomena – microclimate zones within cities – that urban planners are well aware of. Yet, planners, builders or regulators, let alone city govts, barely see the rash of over-construction in Ghatkopar or any similar cityspace as a crisis. An analysis of 14 cities in 13 countries long established that heat-retaining infra, such as concrete buildings and roads, poor vegetation, and localised pollution drive the difference in temperatures – about 12°C between an urban sprawl and a rural area. Powai’s artificial lake built in 1800s to boost Mumbai’s water supply, is still a lake, even if its water isn’t potable. Ironically, overbuilt Ghatkopar, near Bombay airport, is the gateway to Western Ghats.\nEvery year IMD’s heatwave warnings are starting earlier and over wider regions. UHIs, heatwaves and climate change have a complex interplay. By 2050, 68% of global population will be urban. Between 2018 and 2050, India, China, and Nigeria will account for 35% of growth in world urban population. UHI’s linked with shrinking green cover, impermeable surfaces – cement & asphalt roads, parking lots – and buildings that slow winds and trap heat. Heatwaves today are more frequent, last longer and are more severe. Urbanisation-linked emissions contribute to climate change – a 2013 study showed just 100 cities account for 20% of global carbon footprint.\nNone of this is new. But where are the master plans that take into account impact of urbanisation on the environment? Where’s the sense of urgency? Tree cover for shade and heat insulation has direct impact on energy consumption. Almost every city govt across India today is obsessed with ill-conceived “beautification drives”. Trees are the answer but from Mumbai to Delhi to Mussoorie, trees are felled to build and build. As for the cement poured into our cities, we’ve baked heat stress into our future.\n\n",
        "headline_1": "Cementing disaster",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/cementing-disaster/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-03-2025"
    },
    {
        "full_article": "Trump targets foreign students guilty of nothing more than having some views. It’s UnAmerican \nDemocracy and free speech are conjoined twins but it’s a rare govt that can abide both. Trump’s admin is worse than most. While US constitution is clear that no law should “abridge” freedom of speech, Trump’s second term has been notable for the crackdown on foreign students sympathetic to Gaza Palestinians. The names Ranjani Srinivasan, Alireza Doroudi, Mahmoud Khalil and Rumeysa Ozturk have made headlines. Indian student Badar Khan Suri was arrested merely for being married to the daughter of “a senior adviser to Hamas”. The latest is that hundreds of foreign students have been told via email to self-deport for their alleged “campus activism”.\nWhat kind of activism? “Activities in support of Hamas,” as US govt puts it. But mostly, it’s liking and sharing social media posts, and holding demonstrations in favour of suffering Palestinian civilians. As Srinivasan, who self-deported to Canada on March 11, told Al Jazeera, “If supporting the idea of human rights…is equated with supporting Hamas, then anyone in proximity to me…can just be picked up and made an example of.” This isn’t surprising because Trump had made his intent clear in an order titled ‘Additional Measures to Combat Anti-Semitism’, published on Jan 29. It mentions ‘campus’ six times. A day later, he said: “To all the resident aliens who joined in the pro-jihadist protests…we will find you, and we will deport you.”\nThe question is not whether US, as a sovereign state, is entitled to evict aliens it deems a “threat” – in Dec 2019, India had expelled German student Jakob Lindenthal for attending a CAA protest – but whether the label “pro-jihadist” has been fairly and reasonably applied. Ozturk’s crime, it seems, was merely that she coauthored an article in the student journal, asking her university president to endorse resolutions recognising “genocide” in Gaza. Ordinarily, it would be considered the exercise of free speech, which the US constitution does not expressly deny aliens. While US courts have so far resisted instant deportation orders in such cases, they may not always be effective. Dr Rasha Alawieh was deported to Lebanon despite a federal judge’s order for an in-person hearing. It’s a strange turn for a country that prides itself on free speech. Before muzzling more student voices, Trump and friends should consider what a US chief justice said in 1919: “The best test of truth is the power of the thought to get itself accepted in the competition of the market.”\n\n",
        "headline_1": "Voice-Off America",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/voice-off-america/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-03-2025"
    },
    {
        "full_article": "Imagine going out for a yummy meal—\nYou finish eating, get the bill, and feel…\nWait, what’s this extra charge at the end?\nA “service charge” that you didn’t intend!\nThis charge is like a tip already added,\nBut many customers felt confused and a bit miffed.\nDo I pay the service charge and tip too?\nIt made eating out tricky to do.\nWell, the Delhi High Court just made a call—\nRestaurants can’t force this charge at all!\nNow, when you see it on your bill,\nYou can say “no” and skip the extra fill.\nThis decision makes some people cheer,\nBut restaurant workers may worry, I fear.\nThe service charge often helped pay their wage,\nSo now, some might feel a bit underpaid.\nBut hey, tipping is still up to you—\nA kind gesture for good service is always cool!\nRestaurants now need to think things through—\nMaybe adjust prices or find something new.\nThe court’s ruling isn’t about things like gas or bread,\nWhere prices are controlled, so people are fed.\nIt’s more about letting the market decide—\nWhere to eat is a choice; it’s your ride.\nSo, next time you’re dining, bill in sight,\nPay what you owe and tip if it feels right.\nThe market will work itself out in the end—\nRestaurants and diners will find a way, my friend!\n\n",
        "headline_1": "The Service Charge Debate: What Happened and What It Means",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/the-service-charge-debate-what-happened-and-what-it-means/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-03-2025"
    },
    {
        "full_article": "Imagine writing a poem, sharing your thoughts,\nAnd suddenly, you’re in trouble—who would’ve thought?\nThis happened to Imran, a man in the news,\nFor sharing a poem—he got accused!\nThe police said his poem caused harm and dismay,\nBut the Supreme Court (SC) had something to say.\nThey said, “Hold on! Poems aren’t crimes,\nFree speech is a right, even in tough times.”\nFive lessons the SC made super clear:\n\nDon’t Fear Criticism: If people speak up, don’t call it a threat.\nTalk Back, Don’t Shut Down: If you don’t agree, just share your own sound.\nFreedom First: Laws can’t crush the right to be heard.\nJudges Must Protect Rights: They must be fair, not bend to a side.\nArt and Satire Matter: Comedy, art, and jokes bring joy and chatter.\n\nThe SC showed us freedom is strong,\nBut why did this case drag on so long?\nThe real surprise wasn’t the SC’s call—\nIt was that Imran had to fight this at all.\nOthers face trouble for jokes and views—\nKunal Kamra and Allahbadia, too.\nLet’s remember these lessons and make it clear:\nFreedom of speech should never bring fear!\n\n",
        "headline_1": "Freedom of Expression: A Poem and a Lesson",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/gen-zedits/freedom-of-expression-a-poem-and-a-lesson/",
        "news_paper_name": "The Times of India",
        "publish_date": "31-03-2025"
    },
    {
        "full_article": "Recent media reports suggest that the Public Administration Reform Commission of Bangladesh has proposed dividing the country into four administrative provinces as a means of decentralisation, aiming to establish a more efficient administrative system. However, it remains unclear whether this proposal also entails replacing the existing unitary parliamentary democracy with a federal system of governance. While federalism may be advantageous for vast nations such as the US, Russia, Indonesia, and India—where diverse social, cultural, and religious groups coexist—it is entirely unnecessary for a small and relatively homogeneous country like Bangladesh. A unitary parliamentary democracy remains the most suitable model for our governance.\nWhat Bangladesh truly requires is an effective and manageable administrative framework rather than an expansion of the flawed system we currently endure. The administrative structure we have inherited, dating back to colonial rule in 1793, is profoundly obsolete and continues to hinder national progress, exacerbating poverty and contributing to social, cultural, and political deterioration. No modern, civilised nation retains such an antiquated system, which bestows excessive power upon administrative officials—such as upazila nirbahi officers (UNOs), deputy commissioners (DCs), and divisional commissioners—who function almost as viceroys. While certain superficial modifications have been made, the core structure remains largely unchanged and retains its colonial character. A comprehensive and fundamental restructuring is long overdue.\nIt is imperative that we dismantle this antiquated framework and transfer all administrative authority to the union parishad (UP), thereby eliminating the district and upazila administrative tiers. The UP should be reconstituted as the primary governing authority at the local level. Urban and rural areas alike should be divided into UPs, with all members and the chairperson elected through a party-list proportional representation system (PRS), where feasible. The UP should function as a robust local legislative body, complemented by a fully autonomous administrative unit tasked with implementing and enforcing its decisions. This unit would oversee essential public services, including primary and secondary education, healthcare, infrastructure, law and order, social welfare, and employment opportunities for both men and women. In essence, the UP would bear direct responsibility for the well-being of every citizen. A more in-depth discussion of the advantages of a strengthened UP system warrants further exploration.\nBy abolishing the offices of the DCs and UNOs, we would effectively curtail excessive bureaucratic dominance, ensuring that governance is truly by the people and for the people. Rather than being subjected to distant bureaucratic rule, citizens would be served by locally accountable representatives within the UP.\nDividing Bangladesh into four provinces would necessitate an expansion of the bureaucracy at both the central and provincial levels, inevitably leading to increased administrative expenditures, corruption, nepotism, and favouritism. The long-term financial, social, and moral transformation of Bangladesh—particularly in rural areas—can only be achieved through a robust local government, not through the reinforcement of the colonial administrative \"iron frame.\" Advanced nations owe much of their stability and efficiency to the strength of their local governance structures. The US and UK, despite their imperfections, remain effective democracies largely due to the resilience of their local government systems.\nIntroducing a federal structure in Bangladesh would be catastrophic, not only due to the financial burden of sustaining multiple layers of government but also because of the nation's low levels of education and the deeply entrenched culture of political corruption. Such a transition would drive Bangladesh towards fragmentation, particularly given its sensitive geopolitical reality.\nTherefore, Bangladesh requires a strong central government wherein authority is concentrated within a single national framework—eschewing regional governments while ensuring that local UPs are empowered to function under national directives. Laws and governance must remain uniform across the nation and should be executed solely by the local government (UP) through its own independent administrative apparatus. The sooner we abolish the ineffective and corrupt DC and UNO offices, the sooner Bangladesh can progress towards a truly people-centric governance system, underpinned by an efficient and accountable UP administration.\nTayeb Husain is a retired college teacher and business executive based in Sweden.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n",
        "headline_1": "Should Bangladesh be divided into four provinces?",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/should-bangladesh-be-divided-four-provinces-3860651",
        "news_paper_name": "The Daily Star",
        "publish_date": "31-03-2025"
    },
    {
        "full_article": "As Ramadan draws to a close, let us carry forward the valuable lessons it instils in us. As a nation, we should strive to be more charitable, moderate, and grateful—virtues that Ramadan inspires. These values should not be confined to the month of fasting but should guide our actions throughout the year, fostering a more compassionate and just society. Let us hope that, as the month of Ramadan nears its end, we will have rekindled these values within ourselves and, indeed, passed them on to others.\nAt the same time, the joyous occasion of Eid-ul-Fitr is fast approaching. In anticipation of celebrating with their loved ones, tens of thousands of people have already begun leaving Dhaka by train, bus, and launch. Reports indicate that this year's Eid journey has been relatively smoother for most travellers, thanks to the strategic measures implemented by the authorities. The introduction of special train and bus services, along with enhanced traffic management, has helped ease congestion. We commend the government for its efforts to improve the transport sector and hope that such measures continue to be refined and expanded in the future.\nHowever, despite these improvements, there have been reports of passengers being overcharged in certain areas. We urge the authorities to remain vigilant and take strict action against those exploiting travellers during this festive season. Additionally, with a significant exodus from major cities—particularly Dhaka—law enforcement agencies must remain extra cautious to ensure that law and order are maintained. The risk of accidents, extortion, and theft increases during this period, and it is crucial for security personnel to remain on high alert on highways, in public transport hubs, and across both urban and rural areas.\nWe also call on citizens to prioritise their safety and security during this time. Travellers should be cautious while commuting and follow traffic and safety guidelines. Moreover, as we embrace the spirit of Eid, let us extend a helping hand to those less fortunate. Many underprivileged individuals struggle to partake in the celebrations due to financial constraints. We urge individuals, businesses, and organisations to come forward with donations, food assistance, and support so that the joy of Eid is shared by all, regardless of economic status.\nEid-ul-Fitr is a time of unity, compassion, and generosity. Let us ensure that these values remain at the core of our actions—not just during Eid, but throughout the year—so that Bangladesh continues to progress as a nation built on empathy, harmony, and social responsibility. We wish everyone a safe and joyous Eid.\n",
        "headline_1": "Wishing all a safe and joyous Eid",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/editorial/news/wishing-all-safe-and-joyous-eid-3860341",
        "news_paper_name": "The Daily Star",
        "publish_date": "31-03-2025"
    },
    {
        "full_article": "It is not easy to draw a portrait of Sanjida Khatun as she is a person with many identities and a lady with 10 hands, like the dashabhuja of Bangla myth. She is a singer par excellence; her renderings of Tagore songs are those of a maestro; she holds a special place along with Nilima Sen, Kanika Bandyopadhyay, Rajeshwari Dutta, and others. Usually, singers have no claim to scholarship on Tagore's songs, his music, literary works, or philosophy of life. From that perspective, Sanjida Khatun holds a special place among the Tagore scholars and her book Rabindra Sangiter Bhabasampad (The Richness of Tagore's Songs) has become a classic in its own right. She embodies the combination of a singer and a scholar, a rare feat that distinguishes her from all others in her respective field.\nThese two achievements are enough to define one as an accomplished person with a place among successful ones—but Sanjida Khatun has performed other tasks of importance. She was a professor of Bangla literature at government colleges and later joined Dhaka University. She left behind many students whom she had introduced to literature. As an academic, she stands tall among many with her analytical mind and eloquent way of presentation. In 1978, she earned a PhD from Visva Bharati, the university of Tagore. In the mid-1950s, she completed her MA in Bangla literature at the same university, which was highly exceptional at that time. As an academician, she continued her pursuit of new knowledge and earned a Doctor of Literature degree from Visva Bharati with her research on poetics based on phonetics, pronunciation and transformation—meaning of words in poetry. This highly original work was lauded by scholars when it was published from India.\nSanjida Khatun, the scholar, has penned many other books on literature, culture and society. Most of these books are based on Tagore's song. It is through songs and music that Sanjida Khatun observed the world around her. Music nourished her soul and drove her to embrace the challenges of life, both personal and social/national. But more than anything else, Sanjida Khatun was a cultural interlocutor, a defender of Bangalee national identity. From her college days, she was an activist, took part in the language movement, practised music, joined in all kinds of musical events and started a life-long journey with Tagore songs.\nSurprisingly, she never received any formal lesson in music. She was raised in a liberal, secular, enlightened and musical environment. Her father Dr Kazi Motahar Hossain, a great scholar and professor of mathematics at Dhaka University, was one of the key organisers of the \"Buddhir Mukti\" or \"Freedom of Intellect\" movement of 1920s in Dhaka. A friend of Kazi Nazrul Islam, his literary writings have earned a place of its own. He played Esraj and promoted music in the family. From early life, his daughter Sanjida Khatun distinguished herself as a cultural activist and a performer with promise. She returned from Shantiniketan with a master's degree and as an accomplished singer. It is not that she studied music at Shantiniketan, but as she said, music was always in the air and environment of Shantiniketan. At that time, the Pakistani ruling coterie did their best to confront the national struggle, both politically and culturally. This culminated in the imposition of military rule in 1958, all political parties were banned, civil rights curtailed, no political meeting or activity were allowed. It was a long era of darkness that was shattered in 1961 by people's initiative to observe Tagore's birth centenary by organising public programmes with songs and dance-drama. Tagore centenary was celebrated in other towns like Chittagong, Khulna, Sylhet, Rajshahi etc. Soon after the organisers in Dhaka felt the urge to keep the cultural activities alive and Chhayanaut was established with poet Sufia Kamal at the helm and Sanjida Khatun as its motor. Chhayanaut established a musical school to raise new generations of artists with a commitment to uphold the rich tradition of Bangalee culture. Sanjida Khatun dedicated herself to teaching, learning, and inspiring disciples to be skilled singers with commitment to serve the people in times of crisis. Chhayanaut, as a seat of learning and centre of public performance, ushered in a new upsurge in the cultural arena, especially with the early morning celebration of Bangla New Year under the banyan tree at Ramna Park. First held in 1967, this became the symbol of Bangalee people's resistance against Pakistani domination by upholding their cultural identity. In a short time Pahela Baishakh turned to be the largest secular festival of the nation.\nSince 1980, with the establishment of Rabindrasangeet Sammilon Parishad she embarked on a journey to take music lessons to the districts and small towns all over the country. She conducted workshops, teaching and touching the hearts of young aspirants and made a lasting impact. The Parishad, with more than 60 branches all over the country, organises annual conference alternatively in a district town, which exemplifies her commitment to the spread of cultural practices.\nIn 2001, an extremist religious group violently attacked the Baishakh festivities in the park, causing the death of many innocent spectators. The brutality caused deep pondering in Sanjida Khatun's mind, and she decided to add a new chapter in her work. She and her colleagues started a formal school with a medley of education and culture based on learning with pleasure. Nalanda added a new dimension to the concept and practice of education.\nSanjida Khatun embraced other tasks to rejuvenate the society with meaningful cultural practices. She headed the Bangladesh Bratachari Samity to organise camps promoting the practice of Bratachari. Pronunciation and recitation are other areas of her interest. She was a master tutor in this art and conducted workshops in Kanthashilon. Various domains of Sanjida Khatun's work represent the breadth of her philosophy and praxis of life.\nIn totality, she dedicated herself to building a society rooted in its culture and tradition, imbued with a secular liberal humanist spirit whereby to be a Bangalee meant to be universal also. She aspired to create a generation that could steer through the complexities of the modern world with a firm footing in its own culture and tradition. All her life, she worked with 10 hands, excelling in various acts, and enriching us with her dedicated, multifaceted contribution.\nShe is part of the cultural history of Bengal and Bangladesh and will remain a source of inspiration for nation-building.\n \nMofidul Hoque is an author, researcher and publisher, and a trustee of the Liberation War Museum.\n\nViews expressed in this article are the author's own. \nFollow The Daily Star Opinion on Facebook for the latest opinions, commentaries and analyses by experts and professionals. To contribute your article or letter to The Daily Star Opinion, see our guidelines for submission.\n \n",
        "headline_1": "Sanjida Khatun: Different and defiant",
        "headline_2": "",
        "link": "https://www.thedailystar.net/opinion/views/news/sanjida-khatun-different-and-defiant-3860261",
        "news_paper_name": "The Daily Star",
        "publish_date": "31-03-2025"
    }
]