[
    {
        "full_article": "The shooting of Charlie Kirk, a controversial, outspoken conservative commentator and political ally of U.S. President Donald Trump, has revealed, once again, the depth of polarisation of opinion in the country and its disturbing proclivity towards using lethal violence to settle debates. Ironically, Kirk was a vocal advocate of the Second Amendment right to bear arms, even as he espoused a range of right-wing values at liberal university campuses, and in curbing abortion rights, and limiting the rights of transgender and LGBTQ persons — all the while recruiting young voters to the Republican cause. The man arrested on suspicion of shooting him, Tyler Robinson, is said to have diverged from his own conservative family roots although few specifics or possible motives are established so far. This much is clear: years of political vitriol backed by policies built on the values of nativism, revisionism, exclusion, religiosity, and a hateful intolerance of social and ideological diversity have brought the shutters down on any channels for open-minded dialogue and bipartisanship that might have existed earlier.The U.S. is at a crossroads in terms of its standing as a moral and economic force espousing, respectively, for the merits of democracy and capitalism. Given the crackdown on and deportations of students, academics and residents protesting atrocities in Gaza, and the cruel family separations resulting from immigration raids, there are many who would doubt the claim that the U.S. remains the bedrock of substantive democracy. Economically, the rules-based international order that emerged through the years of the Washington Consensus stands in a shambles in some regards, with Mr. Trump’s tariff policy that fuelled a worldwide trade war bringing global supply chains to their knees. Nowhere is the impact of these tectonic shifts in the U.S.’s ideological and policy posture more keenly felt than on its own soil, with Democrats on the retreat after two Trump terms, and Republicans embracing their President’s political agenda, which is only an amorphous version of the classic conservatism that many of them adhere to. When conversations across the aisle fall silent, fear looms large, especially for minorities pushed to the fringes of the political discourse, and the desperate on all sides fall back on toxic gun culture to give vent to their frustrations with the status quo. Given that numerous past Presidents have tried and failed to start conversations on common sense gun control reform, including no fewer than 17 attempts by Barack Obama to introduce such legislation in Congress, it is only the emergence of a new, enlightened leadership in both parties that could hold out hope for a less fractured and hateful polity in the post-Trump years. Published - September 16, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        murder\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        politics\n                    \n                            /                      \n                        \n                        laws\n                    \n                            /                      \n                        \n                        personal weapon control\n                    \n                            /                      \n                        \n                        transgender\n                    \n                            /                      \n                        \n                        LGBT\n                    \n                            /                      \n                        \n                        abortion\n                    \n                            /                      \n                        \n                        political parties\n                    \n                            /                      \n                        \n                        democracy\n                    \n                            /                      \n                        \n                        hate crimes\n                    \n                            /                      \n                        \n                        students\n                    \n                            /                      \n                        \n                        Palestine",
        "headline_1": "Divided state: On the U.S., a fractured polity",
        "headline_2": "The U.S. needs a new enlightened leadership in the two major parties",
        "link": "https://www.thehindu.com/opinion/editorial/divided-state-on-the-us-a-fractured-polity/article70052953.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "Sports, like war, can be a continuation of politics by other means, but it always makes sense to question all the forms and avatars of politics. The India-Pakistan Asia Cup match on September 14, 2025 was preceded by demands that it be suspended. Shiv Sena (UBT) leader Uddhav Thackeray called it an “insult to national sentiment” while the AIMIM’s Asaduddin Owaisi argued that commercial gain had been valued over the lives lost in Pahalgam. Petitioners had also asked the Supreme Court to cancel the game. Yet, India captain Suryakumar Yadav had decided that his team would not shake hands with its Pakistani counterpart, calling it an “alignment” with government policy. It is striking that Mr. Thackeray and Mr. Owaisi, from different ends of the political spectrum, echoed the BJP-led government’s policy of disengagement from Pakistan, revealing how this debate has been circumscribed by notions of national solidarity. But the BCCI is also partly to blame for having long operated outside the purview of sports governance law, sustained by networks that still link administrators to ruling parties. Cricket has never been immune to politics: colonial India used it to negotiate power with imperial rulers and independent India and Pakistan invested their encounters with the weight of Partition. Yet, cricket, especially in the 1970s and 2000s, opened spaces for contact, with the field allowing a rivalry that was sporting rather than military.Today, this tradition is being eroded by the collective transformation of cricket into another theatre of conflict. Sportspersons are not soldiers and their gestures matter because they dramatise fellowship. To withdraw from even this minimal courtesy confuses solidarity with victims of terrorism with the repudiation of fellow athletes. The Asia Cup game showed how far Indian cricket has moved from the position that sport affirms the fraternity of ordinary life, with its rituals of rivalry and joy rising in defiance of violence and bloodshed. It is bad enough that the ICC places the India and the Pakistan teams in the same group in multilateral tournaments, creating repetitive match-ups to go with the inordinate influence the BCCI exerts on these events. Rather than compound these artificialities, Suryakumar and team should adopt the more responsible course and restore hand-shaking for the rest of the tournament. Sport is political, but it does not have to be war minus the shooting. International contests might mimic warfare, but the whole point of sport is lost if sportspersons behave as proxies of political leaders seeking to inflame passions to polarise people. Published - September 16, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                SEE ALL         \n                \n                    Remove     \n                PRINT\n            Related Topics\n        \n                        sport\n                    \n                            /                      \n                        \n                        war\n                    \n                            /                      \n                        \n                        Asia Cup Cricket\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        Supreme Court\n                    \n                            /                      \n                        \n                        Pahalgam terror attack 2025\n                    \n                            /                      \n                        \n                        BCCI\n                    \n                            /                      \n                        \n                        constitution\n                    \n                            /                      \n                        \n                        history\n                    \n                            /                      \n                        \n                        cricket\n                    \n                            /                      \n                        \n                        Shiv Sena-Uddhav Balasaheb Thackeray\n                    \n                            /                      \n                        \n                        All India Majlis-E-Ittehadul Muslimeen\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party",
        "headline_1": "Field and fraternity: On the India-Pakistan Asia Cup match",
        "headline_2": "Sport is political, but it must not be the stage for a theatre of conflict",
        "link": "https://www.thehindu.com/opinion/editorial/field-and-fraternity-on-the-india-pakistan-asia-cup-match/article70052911.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "SC’s limited intervention in the waqf case is a good example of smart judicial thinking \nSC’s limited intervention in the waqf case is welcome as it stays two contentious points that appeared at odds with the Constitution and personal rights, and places a safeguard for the control of waqf boards. At the same time, by not staying the larger Waqf (Amendment) Act 2025, it has avoided accusations of “judicial overreach”. Acknowledging Parliament’s supremacy in legislative matters, it has said that laws should be presumed to be constitutionally sound, and intervention must occur only in “rarest of rare cases”. \nThe new law, enacted in April, was meant to increase “transparency and accountability” in the administration of waqf properties. Data shows this is a genuine need because roughly five out of every eight such properties are disputed and encroached, or their legal status is unclear. However, giving district collectors the last word on waqf property disputes was not the best way to go about this. SC stayed this provision, saying it violates the separation of judicial and executive powers: “Collector cannot be permitted to adjudicate the rights of personal citizens.”\nThe law also lays down that a person making a waqf donation should have been a practising Muslim for at least five years. This was strongly opposed by Muslim organisations and opposition parties on various grounds, including personal property rights. SC stayed it because, “Without any mechanism, it will lead to an exercise of arbitrary power.” It will remain in abeyance until states frame rules to determine compliance. Whether SC will deal with the larger point – is such a precondition legally sound – is an interesting question.\nThe third concern that SC addressed in its order pertained to the space for non-Muslims in waqf bodies. The new law has opened the door for non-Muslim members, but SC has now capped their numbers at 4 out of 22 in the central council, and 3 out of 11 on state boards. This should allay fears of interference or a “takeover” of these boards by non-Muslims while petitions about the constitutionality of the waqf law itself are decided. That will take time, but for now, all sides – govt, opposition and Muslim groups – seem satisfied with the SC order.\n\n",
        "headline_1": "Well tweaked",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/well-tweaked/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "Sports & politics can never be separated, as India-Pak no-handshake showed \nThe high decibel chatter over whether India should play cricket with Pakistan was hard to top, but the no-handshake drama did it. Even what happened in the neighbours’ Asia Cup faceoff on Sunday has taken a backseat to what did not happen before and after it. This no-handshake powwow didn’t need any coals to make it hotter, still Pakistan Cricket Board has added some, by protesting that Indian players were ‘unsportsmanlike’. Meanwhile, Indian skipper Suryakumar Yadav has explained on behalf of his teammates that a few things in life are above sportsman spirit: their no-handshake stand was the Indian team honouring those killed in the Pahalgam terror attack and also the armed forces who undertook Op Sindoor. Critics say this is politics entering sports, but hasn’t it always already been inside? \nAnd yes, this sports-politics relationship often looks a bit of a muddle but how can it not when politics never has pristine purity? That India cannot play Pakistan bilaterally but can do so in a multilateral tournament can be seen as hypocrisy but it’s also about India’s Olympic ambitions, which will be shot if we don’t keep our multinational sport bargains. On the flip side, an Asia Cup without any India-Pak play makes little sense. And it’s hardly our neighbourhood alone that’s at sixes and sevens like this. Consider how the Paris Olympics saw Russian athletes unable to compete under their own flags while Israelis merrily did. IOC treats the invasion of Ukraine and the razing of Gaza as incomparable actions. This is a very subjective call and quite par for the course in geopolitics. Expecting sports diplomacy to have more consistency than governmental diplomacy is pie in the sky. \nIf this were a movie like Bajrangi Bhaijaan the Indians could have done a namaste and the Pakistanis responded with an aadaab while AR Rahman played in the background. It’s real life so sports won’t always have poetry. It’s also possible that politics’ intrusion into sports is not something objectionable. Perhaps it reflects a broader conversation about identity and values – a debate worth having.\n\n",
        "headline_1": "Not shaken, but stirred",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/not-shaken-but-stirred/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "In solidarity with Nepali protesters and Sourav Ganguly\nKamala glared at me as she entered the house. ‘How can you watch the match – as a token of protest we must at least boycott cricket telecasts.’ I was in my customary pose, slouched on the sofa dressed in the national costume of the Indian uncle – a dishevelled lungi and a shapeless banian. This added to her ire. ‘Look at you – shirtless and shameless!’\nI was determined not to lose my shirt over this exaggeration, so I stood up to do a lungi dance to demonstrate that I was decently dressed, but Kamala was the opposite of convinced. ‘Why do men keep taking their shirt off at the slightest provocation – whether it’s climbing on top of buildings during protests in Nepal or celebrating winning a cricket match.’ \nI think she was referencing Sourav Ganguly’s iconic topless T-shirt twirling moment at Lord’s in 2002, which was justifiable revenge for a similar act by Andrew Flintoff. But Kamala was not in the mood for cricket trivia. ‘There should be a dress code for men in public places!’ I didn’t know if she was talking about creepy pervs outside women’s colleges or fitness influencers making thirst trap reels in the gym. \n‘What’s good for the goose should be good for the gander – imagine if women started doing the same thing as men,’ she said. Before my imagination ran riot, I retorted I was not in a public place but my home, where I should be allowed to dress as I wish. Yeh andar ki baat hai. There cannot be a dress code at home. I patted my patriarchal paunch to prove my point, a little dreading how would Kamala stomach this naked display of domestic defiance.\nI also tried reverse psychology, saying just like no one should comment on a lady’s freedom to wear sleeveless blouses or short skirts, a man should be allowed to make his choices for comfort in his castle. Even the Father of the Nation was disparagingly called a half-naked fakir by Winston Churchill when he fought for our independence. In fact, shirts are a vestige of our colonial past. Kamala moved in for checkmate with a satisfied smirk on her face: ‘Cricket is colonial too! Even if FM has reduced our Lagaan.’ I refused to shake hands with her to register my protest. Selective outrage is a game that I can never win. \n\n",
        "headline_1": "Shirt off my back",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/shirt-off-my-back/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "As powerful a statement as PM made in both Imphal and Churachandpur, the road ahead is fraught. Can the state even remain united without justice and reconciliation?\nIn a state fractured by 29 months of ethnic strife, PM’s long-awaited visit clearly marked a solemn symbolic moment.\nThere’s wide agreement that his presence in both Churachandpur and Imphal – the emotional hearts of the Kuki-Zo and Meitei communities respectively – is a gesture loaded with political significance.\n\nBut gestures alone cannot heal wounds. And the big question that remains to be answered is, what next?\nRead the full story on TOI+.\n\n",
        "headline_1": "Manipur after Modi visit",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/manipur-after-modi-visit/",
        "news_paper_name": "The Times of India",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 16, 2025 00:00:00  \nBangladesh can take immense pride in its agricultural performance, only more so on the front of vegetable production. According to the United Nations Food and Agricultural Organisation (FAO), the country is now the third largest global vegetables producer after China and India. If the size of the country is taken into consideration, it is punier indeed compared to the two giants holding the top and the next spot respectively. This makes Bangladesh's achievement even more enviable. The country that has to scramble for farmlands for production of vegetables and fruits should also be credited for production of fruits---both local and exotic. Currently, the country has to its credit a total production of 17.90 million tonnes of vegetables. Fruit production also does not lag far behind with an output of 14.3 million tonnes in the fiscal year 2021-22. Over the past three years, the yield should go up further. Thanks are due to agricultural scientists, extended support and coordination through field-level programmes carried out by agricultural extension officers and, above all, farmers' adaptability to smart and advanced cultivation methods. \nSuch outstanding agricultural performances, however, have not been rewarded well enough either symbolically or economically. In the past five years, the production of vegetables has gone up by 15 per cent, next only to the rate of increase recorded by Uzbekistan and Nepal. The performance deserves extra celebrations because of the diversity of vegetables and fruits now being grown by enterprising and educated farmers. If vegetables like broccoli and capsicum have been introduced successfully, the range of fruits has outpaced expectation. Strawberry, dragon fruit, cashew nut, orange and even dates from Arabian deserts have been added to the fruit basket. Over the past 20 years, the number of fruits cultivated has gone up from 56 to 72. The number of vegetables cultivated presently stands at around 100 types.\nClearly, there is a shift not only in the preference for cultivation of vegetables and fruits but also a remarkable change in the consumption pattern of the people. People now tend to eat more vegetables and fruits than before when the main staple was rice. However, the poor and the lower middle class can hardly afford such delicacies. The economic compulsion has also acted as a decisive factor. Cultivation of vegetables as a cash crop brings more return than that of paddy. Fruits in this case lead the way. These are positive indicators in terms of human health. The indication of a change in dietary pattern of the nation is most welcome. \nHowever, there is a downside to the positive developments recorded so far. Vegetables and fruits cultivated are often laced with excessive pesticide apart from the indiscriminate use of chemical fertilisers. A lot needs to be done in order to minimise application of such fertilisers and pesticides. The field-level agriculture extension officers should play a decisive role in maintaining a balance. Yet another aspect of agriculture is the economy of scale. Farmers should be the prime beneficiaries of the rising farm output.\nUnfortunately, vested interests like the organised middlemen and rent seekers often disrupt the marketing mechanism by their unholy intervention in the process. This undesirable culture has to be dismantled. If a pool of trucks is pressed into service by the government through Bangladesh Road Transport Corporation (BRTC) and a freight compartment added for transportation of vegetables from production zones to urban centres, the vested interest groups of market chain can be eliminated. The growers deserve such government patronage.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Rising vegetable production and marketing",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/rising-vegetable-production-and-marketing-1757947884",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Mir Mostafizur Rahaman   |  \n       September 16, 2025 12:00:00  \nThunderstorms that batter South Asia each monsoon season now have a political echo: waves of popular revolt are sweeping away powerful regimes. After Sri Lanka, Bangladesh, and Nepal -- and to a lesser yet significant extent Indonesia -- mass upsurge by citizens has brought the collapse, or at least a serious weakening, of once entrenched governments. The common headline is clear: endemic corruption and yawning economic inequality are no longer tolerable. Young people -- often described as disillusioned, dispossessed, ignored -- are the spearhead of what may fairly be called a Monsoon Revolution.\nIn Sri Lanka, the 2022 economic meltdown (foreign reserves exhausted, shortages of fuel, medicines, food) exposed the Rajapaksa family's corrupt accumulation of power and wealth. Protests forced the exit of President Gotabaya Rajapaksa and the effective end of Rajapaksa dominance. The public outrage was not only about failing economy but about luxurious lifestyles of connected elites, foul loans, sweetheart deals, and gated impunity.\nIn Bangladesh, what began in mid-2024 as protests over discriminatory government job quotas rapidly turned into something far broader. Students first took to the streets demanding reform of the \"freedom fighters' quota\" in civil service positions. But the movement soon grew into a national uprising against authoritarianism, nepotism and corruption in the Awami League government. By August 2024, under pressure from mass protests, growing distrust in her rule, and apparently even the army distancing itself, Prime Minister Sheikh Hasina's 15-year reign came to an end. \nIn Nepal, in September 2025, protests led largely by youth and triggered by a social media ban erupted into violent confrontation, with images of elites' excesses providing fuel youth got infuriated with rising number of luxury hotels, and politicians' children flaunting status, while normal Nepalese suffered in poverty. Street protests left thousands injured, and dozens dead. The explosive situation forced Prime Minister K.P. Sharma Oli to resign. \nIndonesia has not, so far, seen its regime fall. But protests there have been spreading -- over lawmakers' lavish perks, allowances many times local minimum wages, and policies seen to favour elites and conglomerates. The public anger is being channelled, and some reforms have already have taken effect. \nIt seems that inequality in these countries has become so visible that protest is turning into revolution.\n\nIn Bangladesh, the Gini coefficient (a standard measure of income inequality, where 0 would be perfect equality, 1 extreme inequality) is estimated at ≈ 0.499 in 2022 nationally, with 0.446 in rural areas but 0.539 in urban ones, according to the Bangladesh Bureau of Statistics. That puts Bangladesh precariously close to \"high inequality\" classification. \nIn Nepal Gini coefficient in recent years is lower -- about 30.0 in 2022 -- though poverty and inequality persist, especially between urban and rural, Hill vs Terai, and across caste and ethnic lines.\nIn Sri Lanka, the last reliably measured Gini (2019) was≈ 37.7, higher than Nepal or Bangladesh, showing more acute income gaps. \nThese numbers tell part of the story: many promise of growth and economic progress are experienced only by a small slice of the population. Despite GDP growth, rising per-capita income, dropping aggregate poverty, the wealth and power remain concentrated.\nInequality alone may simmer, but corruption provides the spark.\nNepal's recent upsurge was sharply triggered by the dominance of \"nepo kids\" -- heirs of entrenched political dynasties who stepped into power without proven merit. For citizens weary of corruption, inequality, and joblessness, these privileged successors came to embody a rigged system that denies ordinary people opportunity. Their visible entitlement and detachment from public struggles deepened frustration, especially among Nepal's younger generation. What began as isolated protests soon transformed into a broad-based movement. At its core was a demand to dismantle hereditary politics and replace it with accountability, fairness, and a democracy that serves people rather than family legacies.\nSri Lanka's Rajapaksa family was accused of hiding vast fortunes offshore, manipulating state contracts, and pushing the country into unsustainable debt (including large loans from foreign powers) to fund grand infrastructure projects whose benefits disproportionately went to elites. After the crisis, parliament voted to strip former presidents and their widows of state-funded perks: allowances, pensions, housing and staff. These were seen as symbols of elite impunity. \nIn Bangladesh, under Hasina's tenure allegations of rigged elections, enforced disappearances, violent crackdowns on dissent, suppression of media and internet blackouts all accumulated with corruption scandals. The job quota system, originally intended to help marginalised groups, became tangled in favouritism, political loyalty and exclusion. Students decried how quotas for descendants of \"freedom fighters\" (a small percentage of the population) took up a disproportionate share of opportunities. \nMultiple reports (from civil society, Transparency International, etc.) show that property declarations by high officials are hidden, procurement contracts favour connected businesses, and middlemen are ubiquitous in government deals. The perception of corruption is high: Nepal ranks about 107th out of 180 in the 2024 Corruption Perceptions Index, with a score of only 34/100, placing it in the \"high corruption\" category. \nIn Indonesia protests were triggered when news broke that lawmakers were to receive a monthly housing allowance of about 50 million rupiah (roughly US$3,000), nearly ten times Jakarta's minimum wage\n(≈ $337). That kind of disparity, especially when combined with austerity for ordinary services and rising cost of living, ignites public outrage. Transparency International notes Indonesia's CPI score at about 37/100, underlining that corruption remains systemic. \nOne of the distinguishing features of these revolts is that they are not led by established political parties (at least initially), but by young people tapped into digital media. The images of corruption, the bandwidth for comparisons (elite homes, flashy lifestyles, contrast with queues for food or medicine), spread widely via social media. What might once have been remote stories are now visceral daily evidence. This visibility erodes legitimacy.\nThe cost of living, rising inequality, and austerity measures have increased the burden on ordinary citizens. When lawmakers earn ten times the minimum wage for perks, while students, factory workers, small farmers struggle, legitimacy comes under threat. It may not lead immediately to regime change -- but maintaining status quo is becoming harder.\nThese revolutions are not spontaneous eruptions; they are outcomes of cumulative failures. \nWhen corruption scandals implicate ruling families, ministers, officials -- yet investigations drag, or tied institutions are compromised -- people see a double standard. The law seems to apply selectively. \nIn Sri Lanka, former presidents and presidential relatives felt secure in erecting monuments, building palatial houses, investing in luxury overseas property. In Bangladesh, crackdowns on dissent, arrests of students and journalists, even internet blackouts, while elite patronage continues, raise the sense that rules are bent in favour of insiders. \nIn Nepal, declarations of assets becoming hidden, or procurement rigged, reinforcing the idea that the elite have built a shadow system.\nAlthough many of these countries have posted strong GDP growth (Bangladesh in particular), and some poverty reduction, the benefits are deeply uneven. Jobs for youth are scarce; inflation, cost of essentials, housing, health are burdensome. Many young people have high expectations -- education, connectivity, exposure to global media -- which amplify the feeling that what is taken as \"progress\" has bypassed them.\nYoung people must have real voice in politics -- not just via protests but through formal channels. Job creation, affordable education, meaningful opportunities will sure to contribute.\nInflation control, price stability, social protection, public services -- these can act as buffers to prevent despair turning into desperation.\nCorruption and economic disparity are not just grievances: they are existential risk factors for regimes hoping to cling to power. The lesson: living standards, fairness, transparency, rule of law are not luxuries; they are foundations of legitimacy. South Asia is being remade now, whether its old regimes like it or not. If the new political order fails those it promises to serve, the next revolution may be just around the corner.\nmirmostafiz@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Peoples' battle against greed, disparity in S. Asia",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/peoples-battle-against-greed-disparity-in-s-asia-1757947998",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Syed Fattahul Alim   |  \n       September 16, 2025 00:00:00  \nAI is now the latest global craze. It appears to be the solution to everything. It is, no doubt, a good helping hand in every branch of scientific research. It is also replacing humans in doing many tasks that are repetitive such as data entry, customer service, bookkeeping, manufacturing assembly and transportation (driving cars). Even the jobs of paralegals (assistants to lawyers), accountants and some writers might be taken over by AI. But Albanian Prime Minister Edi Rama has broken all records by raising the status of AI as a cabinet minister who would run the public administration as well as public procurement department of his government.\nThe aim is to provide Albania with a corruption-free public procurement set up. This virtual Cabinet Minister named Diella meaning 'sunshine' in Albanian, is powered by AI. It is expected that Diella, a bot that had already been guiding applicants through a process to obtain official documents and now a fully-fledged minister with the help of AI would revolutionise the system of governance of the small, southeast European nation in the Balkan Peninsula. One may recall that in the past, under Albanian communist dictator, Enver Hoxha, Albania became one of the most isolated and repressive regime in Europe. However, with the fall of communism between 1991 and 1992 and the downfall of Enver Hoxha, what was then called, 'De-Enverization' of Albania began. The country then sought to end its isolation through closer ties with the West and initiated its transition in 1991 from a centrally planned economy to a market-based one in 1991. The country joined the Council of Europe in 1995 and became a member of NATO in 2009. A candidate for accession to EU, the country hopes to become a member EU by 2030, a timeline publicised by the country's current Prime Minister, Edi Rama. But the main obstacle to his country's becoming a EU member is corruption. Hence is this dive to eliminate corruption through appointing an AI-minister. It is yet another experiment by an Albanian leader to see if technology can do the job of a politician whose tasks involve making decisions on a host of issues that are often very complex and beyond the range of a digital system based basically on the information already known and recorded in computer servers. \nBut humans often experience completely new situations, the knowledge of which is yet to be broken down into digital bits and bytes and made available to the computer systems that can mimic human intelligence and make decisions independently, called AI. Edi Rama who won a fourth term in office in May and introduced his cabinet on Thursday (September 11) insists that Diella, meanwhile, has dealt with more than a million applications on the country's e-Albania, a governmental digital platform, where public services found in the offices and physical counters of the institutions are offered electronically. However, questions have been raised as Albania's constitution provides that a government minister must be a mentally competent citizen aged at least 18. \nDoes AI fit this definition to qualify as an Albanian government minister? The opposition, Democratic Party, has already labelled Rama's move as both unconstitutional and ridiculous. \nMr. Rama thinks since AI has no bias, or prejudice like human beings, it will be able to evaluate tenders impartially. But it all depends how the algorithms or the 'step-by-step set of instructions of the AI are designed to solve a problem. Now if the human who sets the instructions in Deilla's algorithm has particular bias, Dieilla's decisions will not be impartial. There are indeed instances of in-built biases in the algorithms of social media and job recruitment software of different companies in the West. So, Diella or any AI, for that matter, may not after all be the ultimate answer to administrative corruption as Mr. Rama would like to think!\nsfalim.ds@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Now AI to take the  job of minister!",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/now-ai-to-take-the-job-of-minister-1757948078",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-09-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       September 16, 2025 00:00:00  \nThe dismal state of maternal and newborn healthcare in Rangpur Division reflects the deep regional disparities in our country. The division experiences neonatal and infant mortality rates far above the national average, along with a worryingly high maternal mortality rate. These statistics are not isolated incidents; they underscore years of neglect by state and government policymakers.\nA major contributing factor is the high rate of child marriage. While the national rate of girls marrying before 18 is 27 per cent, in Rangpur it reaches 63 per cent. Consequently, pregnancies among girls under 19 are alarmingly common, placing severe strain on the health of both mother and child. These teenage mothers are children themselves, physically and mentally unprepared for parenthood.\nCoordination among healthcare facilities is another challenge. Union Health and Family Welfare Centers are poorly linked with community clinics, making it difficult to extend services to marginalized communities. Additionally, the lack of skilled personnel and modern infrastructure in government hospitals deprives many people of essential care.\nThe Ministry of Health cannot address these challenges alone. Collaboration with the education sector, social welfare services, and local administration is essential. Transportation facilities, especially ambulance services, must be provided to ensure healthcare access in remote char areas.\nNo national-level healthcare success can be achieved without addressing the crisis in Rangpur. Separate allocations, dedicated manpower, and targeted programs are urgently needed. Government initiatives alone are insufficient; public-private partnerships can strengthen healthcare centers, with the government supplying manpower and the private sector investing in infrastructure. All relevant authorities, including the Directorate General of Health Services, must prioritise this crisis and seriously consider expert recommendations for the Rangpur region.\nAshikujaman Syed\nBusiness Development Manager, Tianjin Pharmacn Medical Technology Co., Ltd., Tianjin, China\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Desperate state of maternal healthcare",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/desperate-state-of-maternal-healthcare-1757948149",
        "news_paper_name": "The Financial Express",
        "publish_date": "16-09-2025"
    }
]