[
    {
        "full_article": "At noon on June 25, 2025 (IST), India’s Shubhanshu Shukla lifted off with three other astronauts from NASA’s Florida spaceport to the International Space Station (ISS) as part of the Axiom-4 commercial mission. This is the first time an Indian has gone to orbital space since Rakesh Sharma in 1984. If the Dragon crew capsule docks successfully with the ISS on June 26, Mr. Shukla will also become the first Indian onboard the ISS. Over the next two weeks, he and the ISS crew will perform a suite of experiments carried by the Axiom-4 mission, including eight from the Indian Space Research Organisation (ISRO). Mr. Shukla is among the leading candidates to fly in India’s maiden human space flight mission, Gaganyaan, currently slated for 2027. For now, the Department of Space has not articulated the reasons for spending ₹548 crore to buy Mr. Shukla’s seat on Axiom-4. Against the backdrop of the ₹20,200-crore budget for Gaganyaan, Mr. Shukla’s paid flight to the ISS, packaged along with advanced training for him and back-up crewmate Prasanth Nair, will give India considerable insight into human space flight and how it is coordinated ahead of mounting its own astronaut expeditions, regardless of the money spent. However, this does not spare the Department of Space and ISRO from communicating the rationale and extent of these benefits, which has yet to happen.Space flight has changed considerably between Mr. Sharma’s and Mr. Shukla’s flights: the stakes today are multidimensional and more demanding. Axiom is a private entity contracted with NASA and SpaceX, and which sells seats to commercial missions to the ISS. But uncertainties linger over NASA’s future access to the Dragon crew capsules following Elon Musk’s spat with U.S. President Donald Trump. The effects of Mr. Trump’s tariffs and his willingness to honour predecessor Joe Biden’s commitments to India, given the major budget cuts he has proposed for 2026, are also unclear. And the ISS is set to be decommissioned by 2030. In this world, the future of India’s own space programme is caught between multiple futures. NASA and private U.S. companies, including Blue Origin, have said they would like to use Gaganyaan technologies in future missions as part of strengthening U.S.-India ties in the space sector. But even as the country balances commercial with public sector needs, it needs to remain a relevant provider of space flight services. The Indian government has signalled that it is willing to take positive steps to bolster the private sector but which, thus far, have been inadequate. Thus, once Mr. Shukla returns, ISRO’s to-do list will move to the next big challenge even as public expectations of it, including transparent communication, will soar.\r Published - June 26, 2025 12:20 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        nasa\n                    \n                            /                      \n                        \n                        India\n                    \n                            /                      \n                        \n                        USA\n                    \n                            /                      \n                        \n                        space programme\n                    \n                            /                      \n                        \n                        ISRO",
        "headline_1": "Qualified cheer: On Shubhanshu Shukla,  Axiom-4 mission",
        "headline_2": "Shubhanshu Shukla’s paid flight to ISS will provide insight on human spaceflight",
        "link": "https://www.thehindu.com/opinion/editorial/qualified-cheer-on-shubhanshu-shukla-axiom-4-mission/article69736282.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "Concerns surrounding citizenship faced by sections of society in India’s border States have come to the fore again with courts stepping in to provide temporary relief to harassed individuals. The issues arising from these cases are far from settled. On June 24, 2025, the Supreme Court of India stayed the deportation of Jaynab Bibi who was labelled a “foreigner”, first by the Foreigners’ Tribunal in Assam, and then by the Gauhati High Court. Despite hailing from a family whose members have lived in Assam for generations, and furnishing all documents, she has had to run from pillar to post to prove that she is an Indian citizen. A Bench of Justices K.V. Viswanathan and N. Kotiswar Singh ordered the Union government not to take any coercive steps against Ms. Bibi, till the next hearing in August. In the case of Rakshanda Rashid, the High Court of Jammu and Kashmir and Ladakh ordered the Union Home Secretary to repatriate the 63-year-old housewife to India. She was deported to Pakistan following the crackdown against Pakistani nationals after the Pahalgam terror attack in April. Ms. Rashid, a Pakistani national, had been staying in Jammu for the past 38 years with her husband and two children, and had a long-term visa. Her application for citizenship in 1996 is yet to be processed.In his order, High Court judge Rahul Bharti said human rights are the most sacrosanct component of a human life and that there are times when a court has to respond “SOS like” without going into the merits and demerits of a case, which can be decided on in due course of time. The lawyers for Ms. Bibi referred to Md. Rahim Ali @ Abdur Rahim vs The State Of Assam in 2024 in which the Supreme Court touched on the manner in which people in Assam were being randomly suspected as foreigners without any cogent evidence. “...[I]t is well settled that suspicion, however high it may be, can under no circumstances, be held to be a substitute for legal evidence,” it said, laying down the due process to be followed when an individual is declared a foreigner. The Citizenship (Amendment) Act of 2019, by offering citizenship to six non-Muslim communities in Afghanistan, Pakistan and Bangladesh, adopted a narrow and arbitrary view of “religious persecution”. The innate violence in the rhetoric of senior Bharatiya Janata Party Chief Ministers such as Yogi Adityanath and Himanta Biswa Sarma against minorities has heightened the anxiety felt by the marginalised, poor, sometimes undocumented, communities. Governments must uphold human rights and dignity of the individual, as provided for under the United Nations Universal Declaration of Human Rights, and not have to be nudged by courts. Published - June 26, 2025 12:10 am IST\n                          Read  Comments \n                Copy link  \n                        \n            \n                    Email     \n                                \n                \n                Facebook   \n                        \n            \n                Twitter    \n                        \n            \n                Telegram     \n                        \n            \n                LinkedIn     \n                        \n            \n                WhatsApp\n                \n                        \n            \n                Reddit      \n                        \n            READ LATER\n                    Remove     \n                \n                SEE ALL         \n                PRINT\n            Related Topics\n        \n                        India\n                    \n                            /                      \n                        \n                        Citizenship\n                    \n                            /                      \n                        \n                        judiciary (system of justice)\n                    \n                            /                      \n                        \n                        Assam\n                    \n                            /                      \n                        \n                        Jammu and Kashmir\n                    \n                            /                      \n                        \n                        Pakistan\n                    \n                            /                      \n                        \n                        human rights\n                    \n                            /                      \n                        \n                        Citizenship Amendment Act\n                    \n                            /                      \n                        \n                        Afghanistan\n                    \n                            /                      \n                        \n                        Bangladesh\n                    \n                            /                      \n                        \n                        Bharatiya Janata Party\n                    \n                            /                      \n                        \n                        United Nations",
        "headline_1": "Cause and effect: On human rights, citizenship cases",
        "headline_2": "Governments must uphold human rights in citizenship cases",
        "link": "https://www.thehindu.com/opinion/editorial/cause-and-effect-on-human-rights-citizenship-cases/article69736669.ece",
        "news_paper_name": "The Hindu",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "Gulf Arab states are caught in a policy/political dilemma that Iran-Israel war laid bare \nWith the ceasefire between Israel and Iran appearing to hold, Arab states in the region will be breathing a sigh of relief. Had the war escalated and taken on region-wide dimensions, no Arab state would have been immune. It’s a peculiarity of West Asia that most Arab states are not fully in control of their foreign policy dynamics, thanks to the play given to external forces. This in turn stems from their own insecurities and intra-regional rivalries. Case in point, Qatar’s Al Udeid airbase that Iran targeted in retaliation for US strikes on its nuclear sites is just one of 19 American bases dotting the entire region. \nThere’s no denying that Sunni Arab monarchies see a major threat in Shia Iran becoming too powerful. After all, with many of these Arab states hosting mixed populations, their biggest fear is region-wide sectarian/ethnic strife, which Tehran can instigate. The latest Israel-Iran skirmishes would have revived those fears. But the path chosen to counter this perceived threat complicates matters. Arab states today are open to a US-sponsored détente with Israel – the Abraham Accords – as an insurance against Iran. \nBut this in turn means they are willing to abandon the Palestinian cause, allowing Tehran to take the lead on this. Hamas’s main backer today is Iran, and no Arab state wants to host Palestinian refugees. This course also means the gulf between the Arab street and the Arab palace is widening, with Arab populations across the region still having a strong emotional connect to the Palestinian issue. But with Netanyahu clear that there cannot be a Palestinian state, Arab states can’t fully embrace Israel for the fear of engendering popular resentment. Therefore, Arab sheikhs have become prisoners of their own games. They don’t trust Iran, but can’t make full peace with Israel either. All the petro dollars in the world can’t solve that dilemma.\n\n",
        "headline_1": "Shaken sheikhs",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/shaken-sheikhs/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "Monsoon is hardly the time for a successful rationalisation of Bihar’s voter lists\nEC’s sudden decision at fag end of June to carry out a special revision of electoral rolls in Bihar barely three months before assembly elections – expected to kick off in Oct – is curious, confusing and bound to become a political controversy. Not least because, per EC’s June 24 circular, Bihar carried out its routine pre-poll voter roll update exercise, the special summary revision, this Jan. Updates continue. Keeping this in mind, EC has also said that a ‘pre-filled’ enumeration form will be made available to electors, which will have to be simply ‘re-submitted’. The real measure is a house-to-house verification of documents that support eligibility, read citizenship. So, question is, what’s changed in six months to expedite this exercise? \nPer current records, Bihar has over 7.8cr eligible voters. The last similar revision was in 2003. So, EC has set the voter roll of 2003 as a cut-off date – “probative evidence of eligibility, including presumption of citizenship”. That means those who registered as voters after 2003 will have to show proof of eligibility from a range of documents, including birth certificates and an NRC. This is where it gets tricky, and political. To furnish any document in remote parts of, say, north Bihar is akin to seeking lasting peace in West Asia. These are voters too poor to even migrate out. Even today, barely 75% of births in poverty-ridden Bihar are ‘registered’. So, birth certificates for those born after 2004, who also need to furnish parents’ documents, as proof of citizenship will throw up a gazillion issues. Already, there are fears that the ‘illegal immigrant’ electoral plank, in a state where EBCs include Muslim groups, will rear its head – as it did in pre-poll Jharkhand. \nEC cited migration, urbanisation to expedite the exercise in order to de-duplicate and rationalise polling booths by number and location. But surely LS polls 2024 returned rich layered data to help EC weed out intra- and inter-district duplications? The gnarly logistics of it apart, what is most surprising is EC ignoring it’s monsoon now. Rains swamp Bihar. Several districts already have orange alerts for heavy rains. Last year, floods in Aug destroyed standing kharif crops. Vagaries of monsoon are certainly not the time for poor Bihar voters to be scurrying around to prove, via documents, their eligibility as a voter.\n\n",
        "headline_1": "Rolling in rains",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-editorials/rolling-in-rains/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "And like that only everywhere\nIf you want to feel homesick, don’t travel. Means, I’m not saying, ‘Why you want to travel? Simply stay home, no.’ Opposite I’m saying: ‘Go, go, travel, travel.’ Kyon ki, everywhere we are meeting Indians. Making us think, ‘Arrey, I’m in India only. Plus, enjoying Western-bestern things too.’ It has been like that only for me this past fortnight. \nLast Saturday, I felt particularly at home. Intrigued, I’d gone to see Marriage Material at the Lyric theatre in Hammersmith. It was based on award-winning Brit journo Sathnam Sanghera’s book and centred on the Bains family’s Wolverhampton corner shop. The Iqbal Khan/Gurpreet Kaur Bhatti adaptation itself sounded shop-worn. My bad, coz I couldn’t keep up with the impenetrable Wolverhampton accent? Nope. My v. Brit companion assured me that not many in the local-desi audience could have understood all of it either. \nAh, the audience. It certainly wasn’t the garden party-throwing, yacht-owning, millions-owing, Mallya-fide malai-layer of uppity desis. This one was like a raucous Patiala-Patel gathering. The Mums still spoke with Indian accents and dressed in tacky Colaba/Janpath. The younger lot dressed and spoke London. That accent is certainly not English as she is spoke (affected) in India’s hangover Delhi clubs; in Calcutta, which has its own Oxbridge-Bong’; and by a certain gentleman whom it fits to a T. Saturday’s middle-class Mummy-Papa may have also felt more comfy in no-frills Lyric than in intimidating West End icons. No Royal Box here. So non-stratospheric ticket prices. But then no air-conditioning – on a heatwave weekend.  \nMercifully there were no cell-phone detonations during the play. Nor even the crackle of crisps. But gent in next seat and poly sweaTee kept up a steady rustle, delving noisily into his backpack, looking for some lost treasure of Tutankhana. His Mrs occasionally dug in too, crackling away in counterpoint. \nDuring intermission the hall filled with boisterous Inglish-vinglish exchanges  – and aromas. Is that a lamb samosa I see before me? Out damned greasy spot. I’m not wanting to eat you only. Too hot, no? \n                                                ***                                   \nAlec Smart said: “Sahib Trump and ‘Bibi’, but Iran’s no Ghulam.”\n\n",
        "headline_1": "We are the world",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/erratica/we-are-the-world-2/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "Whether the ceasefire holds & West Asia becomes less incendiary depends on US president’s ability to make Netanyahu stop using war as political cover and take peace seriously\nOne could have hoped that after 12 days of mutual skirmishing between Israel and Iran, the exclamation points would outweigh the question marks regarding the future of West Asia. But in this region, as always, nothing is as it seems, and nothing is as it sounds.\n\nLeaders from different countries, each driven by their own interests, are spreading unequivocal “facts” that, to this moment, remain unclear in their accuracy, reliability, or actual reflection of reality.\nRead the full story on TOI+.\n\n",
        "headline_1": "Can Trump tame Bibi?",
        "headline_2": "",
        "link": "https://timesofindia.indiatimes.com/blogs/toi-edit-page/can-trump-tame-bibi/",
        "news_paper_name": "The Times of India",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 26, 2025 00:00:00  \nUS President Donald Trump's involvement in the Israel-Iran war with the largest ever B-2 bomber fleet to bust Iranian nuclear facilities on June 21 and brokering of a ceasefire two days later could not be more contrasting. But this goes well with the capricious character of the incumbent US president. The swaggering president appears to consider himself the lord of all he surveys. This is exactly why he can deliver, as aptly expressed in a Bangla proverb, the deadly bite of a venomous snake and also aid the bitten victim with the antidote. However, the self-righteous president does all this to exhibit his supremacy to the world. Unsurprisingly, the ceasefire was dictated by him only before his arrival in the Netherlands for the annual North Atlantic Treaty Organisation (NATO) meeting so that he could brag over the 'war for peace' initiative and impress the European members. Thus he even assumed the big brotherly role of rebuking both Israel and Iran on arrival in the Netherlands for minor breach of truce he has brokered. \nA fragile ceasefire agreement after 12 days of war is certainly welcome. But the question is if it will hold and bring the warring parties to the negotiating table. At times, warring parties/party agree/agrees to a ceasefire in order to buy time for rearming or further preparation. The Jewish state did it at the time of its conflict with the Hamas before launching more intensive attacks on Gaza. In the war with Iran, Israel made it clear that it had the dual objectives of bringing an end to Iran's nuclear arsenal capabilities and a regime change. Trump, however, declares he had no intention of changing the Iranian regime but was dead set to obliterate the nuclear facilities on the verge of producing weapons of mass destruction.\nAlthough US intelligence report has so far held that Iranian nuclear facilities were not engaged in production of nuclear weapons, Trump refuted the claim only to side with Israel and made the bunker-buster attacks at three key Iranian facilities. Even then his claim of total obliteration of those nuclear facilities has been contradicted by independent sources. The stock of enriched uranium in Iran was transported elsewhere before the B-2 bomber attack. Will the US and Iran resume negotiation on the future of Iranian nuclear programmes? There is no answer. Even more important it is to bring about a permanent peace in Palestine where the Israeli genocide and occupation are the source of an unending regional turmoil. \nThere are other pressing issues concerning the Israeli aggression on Iran. Will the International Atomic Energy Agency (IAEA) be assigned to carry out an investigation to determine whether Iran's nuclear programme was for peaceful purposes or not? If it is found that the programme was nowhere near achieving the military capability, will there be a trial of the crime of killing of a number of Iranian nuclear scientists and top brass military personnel at the International Court of Justice (ICJ)? No amount of reparation is enough for human lives let alone those of the nuclear scientists, highest ranking military officers and innocent civilians. Damage to property and infrastructure is also extensive. Meanwhile the killing in Gaza strip continues and it should stop. The international community should press for a permanent solution to the Palestinian issue by recognising the people's sovereign statehood in their own land including the Israeli occupied areas in West Bank and Gaza strip.\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Will Israel-Iran ceasefire sustain?",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/will-israel-iran-ceasefire-sustain-1750864031",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n   Atiqul Kabir Tuhin   |  \n       June 26, 2025 00:00:00  \n\nFood on the plate is the very first thing people need every day, and with rice being the staple, its price is a matter of overriding concern for the general public. When rice prices soar, the poor and low-income people become more food insecure. A steady rise in rice prices has already forced this low-income people to spend a disproportionate share of their earnings on rice alone, cutting back on fish, meat, and other vital sources of protein. As such, rice price is a major public concern and a particularly sensitive issue. \nYet the rice market remains highly vulnerable to manipulation, dominated by large millers and traders. This syndicate exploits the system for windfall profits by hoarding and creating artificial shortages. On one hand, they short-change farmers, leaving them barely able to recover production costs; on the other, they charge consumers exorbitantly high prices. \nLarge millers exert control over virtually every stage of the supply chain, from the initial procurement of paddy and its subsequent processing, storage to the final stages of distribution to wholesalers and retailers. This monopoly has created a fertile ground for market distortions.\nFor example, in this Boro season, large millers have purchased paddy from farmers at low prices before Eid, stored it in warehouses, and are now raising prices under various pretexts. Over the past week, rice prices have soared by Tk 2 to 8 per kilogram, despite the bumper harvest and adequate stock. According to the Department of Agricultural Extension, a record 21.4 million tonnes of Boro paddy have been harvested from 0.48 million hectares of land. So the question is, why is this sudden price hike in spite of the good harvest and adequate stock?\nTo curb persistent inflation, the government has been pursuing a contractionary monetary policy since assuming office about 10 months back. Besides, over 200 traders were given permission to import rice and the import duties were substantially waived. And yet, despite these significant initiatives, there has been little to no reflection of their intended impact on the rice market. Even though the overall inflation trend shows a modest downward trajectory and prices for most other consumer items have begun to cool, rice remains an exception. A brief, modest decline was indeed observed in the past month, largely due to the peak Boro harvesting season. However, as soon as the newly harvested rice left the hands of farmers and entered the supply chain, millers began increasing prices. This has been a recurring issue for years, and it is time to establish much-needed transparency and accountability in this murky supply chain.\nIn order to do so, the policymakers can consider establishing a comprehensive and integrated rice supply network which would create a system of transparency and accountability. It could begin with a mandatory, dedicated rice supply chain registration and licensing system. Every single actor involved in the rice supply chain, from the individual farmer who sells directly to the market in large quantities, to intermediaries like wholesalers, millers, traders, dealers, and hoarders, and finally to large-scale retailers, would be legally required to hold a specific license to deal in rice. Only licensed individuals or entities would be permitted to engage in any rice-related trade activity, whether it's processing, large-scale storage, or marketing. Robust mechanisms should be established to collect and maintain accurate, up-to-date data on all license holders, including their legal identity, operational capacity (e.g., milling capacity, storage capacity), geographic location, and business history. All this comprehensive license holder data would be centrally stored at the upazila and district level for localised monitoring.\nBesides, all the millers and traders throughout the supply chain should be mandated to submit weekly updates regarding their current stock levels of paddy and rice, volumes produced or processed, utilisation of their licensed storage capacity, purchase and selling prices, and total sales volumes from the preceding week. These weekly reports should be submitted directly to the respective Deputy Commissioner's office, which would be responsible for receiving, verifying, and analysing this data. Such frequent data submission would allow for the early detection of unusual spikes in stock levels that could flag potential hoarding. This constant scrutiny would also act as a powerful deterrent against illegal stockpiling outside registered capacities, making it difficult for unscrupulous entities to manipulate supply or prices without detection. Furthermore, real-time data on supply, demand, and prices would enable the government to make more informed decisions regarding imports, exports, and market interventions.\nWhile some consumer protection measures currently exist at the retail level, they are insufficient to oversee the entire complex supply chain. Department of Consumer Rights Protection (DCRP) will have to play a pivotal role, coordinating closely with district administrations. They will have to regularly inspect the licensed warehouses to verify reported stock levels against actual inventory, cross-check their transaction documents, and ensure full compliance with all licensing rules and reporting requirements. \nLastly, it will require strong collaboration among relevant ministries, particularly the Ministry of Food, the Ministry of Agriculture and the Ministry of Commerce. Through such a unified, inter-ministerial approach, the rice supply chain can be managed in a coherent manner, rather than the current fragmented system. This will pave the way for a transparent supply chain. \nUltimately, the successful implementation of such a unified licensing and monitoring framework can dramatically improve transparency and eliminate entrenched malpractice in the rice market. A transparent supply chain is not only essential for protecting consumers and farmers but also a necessary step towards ensuring food security and good governance.\naktuhin.fexpress@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "How to ensure a transparent rice supply chain",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/how-to-ensure-a-transparent-rice-supply-chain-1750864082",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 26, 2025 00:00:00  \n\nThe recent conflicts in Gaza, Ukraine, and the rising tensions involving Iran have painted a grim picture, not just politically and socially, but economically as well. These wars may be fought in specific regions, but their economic shockwaves are felt across the globe.\nGlobal trade routes have been disrupted, especially in the energy and agricultural sectors. Oil and gas prices have surged due to instability in the Middle East, affecting everything from transport to electricity bills. The war in Ukraine has restricted grain exports, worsening food insecurity in many parts of Africa and Asia. Inflation is rising, interest rates remain high, and international business confidence is declining.\nMultinational companies are delaying investments, and local businesses are being forced to cut jobs due to higher costs and supply shortages. From stock markets to small shops, the damage is widespread. This is not just a regional issue; it's a global economic emergency.\nThe longer these conflicts persist, the deeper the scars will be on fragile economies still recovering from the COVID-19 pandemic. Against this grim backdrop, world leaders must prioritise diplomatic efforts and international cooperation to stop these conflicts before they deepen the economic wounds of the world.\nYana Islam Rifa\nBachelor of Business Administration \nNorth South University \n yanaislamrifa@gmail.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "War without borders",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/war-without-borders-1750864101",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-06-2025"
    },
    {
        "full_article": "\n / EDITORIAL\n \n       June 26, 2025 00:00:00  \n\nChild health remains a fundamental pillar of human development. Bangladesh has made notable strides in reducing child mortality over the past few decades, largely due to the success of its national immunisation programmes. Diseases like polio, measles, and tetanus … once widespread and deadly … have been brought under control through widespread vaccination. However, recent reports of vaccine shortages in more than 30 districts are deeply concerning as it could threaten the years of progress in this vital area.\nEven though officials are claiming that supply delays are temporary, the situation on the ground tells a different story. Parents in districts such as Cumilla, Brahmanbaria, Mymensingh, Jessore, and Jhenaidah have been unable to vaccinate their children in time due to the unavailability of key vaccines like PCV, IPV, Pentavalent, and MR. The consequences of this could be severe, as delays in immunisation increase the risk of disease resurgence, endangering not just children but the broader public health.\nThere are several contributing factors behind this crisis. Firstly, delays in the implementation of the government's operational plan have hindered timely access to funds required for vaccine procurement. Secondly, logistical challenges, including a shortage of vehicles and manpower, have disrupted vaccine distribution to local health centers. Lastly, a reduction in vaccine support from international organizations such as Gavi and COVAX has created supply gaps that Bangladesh is struggling to fill on its own.\nEvidence from past incidents underscores the risks of under-vaccination. In Chittagong, a significant increase in measles cases was observed when vaccinations were missed. Similarly, a deadly diphtheria outbreak among unvaccinated Rohingya refugees further highlights the devastating consequences of disrupted immunization.\nTo safeguard public health, the government must act immediately to address this crisis. It should ensure a steady supply of vaccines, improve transportation and distribution systems, and closely monitor local stocks. The Expanded Programme on Immunization is one of Bangladesh's most celebrated public health successes. Protecting this legacy is not just a strategic necessity; it is a moral obligation to our nation's children and future.\nAshikujaman Syed & Samia Jahan Shefa\nsyedashikujaman@yahoo.com\nShare if you like \n\n\n\n\n\n\n\n\n\n\n",
        "headline_1": "Dangers of not vaccinating children",
        "headline_2": "",
        "link": "https://today.thefinancialexpress.com.bd/editorial/dangers-of-not-vaccinating-children-1750864124",
        "news_paper_name": "The Financial Express",
        "publish_date": "26-06-2025"
    }
]